/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>);
impl <T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T { ::std::mem::transmute(self) }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl <T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl <T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self { Self::new() }
}
impl <T> ::std::marker::Copy for __IncompleteArrayField<T> { }
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl <T> __BindgenUnionField<T> {
    #[inline]
    pub fn new() -> Self { __BindgenUnionField(::std::marker::PhantomData) }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T { ::std::mem::transmute(self) }
    #[inline]

pub const RTE_RED_MAXP_INV_MIN: ::std::os::raw::c_uint = 1;
pub const RTE_RED_MAXP_INV_MAX: ::std::os::raw::c_uint = 255;
pub const RTE_RED_2POW16: ::std::os::raw::c_uint = 65536;
pub const RTE_RED_WQ_LOG2_NUM: ::std::os::raw::c_uint = 12;
/**
 * Signature of callback back function called when an alarm goes off.
 */
pub type rte_eal_alarm_callback =
    ::std::option::Option<unsafe extern "C" fn(arg:
                                                   *mut ::std::os::raw::c_void)>;
extern "C" {
    /**
 * Function to set a callback to be triggered when us microseconds
 * have expired. Accuracy of timing to the microsecond is not guaranteed. The
 * alarm function will not be called *before* the requested time, but may
 * be called a short period of time afterwards.
 * The alarm handler will be called only once. There is no need to call
 * "rte_eal_alarm_cancel" from within the callback function.
 *
 * @param us
 *   The time in microseconds before the callback is called
 * @param cb
 *   The function to be called when the alarm expires
 * @param cb_arg
 *   Pointer parameter to be passed to the callback function
 *
 * @return
 *   On success, zero.
 *   On failure, a negative error number
 */
    pub fn rte_eal_alarm_set(us: u64, cb: rte_eal_alarm_callback,
                             cb_arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Function to cancel an alarm callback which has been registered before. If
 * used outside alarm callback it wait for all callbacks to finish execution.
 *
 * @param cb_fn
 *  alarm callback
 * @param cb_arg
 *  Pointer parameter to be passed to the callback function. To remove all
 *  copies of a given callback function, irrespective of parameter, (void *)-1
 *  can be used here.
 *
 * @return
 *    - value greater than 0 and rte_errno not changed - returned value is
 *      the number of canceled alarm callback functions
 *    - value greater or equal 0 and rte_errno set to EINPROGRESS, at least one
 *      alarm could not be canceled because cancellation was requested from alarm
 *      callback context. Returned value is the number of succesfuly canceled
 *      alarm callbacks
 *    -  0 and rte_errno set to ENOENT - no alarm found
 *    - -1 and rte_errno set to EINVAL - invalid parameter (NULL callback)
 */
    pub fn rte_eal_alarm_cancel(cb_fn: rte_eal_alarm_callback,
                                cb_arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __time_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type off_t = __off_t;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::std::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
pub type pthread_t = ::std::os::raw::c_ulong;
pub type __m128i = [::std::os::raw::c_longlong; 2usize];
extern "C" {
    /**
 * Function to terminate the application immediately, printing an error
 * message and returning the exit_code back to the shell.
 *
 * This function never returns
 *
 * @param exit_code
 *     The exit code to be returned by the application
 * @param format
 *     The format string to be used for printing the message. This can include
 *     printf format characters which will be expanded using any further parameters
 *     to the function.
 */
    pub fn rte_exit(exit_code: ::std::os::raw::c_int,
                    format: *const ::std::os::raw::c_char, ...);
}
/**
 * The atomic counter structure.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_atomic16_t {
    /**< An internal counter value. */
    pub cnt: i16,
}
#[test]
fn bindgen_test_layout_rte_atomic16_t() {
    assert_eq!(::std::mem::size_of::<rte_atomic16_t>() , 2usize , concat ! (
               "Size of: " , stringify ! ( rte_atomic16_t ) ));
    assert_eq! (::std::mem::align_of::<rte_atomic16_t>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( rte_atomic16_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_atomic16_t ) ) . cnt as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_atomic16_t ) , "::"
                , stringify ! ( cnt ) ));
}
impl Clone for rte_atomic16_t {
    fn clone(&self) -> Self { *self }
}
/**
 * The atomic counter structure.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_atomic32_t {
    /**< An internal counter value. */
    pub cnt: i32,
}
#[test]
fn bindgen_test_layout_rte_atomic32_t() {
    assert_eq!(::std::mem::size_of::<rte_atomic32_t>() , 4usize , concat ! (
               "Size of: " , stringify ! ( rte_atomic32_t ) ));
    assert_eq! (::std::mem::align_of::<rte_atomic32_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rte_atomic32_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_atomic32_t ) ) . cnt as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_atomic32_t ) , "::"
                , stringify ! ( cnt ) ));
}
impl Clone for rte_atomic32_t {
    fn clone(&self) -> Self { *self }
}
/**
 * The atomic counter structure.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_atomic64_t {
    /**< Internal counter value. */
    pub cnt: i64,
}
#[test]
fn bindgen_test_layout_rte_atomic64_t() {
    assert_eq!(::std::mem::size_of::<rte_atomic64_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( rte_atomic64_t ) ));
    assert_eq! (::std::mem::align_of::<rte_atomic64_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_atomic64_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_atomic64_t ) ) . cnt as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_atomic64_t ) , "::"
                , stringify ! ( cnt ) ));
}
impl Clone for rte_atomic64_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
/**
 * Enumeration of all CPU features supported
 */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_cpu_flag_t {
    RTE_CPUFLAG_SSE3 = 0,
    RTE_CPUFLAG_PCLMULQDQ = 1,
    RTE_CPUFLAG_DTES64 = 2,
    RTE_CPUFLAG_MONITOR = 3,
    RTE_CPUFLAG_DS_CPL = 4,
    RTE_CPUFLAG_VMX = 5,
    RTE_CPUFLAG_SMX = 6,
    RTE_CPUFLAG_EIST = 7,
    RTE_CPUFLAG_TM2 = 8,
    RTE_CPUFLAG_SSSE3 = 9,
    RTE_CPUFLAG_CNXT_ID = 10,
    RTE_CPUFLAG_FMA = 11,
    RTE_CPUFLAG_CMPXCHG16B = 12,
    RTE_CPUFLAG_XTPR = 13,
    RTE_CPUFLAG_PDCM = 14,
    RTE_CPUFLAG_PCID = 15,
    RTE_CPUFLAG_DCA = 16,
    RTE_CPUFLAG_SSE4_1 = 17,
    RTE_CPUFLAG_SSE4_2 = 18,
    RTE_CPUFLAG_X2APIC = 19,
    RTE_CPUFLAG_MOVBE = 20,
    RTE_CPUFLAG_POPCNT = 21,
    RTE_CPUFLAG_TSC_DEADLINE = 22,
    RTE_CPUFLAG_AES = 23,
    RTE_CPUFLAG_XSAVE = 24,
    RTE_CPUFLAG_OSXSAVE = 25,
    RTE_CPUFLAG_AVX = 26,
    RTE_CPUFLAG_F16C = 27,
    RTE_CPUFLAG_RDRAND = 28,
    RTE_CPUFLAG_FPU = 29,
    RTE_CPUFLAG_VME = 30,
    RTE_CPUFLAG_DE = 31,
    RTE_CPUFLAG_PSE = 32,
    RTE_CPUFLAG_TSC = 33,
    RTE_CPUFLAG_MSR = 34,
    RTE_CPUFLAG_PAE = 35,
    RTE_CPUFLAG_MCE = 36,
    RTE_CPUFLAG_CX8 = 37,
    RTE_CPUFLAG_APIC = 38,
    RTE_CPUFLAG_SEP = 39,
    RTE_CPUFLAG_MTRR = 40,
    RTE_CPUFLAG_PGE = 41,
    RTE_CPUFLAG_MCA = 42,
    RTE_CPUFLAG_CMOV = 43,
    RTE_CPUFLAG_PAT = 44,
    RTE_CPUFLAG_PSE36 = 45,
    RTE_CPUFLAG_PSN = 46,
    RTE_CPUFLAG_CLFSH = 47,
    RTE_CPUFLAG_DS = 48,
    RTE_CPUFLAG_ACPI = 49,
    RTE_CPUFLAG_MMX = 50,
    RTE_CPUFLAG_FXSR = 51,
    RTE_CPUFLAG_SSE = 52,
    RTE_CPUFLAG_SSE2 = 53,
    RTE_CPUFLAG_SS = 54,
    RTE_CPUFLAG_HTT = 55,
    RTE_CPUFLAG_TM = 56,
    RTE_CPUFLAG_PBE = 57,
    RTE_CPUFLAG_DIGTEMP = 58,
    RTE_CPUFLAG_TRBOBST = 59,
    RTE_CPUFLAG_ARAT = 60,
    RTE_CPUFLAG_PLN = 61,
    RTE_CPUFLAG_ECMD = 62,
    RTE_CPUFLAG_PTM = 63,
    RTE_CPUFLAG_MPERF_APERF_MSR = 64,
    RTE_CPUFLAG_ACNT2 = 65,
    RTE_CPUFLAG_ENERGY_EFF = 66,
    RTE_CPUFLAG_FSGSBASE = 67,
    RTE_CPUFLAG_BMI1 = 68,
    RTE_CPUFLAG_HLE = 69,
    RTE_CPUFLAG_AVX2 = 70,
    RTE_CPUFLAG_SMEP = 71,
    RTE_CPUFLAG_BMI2 = 72,
    RTE_CPUFLAG_ERMS = 73,
    RTE_CPUFLAG_INVPCID = 74,
    RTE_CPUFLAG_RTM = 75,
    RTE_CPUFLAG_AVX512F = 76,
    RTE_CPUFLAG_LAHF_SAHF = 77,
    RTE_CPUFLAG_LZCNT = 78,
    RTE_CPUFLAG_SYSCALL = 79,
    RTE_CPUFLAG_XD = 80,
    RTE_CPUFLAG_1GB_PG = 81,
    RTE_CPUFLAG_RDTSCP = 82,
    RTE_CPUFLAG_EM64T = 83,
    RTE_CPUFLAG_INVTSC = 84,
    RTE_CPUFLAG_NUMFLAGS = 85,
}
extern "C" {
    /**
 * Get name of CPU flag
 *
 * @param feature
 *     CPU flag ID
 * @return
 *     flag name
 *     NULL if flag ID is invalid
 */
    pub fn rte_cpu_get_flag_name(feature: rte_cpu_flag_t)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Function for checking a CPU flag availability
 *
 * @param feature
 *     CPU flag to query CPU for
 * @return
 *     1 if flag is available
 *     0 if flag is not available
 *     -ENOENT if flag is invalid
 */
    pub fn rte_cpu_get_flag_enabled(feature: rte_cpu_flag_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * This function checks that the currently used CPU supports the CPU features
 * that were specified at compile time. It is called automatically within the
 * EAL, so does not need to be used by applications.
 */
    pub fn rte_cpu_check_supported();
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_char,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(::std::mem::size_of::<_IO_FILE>() , 216usize , concat ! (
               "Size of: " , stringify ! ( _IO_FILE ) ));
    assert_eq! (::std::mem::align_of::<_IO_FILE>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_FILE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_ptr as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_end as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_base as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_base as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_ptr as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_end as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_base as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_end as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_base as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_backup_base as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_backup_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_end as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _markers as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _markers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _chain as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _chain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _fileno as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _fileno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags2 as * const _ as
                usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _old_offset as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _old_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _cur_column as * const _
                as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _cur_column ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _vtable_offset as * const
                _ as usize } , 130usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _vtable_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _shortbuf as * const _ as
                usize } , 131usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _shortbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _lock as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _offset as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad1 as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad2 as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad3 as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad4 as * const _ as
                usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad5 as * const _ as
                usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _mode as * const _ as
                usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _unused2 as * const _ as
                usize } , 196usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _unused2 ) ));
}
impl Clone for _IO_FILE {
    fn clone(&self) -> Self { *self }
}
impl Default for _IO_FILE {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type FILE = _IO_FILE;
pub type va_list = __builtin_va_list;
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(::std::mem::size_of::<_IO_marker>() , 24usize , concat ! (
               "Size of: " , stringify ! ( _IO_marker ) ));
    assert_eq! (::std::mem::align_of::<_IO_marker>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_marker ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _sbuf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _sbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _pos as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _pos ) ));
}
impl Clone for _IO_marker {
    fn clone(&self) -> Self { *self }
}
impl Default for _IO_marker {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/** The rte_log structure. */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_logs {
    /**< Bitfield with enabled logs. */
    pub type_: u32,
    /**< Log level. */
    pub level: u32,
    /**< Output file set by rte_openlog_stream, or NULL. */
    pub file: *mut FILE,
}
#[test]
fn bindgen_test_layout_rte_logs() {
    assert_eq!(::std::mem::size_of::<rte_logs>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rte_logs ) ));
    assert_eq! (::std::mem::align_of::<rte_logs>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_logs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_logs ) ) . type_ as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_logs ) , "::" ,
                stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_logs ) ) . level as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_logs ) , "::" ,
                stringify ! ( level ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_logs ) ) . file as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_logs ) , "::" ,
                stringify ! ( file ) ));
}
impl Clone for rte_logs {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_logs {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Change the stream that will be used by the logging system.
 *
 * This can be done at any time. The f argument represents the stream
 * to be used to send the logs. If f is NULL, the default output is
 * used (stderr).
 *
 * @param f
 *   Pointer to the stream.
 * @return
 *   - 0 on success.
 *   - Negative on error.
 */
    pub fn rte_openlog_stream(f: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Set the global log level.
 *
 * After this call, all logs that are lower or equal than level and
 * lower or equal than the RTE_LOG_LEVEL configuration option will be
 * displayed.
 *
 * @param level
 *   Log level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).
 */
    pub fn rte_set_log_level(level: u32);
}
extern "C" {
    /**
 * Get the global log level.
 */
    pub fn rte_get_log_level() -> u32;
}
extern "C" {
    /**
 * Enable or disable the log type.
 *
 * @param type
 *   Log type, for example, RTE_LOGTYPE_EAL.
 * @param enable
 *   True for enable; false for disable.
 */
    pub fn rte_set_log_type(type_: u32, enable: ::std::os::raw::c_int);
}
extern "C" {
    /**
 * Get the global log type.
 */
    pub fn rte_get_log_type() -> u32;
}
extern "C" {
    /**
 * Get the current loglevel for the message being processed.
 *
 * Before calling the user-defined stream for logging, the log
 * subsystem sets a per-lcore variable containing the loglevel and the
 * logtype of the message being processed. This information can be
 * accessed by the user-defined log output function through this
 * function.
 *
 * @return
 *   The loglevel of the message being processed.
 */
    pub fn rte_log_cur_msg_loglevel() -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Get the current logtype for the message being processed.
 *
 * Before calling the user-defined stream for logging, the log
 * subsystem sets a per-lcore variable containing the loglevel and the
 * logtype of the message being processed. This information can be
 * accessed by the user-defined log output function through this
 * function.
 *
 * @return
 *   The logtype of the message being processed.
 */
    pub fn rte_log_cur_msg_logtype() -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Generates a log message.
 *
 * The message will be sent in the stream defined by the previous call
 * to rte_openlog_stream().
 *
 * The level argument determines if the log should be displayed or
 * not, depending on the global rte_logs variable.
 *
 * The preferred alternative is the RTE_LOG() function because debug logs may
 * be removed at compilation time if optimization is enabled. Moreover,
 * logs are automatically prefixed by type when using the macro.
 *
 * @param level
 *   Log level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).
 * @param logtype
 *   The log type, for example, RTE_LOGTYPE_EAL.
 * @param format
 *   The format string, as in printf(3), followed by the variable arguments
 *   required by the format.
 * @return
 *   - 0: Success.
 *   - Negative on error.
 */
    pub fn rte_log(level: u32, logtype: u32,
                   format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Generates a log message.
 *
 * The message will be sent in the stream defined by the previous call
 * to rte_openlog_stream().
 *
 * The level argument determines if the log should be displayed or
 * not, depending on the global rte_logs variable. A trailing
 * newline may be added if needed.
 *
 * The preferred alternative is the RTE_LOG() because debug logs may be
 * removed at compilation time.
 *
 * @param level
 *   Log level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).
 * @param logtype
 *   The log type, for example, RTE_LOGTYPE_EAL.
 * @param format
 *   The format string, as in printf(3), followed by the variable arguments
 *   required by the format.
 * @param ap
 *   The va_list of the variable arguments required by the format.
 * @return
 *   - 0: Success.
 *   - Negative on error.
 */
    pub fn rte_vlog(level: u32, logtype: u32,
                    format: *const ::std::os::raw::c_char,
                    ap: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Dump the stack of the calling core to the console.
 */
    pub fn rte_dump_stack();
}
extern "C" {
    /**
 * Dump the registers of the calling core to the console.
 *
 * Note: Not implemented in a userapp environment; use gdb instead.
 */
    pub fn rte_dump_registers();
}
extern "C" {
    /**
 * Get the measured frequency of the RDTSC counter
 *
 * @return
 *   The TSC frequency for this lcore
 */
    pub fn rte_get_tsc_hz() -> u64;
}
extern "C" {
    /**
 * Blocking delay function.
 *
 * @param us
 *   Number of microseconds to wait.
 */
    pub fn rte_delay_us_block(us: ::std::os::raw::c_uint);
}
extern "C" {
    /**
 * Replace rte_delay_us with user defined function.
 *
 * @param userfunc
 *   User function which replaces rte_delay_us. rte_delay_us_block restores
 *   buildin block delay function.
 */
    pub fn rte_delay_us_callback_register(userfunc:
                                              ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                                             ::std::os::raw::c_uint)>);
}
/**
 * A generic memory resource representation.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mem_resource {
    /**< Physical address, 0 if not resource. */
    pub phys_addr: u64,
    /**< Length of the resource. */
    pub len: u64,
    /**< Virtual address, NULL when not mapped. */
    pub addr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rte_mem_resource() {
    assert_eq!(::std::mem::size_of::<rte_mem_resource>() , 24usize , concat !
               ( "Size of: " , stringify ! ( rte_mem_resource ) ));
    assert_eq! (::std::mem::align_of::<rte_mem_resource>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( rte_mem_resource ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_resource ) ) . phys_addr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_resource ) ,
                "::" , stringify ! ( phys_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_resource ) ) . len as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_resource ) ,
                "::" , stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_resource ) ) . addr as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_resource ) ,
                "::" , stringify ! ( addr ) ));
}
impl Clone for rte_mem_resource {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mem_resource {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/** Double linked list of device drivers. */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_driver_list {
    pub tqh_first: *mut rte_driver,
    pub tqh_last: *mut *mut rte_driver,
}
#[test]
fn bindgen_test_layout_rte_driver_list() {
    assert_eq!(::std::mem::size_of::<rte_driver_list>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rte_driver_list ) ));
    assert_eq! (::std::mem::align_of::<rte_driver_list>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( rte_driver_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_driver_list ) ) . tqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_driver_list ) ,
                "::" , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_driver_list ) ) . tqh_last as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_driver_list ) ,
                "::" , stringify ! ( tqh_last ) ));
}
impl Clone for rte_driver_list {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_driver_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/** Double linked list of devices. */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_device_list {
    pub tqh_first: *mut rte_device,
    pub tqh_last: *mut *mut rte_device,
}
#[test]
fn bindgen_test_layout_rte_device_list() {
    assert_eq!(::std::mem::size_of::<rte_device_list>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rte_device_list ) ));
    assert_eq! (::std::mem::align_of::<rte_device_list>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( rte_device_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_device_list ) ) . tqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_device_list ) ,
                "::" , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_device_list ) ) . tqh_last as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_device_list ) ,
                "::" , stringify ! ( tqh_last ) ));
}
impl Clone for rte_device_list {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_device_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * A structure describing a device driver.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_driver {
    /**< Next in list. */
    pub next: rte_driver__bindgen_ty_1,
    /**< Driver name. */
    pub name: *const ::std::os::raw::c_char,
    /**< Driver alias. */
    pub alias: *const ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_driver__bindgen_ty_1 {
    pub tqe_next: *mut rte_driver,
    pub tqe_prev: *mut *mut rte_driver,
}
#[test]
fn bindgen_test_layout_rte_driver__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_driver__bindgen_ty_1>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_driver__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_driver__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_driver__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_driver__bindgen_ty_1 ) ) . tqe_next
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_driver__bindgen_ty_1 ) , "::" , stringify ! ( tqe_next )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_driver__bindgen_ty_1 ) ) . tqe_prev
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_driver__bindgen_ty_1 ) , "::" , stringify ! ( tqe_prev )
                ));
}
impl Clone for rte_driver__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_driver__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rte_driver() {
    assert_eq!(::std::mem::size_of::<rte_driver>() , 32usize , concat ! (
               "Size of: " , stringify ! ( rte_driver ) ));
    assert_eq! (::std::mem::align_of::<rte_driver>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_driver ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_driver ) ) . next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_driver ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_driver ) ) . name as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_driver ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_driver ) ) . alias as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_driver ) , "::" ,
                stringify ! ( alias ) ));
}
impl Clone for rte_driver {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_driver {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * A structure describing a generic device.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_device {
    /**< Next device */
    pub next: rte_device__bindgen_ty_1,
    /**< Associated driver */
    pub driver: *mut rte_driver,
    /**< NUMA node connection */
    pub numa_node: ::std::os::raw::c_int,
    /**< Device user arguments */
    pub devargs: *mut rte_devargs,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_device__bindgen_ty_1 {
    pub tqe_next: *mut rte_device,
    pub tqe_prev: *mut *mut rte_device,
}
#[test]
fn bindgen_test_layout_rte_device__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_device__bindgen_ty_1>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_device__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_device__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_device__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_device__bindgen_ty_1 ) ) . tqe_next
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_device__bindgen_ty_1 ) , "::" , stringify ! ( tqe_next )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_device__bindgen_ty_1 ) ) . tqe_prev
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_device__bindgen_ty_1 ) , "::" , stringify ! ( tqe_prev )
                ));
}
impl Clone for rte_device__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_device__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rte_device() {
    assert_eq!(::std::mem::size_of::<rte_device>() , 40usize , concat ! (
               "Size of: " , stringify ! ( rte_device ) ));
    assert_eq! (::std::mem::align_of::<rte_device>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_device ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_device ) ) . next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_device ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_device ) ) . driver as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_device ) , "::" ,
                stringify ! ( driver ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_device ) ) . numa_node as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_device ) , "::" ,
                stringify ! ( numa_node ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_device ) ) . devargs as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_device ) , "::" ,
                stringify ! ( devargs ) ));
}
impl Clone for rte_device {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_device {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Insert a device detected by a bus scanning.
 *
 * @param dev
 *   A pointer to a rte_device structure describing the detected device.
 */
    pub fn rte_eal_device_insert(dev: *mut rte_device);
}
extern "C" {
    /**
 * Remove a device (e.g. when being unplugged).
 *
 * @param dev
 *   A pointer to a rte_device structure describing the device to be removed.
 */
    pub fn rte_eal_device_remove(dev: *mut rte_device);
}
extern "C" {
    /**
 * Register a device driver.
 *
 * @param driver
 *   A pointer to a rte_dev structure describing the driver
 *   to be registered.
 */
    pub fn rte_eal_driver_register(driver: *mut rte_driver);
}
extern "C" {
    /**
 * Unregister a device driver.
 *
 * @param driver
 *   A pointer to a rte_dev structure describing the driver
 *   to be unregistered.
 */
    pub fn rte_eal_driver_unregister(driver: *mut rte_driver);
}
extern "C" {
    /**
 * Initalize all the registered drivers in this process
 */
    pub fn rte_eal_dev_init() -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Initialize a driver specified by name.
 *
 * @param name
 *   The pointer to a driver name to be initialized.
 * @param args
 *   The pointer to arguments used by driver initialization.
 * @return
 *  0 on success, negative on error
 */
    pub fn rte_eal_vdev_init(name: *const ::std::os::raw::c_char,
                             args: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Uninitalize a driver specified by name.
 *
 * @param name
 *   The pointer to a driver name to be initialized.
 * @return
 *  0 on success, negative on error
 */
    pub fn rte_eal_vdev_uninit(name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Attach a device to a registered driver.
 *
 * @param name
 *   The device name, that refers to a pci device (or some private
 *   way of designating a vdev device). Based on this device name, eal
 *   will identify a driver capable of handling it and pass it to the
 *   driver probing function.
 * @param devargs
 *   Device arguments to be passed to the driver.
 * @return
 *   0 on success, negative on error.
 */
    pub fn rte_eal_dev_attach(name: *const ::std::os::raw::c_char,
                              devargs: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Detach a device from its driver.
 *
 * @param name
 *   Same description as for rte_eal_dev_attach().
 *   Here, eal will call the driver detaching function.
 * @return
 *   0 on success, negative on error.
 */
    pub fn rte_eal_dev_detach(name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
/** Interrupt handle */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_intr_handle {
    pub __bindgen_anon_1: rte_intr_handle__bindgen_ty_1,
    /**< interrupt event file descriptor */
    pub fd: ::std::os::raw::c_int,
    /**< handle type */
    pub type_: rte_intr_handle_type,
    /**< max interrupt requested */
    pub max_intr: u32,
    /**< number of available efd(event fd) */
    pub nb_efd: u32,
    /**< intr vectors/efds mapping */
    pub efds: [::std::os::raw::c_int; 32usize],
    pub elist: [rte_epoll_event; 32usize],
    /**< intr vector number array */
    pub intr_vec: *mut ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_intr_handle__bindgen_ty_1 {
    /**< VFIO device file descriptor */
    pub vfio_dev_fd: __BindgenUnionField<::std::os::raw::c_int>,
    /**< UIO config file descriptor
					for uio_pci_generic */
    pub uio_cfg_fd: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_rte_intr_handle__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_intr_handle__bindgen_ty_1>() , 4usize
               , concat ! (
               "Size of: " , stringify ! ( rte_intr_handle__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_intr_handle__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( rte_intr_handle__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle__bindgen_ty_1 ) ) .
                vfio_dev_fd as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_intr_handle__bindgen_ty_1 ) , "::" , stringify ! (
                vfio_dev_fd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle__bindgen_ty_1 ) ) .
                uio_cfg_fd as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_intr_handle__bindgen_ty_1 ) , "::" , stringify ! (
                uio_cfg_fd ) ));
}
impl Clone for rte_intr_handle__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_intr_handle() {
    assert_eq!(::std::mem::size_of::<rte_intr_handle>() , 1696usize , concat !
               ( "Size of: " , stringify ! ( rte_intr_handle ) ));
    assert_eq! (::std::mem::align_of::<rte_intr_handle>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( rte_intr_handle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle ) ) . fd as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_intr_handle ) ,
                "::" , stringify ! ( fd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle ) ) . type_ as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_intr_handle ) ,
                "::" , stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle ) ) . max_intr as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_intr_handle ) ,
                "::" , stringify ! ( max_intr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle ) ) . nb_efd as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_intr_handle ) ,
                "::" , stringify ! ( nb_efd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle ) ) . efds as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_intr_handle ) ,
                "::" , stringify ! ( efds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle ) ) . elist as * const _
                as usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_intr_handle ) ,
                "::" , stringify ! ( elist ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_intr_handle ) ) . intr_vec as * const
                _ as usize } , 1688usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_intr_handle ) ,
                "::" , stringify ! ( intr_vec ) ));
}
impl Clone for rte_intr_handle {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_intr_handle {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/** Function to be registered for the specific interrupt */
pub type rte_intr_callback_fn =
    ::std::option::Option<unsafe extern "C" fn(intr_handle:
                                                   *mut rte_intr_handle,
                                               cb_arg:
                                                   *mut ::std::os::raw::c_void)>;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_intr_handle_type {
    RTE_INTR_HANDLE_UNKNOWN = 0,
    RTE_INTR_HANDLE_UIO = 1,
    RTE_INTR_HANDLE_UIO_INTX = 2,
    RTE_INTR_HANDLE_VFIO_LEGACY = 3,
    RTE_INTR_HANDLE_VFIO_MSI = 4,
    RTE_INTR_HANDLE_VFIO_MSIX = 5,
    RTE_INTR_HANDLE_ALARM = 6,
    RTE_INTR_HANDLE_EXT = 7,
    RTE_INTR_HANDLE_MAX = 8,
}
pub type rte_intr_event_cb_t =
    ::std::option::Option<unsafe extern "C" fn(fd: ::std::os::raw::c_int,
                                               arg:
                                                   *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_epoll_data {
    /**< event type */
    pub event: u32,
    /**< User data */
    pub data: *mut ::std::os::raw::c_void,
    /**< IN: callback fun */
    pub cb_fun: rte_intr_event_cb_t,
    /**< IN: callback arg */
    pub cb_arg: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rte_epoll_data() {
    assert_eq!(::std::mem::size_of::<rte_epoll_data>() , 32usize , concat ! (
               "Size of: " , stringify ! ( rte_epoll_data ) ));
    assert_eq! (::std::mem::align_of::<rte_epoll_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_epoll_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_epoll_data ) ) . event as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_epoll_data ) , "::"
                , stringify ! ( event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_epoll_data ) ) . data as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_epoll_data ) , "::"
                , stringify ! ( data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_epoll_data ) ) . cb_fun as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_epoll_data ) , "::"
                , stringify ! ( cb_fun ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_epoll_data ) ) . cb_arg as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_epoll_data ) , "::"
                , stringify ! ( cb_arg ) ));
}
impl Clone for rte_epoll_data {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_epoll_data {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub const RTE_EPOLL_INVALID: _bindgen_ty_2 = _bindgen_ty_2::RTE_EPOLL_INVALID;
pub const RTE_EPOLL_VALID: _bindgen_ty_2 = _bindgen_ty_2::RTE_EPOLL_VALID;
pub const RTE_EPOLL_EXEC: _bindgen_ty_2 = _bindgen_ty_2::RTE_EPOLL_EXEC;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    RTE_EPOLL_INVALID = 0,
    RTE_EPOLL_VALID = 1,
    RTE_EPOLL_EXEC = 2,
}
/** interrupt epoll event obj, taken by epoll_event.ptr */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_epoll_event {
    /**< OUT: event status */
    pub status: u32,
    /**< OUT: event fd */
    pub fd: ::std::os::raw::c_int,
    /**< OUT: epoll instance the ev associated with */
    pub epfd: ::std::os::raw::c_int,
    pub epdata: rte_epoll_data,
}
#[test]
fn bindgen_test_layout_rte_epoll_event() {
    assert_eq!(::std::mem::size_of::<rte_epoll_event>() , 48usize , concat ! (
               "Size of: " , stringify ! ( rte_epoll_event ) ));
    assert_eq! (::std::mem::align_of::<rte_epoll_event>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( rte_epoll_event ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_epoll_event ) ) . status as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_epoll_event ) ,
                "::" , stringify ! ( status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_epoll_event ) ) . fd as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_epoll_event ) ,
                "::" , stringify ! ( fd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_epoll_event ) ) . epfd as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_epoll_event ) ,
                "::" , stringify ! ( epfd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_epoll_event ) ) . epdata as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_epoll_event ) ,
                "::" , stringify ! ( epdata ) ));
}
impl Clone for rte_epoll_event {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_epoll_event {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * It waits for events on the epoll instance.
 *
 * @param epfd
 *   Epoll instance fd on which the caller wait for events.
 * @param events
 *   Memory area contains the events that will be available for the caller.
 * @param maxevents
 *   Up to maxevents are returned, must greater than zero.
 * @param timeout
 *   Specifying a timeout of -1 causes a block indefinitely.
 *   Specifying a timeout equal to zero cause to return immediately.
 * @return
 *   - On success, returns the number of available event.
 *   - On failure, a negative value.
 */
    pub fn rte_epoll_wait(epfd: ::std::os::raw::c_int,
                          events: *mut rte_epoll_event,
                          maxevents: ::std::os::raw::c_int,
                          timeout: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * It performs control operations on epoll instance referred by the epfd.
 * It requests that the operation op be performed for the target fd.
 *
 * @param epfd
 *   Epoll instance fd on which the caller perform control operations.
 * @param op
 *   The operation be performed for the target fd.
 * @param fd
 *   The target fd on which the control ops perform.
 * @param event
 *   Describes the object linked to the fd.
 *   Note: The caller must take care the object deletion after CTL_DEL.
 * @return
 *   - On success, zero.
 *   - On failure, a negative value.
 */
    pub fn rte_epoll_ctl(epfd: ::std::os::raw::c_int,
                         op: ::std::os::raw::c_int, fd: ::std::os::raw::c_int,
                         event: *mut rte_epoll_event)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * The function returns the per thread epoll instance.
 *
 * @return
 *   epfd the epoll instance referred to.
 */
    pub fn rte_intr_tls_epfd() -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * @param intr_handle
 *   Pointer to the interrupt handle.
 * @param epfd
 *   Epoll instance fd which the intr vector associated to.
 * @param op
 *   The operation be performed for the vector.
 *   Operation type of {ADD, DEL}.
 * @param vec
 *   RX intr vector number added to the epoll instance wait list.
 * @param data
 *   User raw data.
 * @return
 *   - On success, zero.
 *   - On failure, a negative value.
 */
    pub fn rte_intr_rx_ctl(intr_handle: *mut rte_intr_handle,
                           epfd: ::std::os::raw::c_int,
                           op: ::std::os::raw::c_int,
                           vec: ::std::os::raw::c_uint,
                           data: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * It enables the packet I/O interrupt event if it's necessary.
 * It creates event fd for each interrupt vector when MSIX is used,
 * otherwise it multiplexes a single event fd.
 *
 * @param intr_handle
 *   Pointer to the interrupt handle.
 * @param nb_efd
 *   Number of interrupt vector trying to enable.
 *   The value 0 is not allowed.
 * @return
 *   - On success, zero.
 *   - On failure, a negative value.
 */
    pub fn rte_intr_efd_enable(intr_handle: *mut rte_intr_handle, nb_efd: u32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * It disables the packet I/O interrupt event.
 * It deletes registered eventfds and closes the open fds.
 *
 * @param intr_handle
 *   Pointer to the interrupt handle.
 */
    pub fn rte_intr_efd_disable(intr_handle: *mut rte_intr_handle);
}
extern "C" {
    /**
 * The packet I/O interrupt on datapath is enabled or not.
 *
 * @param intr_handle
 *   Pointer to the interrupt handle.
 */
    pub fn rte_intr_dp_is_en(intr_handle: *mut rte_intr_handle)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * The interrupt handle instance allows other causes or not.
 * Other causes stand for any none packet I/O interrupts.
 *
 * @param intr_handle
 *   Pointer to the interrupt handle.
 */
    pub fn rte_intr_allow_others(intr_handle: *mut rte_intr_handle)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * The multiple interrupt vector capability of interrupt handle instance.
 * It returns zero if no multiple interrupt vector support.
 *
 * @param intr_handle
 *   Pointer to the interrupt handle.
 */
    pub fn rte_intr_cap_multiple(intr_handle: *mut rte_intr_handle)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * It registers the callback for the specific interrupt. Multiple
 * callbacks cal be registered at the same time.
 * @param intr_handle
 *  Pointer to the interrupt handle.
 * @param cb
 *  callback address.
 * @param cb_arg
 *  address of parameter for callback.
 *
 * @return
 *  - On success, zero.
 *  - On failure, a negative value.
 */
    pub fn rte_intr_callback_register(intr_handle: *mut rte_intr_handle,
                                      cb: rte_intr_callback_fn,
                                      cb_arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * It unregisters the callback according to the specified interrupt handle.
 *
 * @param intr_handle
 *  pointer to the interrupt handle.
 * @param cb
 *  callback address.
 * @param cb_arg
 *  address of parameter for callback, (void *)-1 means to remove all
 *  registered which has the same callback address.
 *
 * @return
 *  - On success, return the number of callback entities removed.
 *  - On failure, a negative value.
 */
    pub fn rte_intr_callback_unregister(intr_handle: *mut rte_intr_handle,
                                        cb: rte_intr_callback_fn,
                                        cb_arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * It enables the interrupt for the specified handle.
 *
 * @param intr_handle
 *  pointer to the interrupt handle.
 *
 * @return
 *  - On success, zero.
 *  - On failure, a negative value.
 */
    pub fn rte_intr_enable(intr_handle: *mut rte_intr_handle)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * It disables the interrupt for the specified handle.
 *
 * @param intr_handle
 *  pointer to the interrupt handle.
 *
 * @return
 *  - On success, zero.
 *  - On failure, a negative value.
 */
    pub fn rte_intr_disable(intr_handle: *mut rte_intr_handle)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pci_device_list {
    pub tqh_first: *mut rte_pci_device,
    pub tqh_last: *mut *mut rte_pci_device,
}
#[test]
fn bindgen_test_layout_pci_device_list() {
    assert_eq!(::std::mem::size_of::<pci_device_list>() , 16usize , concat ! (
               "Size of: " , stringify ! ( pci_device_list ) ));
    assert_eq! (::std::mem::align_of::<pci_device_list>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pci_device_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_device_list ) ) . tqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_device_list ) ,
                "::" , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_device_list ) ) . tqh_last as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_device_list ) ,
                "::" , stringify ! ( tqh_last ) ));
}
impl Clone for pci_device_list {
    fn clone(&self) -> Self { *self }
}
impl Default for pci_device_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pci_driver_list {
    pub tqh_first: *mut rte_pci_driver,
    pub tqh_last: *mut *mut rte_pci_driver,
}
#[test]
fn bindgen_test_layout_pci_driver_list() {
    assert_eq!(::std::mem::size_of::<pci_driver_list>() , 16usize , concat ! (
               "Size of: " , stringify ! ( pci_driver_list ) ));
    assert_eq! (::std::mem::align_of::<pci_driver_list>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pci_driver_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_driver_list ) ) . tqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_driver_list ) ,
                "::" , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_driver_list ) ) . tqh_last as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_driver_list ) ,
                "::" , stringify ! ( tqh_last ) ));
}
impl Clone for pci_driver_list {
    fn clone(&self) -> Self { *self }
}
impl Default for pci_driver_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * A structure describing an ID for a PCI driver. Each driver provides a
 * table of these IDs for each device that it supports.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_pci_id {
    /**< Class ID (class, subclass, pi) or RTE_CLASS_ANY_ID. */
    pub class_id: u32,
    /**< Vendor ID or PCI_ANY_ID. */
    pub vendor_id: u16,
    /**< Device ID or PCI_ANY_ID. */
    pub device_id: u16,
    /**< Subsystem vendor ID or PCI_ANY_ID. */
    pub subsystem_vendor_id: u16,
    /**< Subsystem device ID or PCI_ANY_ID. */
    pub subsystem_device_id: u16,
}
#[test]
fn bindgen_test_layout_rte_pci_id() {
    assert_eq!(::std::mem::size_of::<rte_pci_id>() , 12usize , concat ! (
               "Size of: " , stringify ! ( rte_pci_id ) ));
    assert_eq! (::std::mem::align_of::<rte_pci_id>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rte_pci_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_id ) ) . class_id as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_id ) , "::" ,
                stringify ! ( class_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_id ) ) . vendor_id as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_id ) , "::" ,
                stringify ! ( vendor_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_id ) ) . device_id as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_id ) , "::" ,
                stringify ! ( device_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_id ) ) . subsystem_vendor_id as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_id ) , "::" ,
                stringify ! ( subsystem_vendor_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_id ) ) . subsystem_device_id as *
                const _ as usize } , 10usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_id ) , "::" ,
                stringify ! ( subsystem_device_id ) ));
}
impl Clone for rte_pci_id {
    fn clone(&self) -> Self { *self }
}
/**
 * A structure describing the location of a PCI device.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_pci_addr {
    /**< Device domain */
    pub domain: u16,
    /**< Device bus */
    pub bus: u8,
    /**< Device ID */
    pub devid: u8,
    /**< Device function. */
    pub function: u8,
}
#[test]
fn bindgen_test_layout_rte_pci_addr() {
    assert_eq!(::std::mem::size_of::<rte_pci_addr>() , 6usize , concat ! (
               "Size of: " , stringify ! ( rte_pci_addr ) ));
    assert_eq! (::std::mem::align_of::<rte_pci_addr>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( rte_pci_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_addr ) ) . domain as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_addr ) , "::" ,
                stringify ! ( domain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_addr ) ) . bus as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_addr ) , "::" ,
                stringify ! ( bus ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_addr ) ) . devid as * const _ as
                usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_addr ) , "::" ,
                stringify ! ( devid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_addr ) ) . function as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_addr ) , "::" ,
                stringify ! ( function ) ));
}
impl Clone for rte_pci_addr {
    fn clone(&self) -> Self { *self }
}
/**
 * Structure that stores a device given by the user with its arguments
 *
 * A user device is a physical or a virtual device given by the user to
 * the DPDK application at startup through command line arguments.
 *
 * The structure stores the configuration of the device, its PCI
 * identifier if it's a PCI device or the driver name if it's a virtual
 * device.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_devargs {
    /** Next in list. */
    pub next: rte_devargs__bindgen_ty_1,
    /** Type of device. */
    pub type_: rte_devtype,
    pub __bindgen_anon_1: rte_devargs__bindgen_ty_2,
    /** Arguments string as given by user or "" for no argument. */
    pub args: *mut ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_devargs__bindgen_ty_1 {
    pub tqe_next: *mut rte_devargs,
    pub tqe_prev: *mut *mut rte_devargs,
}
#[test]
fn bindgen_test_layout_rte_devargs__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_devargs__bindgen_ty_1>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_devargs__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_devargs__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_devargs__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs__bindgen_ty_1 ) ) . tqe_next
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_devargs__bindgen_ty_1 ) , "::" , stringify ! ( tqe_next )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs__bindgen_ty_1 ) ) . tqe_prev
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_devargs__bindgen_ty_1 ) , "::" , stringify ! ( tqe_prev )
                ));
}
impl Clone for rte_devargs__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_devargs__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_devargs__bindgen_ty_2 {
    pub pci: __BindgenUnionField<rte_devargs__bindgen_ty_2__bindgen_ty_1>,
    pub virt: __BindgenUnionField<rte_devargs__bindgen_ty_2__bindgen_ty_2>,
    pub bindgen_union_field: [u16; 16usize],
}
/** Used if type is RTE_DEVTYPE_*_PCI. */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_devargs__bindgen_ty_2__bindgen_ty_1 {
    /** PCI location. */
    pub addr: rte_pci_addr,
}
#[test]
fn bindgen_test_layout_rte_devargs__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_devargs__bindgen_ty_2__bindgen_ty_1>()
               , 6usize , concat ! (
               "Size of: " , stringify ! (
               rte_devargs__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_devargs__bindgen_ty_2__bindgen_ty_1>()
                , 2usize , concat ! (
                "Alignment of " , stringify ! (
                rte_devargs__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs__bindgen_ty_2__bindgen_ty_1 )
                ) . addr as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_devargs__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify !
                ( addr ) ));
}
impl Clone for rte_devargs__bindgen_ty_2__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
/** Used if type is RTE_DEVTYPE_VIRTUAL. */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_devargs__bindgen_ty_2__bindgen_ty_2 {
    /** Driver name. */
    pub drv_name: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_rte_devargs__bindgen_ty_2__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<rte_devargs__bindgen_ty_2__bindgen_ty_2>()
               , 32usize , concat ! (
               "Size of: " , stringify ! (
               rte_devargs__bindgen_ty_2__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<rte_devargs__bindgen_ty_2__bindgen_ty_2>()
                , 1usize , concat ! (
                "Alignment of " , stringify ! (
                rte_devargs__bindgen_ty_2__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs__bindgen_ty_2__bindgen_ty_2 )
                ) . drv_name as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_devargs__bindgen_ty_2__bindgen_ty_2 ) , "::" , stringify !
                ( drv_name ) ));
}
impl Clone for rte_devargs__bindgen_ty_2__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_devargs__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<rte_devargs__bindgen_ty_2>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_devargs__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<rte_devargs__bindgen_ty_2>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_devargs__bindgen_ty_2 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs__bindgen_ty_2 ) ) . pci as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_devargs__bindgen_ty_2 ) , "::" , stringify ! ( pci ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs__bindgen_ty_2 ) ) . virt as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_devargs__bindgen_ty_2 ) , "::" , stringify ! ( virt ) ));
}
impl Clone for rte_devargs__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_devargs() {
    assert_eq!(::std::mem::size_of::<rte_devargs>() , 64usize , concat ! (
               "Size of: " , stringify ! ( rte_devargs ) ));
    assert_eq! (::std::mem::align_of::<rte_devargs>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_devargs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs ) ) . next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_devargs ) , "::" ,
                stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs ) ) . type_ as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_devargs ) , "::" ,
                stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs ) ) . args as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_devargs ) , "::" ,
                stringify ! ( args ) ));
}
impl Clone for rte_devargs {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_devargs {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_kernel_driver {
    RTE_KDRV_UNKNOWN = 0,
    RTE_KDRV_IGB_UIO = 1,
    RTE_KDRV_VFIO = 2,
    RTE_KDRV_UIO_GENERIC = 3,
    RTE_KDRV_NIC_UIO = 4,
    RTE_KDRV_NONE = 5,
}
/**
 * A structure describing a PCI device.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_pci_device {
    /**< Next probed PCI device. */
    pub next: rte_pci_device__bindgen_ty_1,
    /**< Inherit core device */
    pub device: rte_device,
    /**< PCI location. */
    pub addr: rte_pci_addr,
    /**< PCI ID. */
    pub id: rte_pci_id,
    pub mem_resource: [rte_mem_resource; 6usize],
    /**< Interrupt handle */
    pub intr_handle: rte_intr_handle,
    /**< Associated driver */
    pub driver: *mut rte_pci_driver,
    /**< sriov enable if not zero */
    pub max_vfs: u16,
    /**< Kernel driver passthrough */
    pub kdrv: rte_kernel_driver,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_pci_device__bindgen_ty_1 {
    pub tqe_next: *mut rte_pci_device,
    pub tqe_prev: *mut *mut rte_pci_device,
}
#[test]
fn bindgen_test_layout_rte_pci_device__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_pci_device__bindgen_ty_1>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( rte_pci_device__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_pci_device__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( rte_pci_device__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device__bindgen_ty_1 ) ) .
                tqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_pci_device__bindgen_ty_1 ) , "::" , stringify ! ( tqe_next
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device__bindgen_ty_1 ) ) .
                tqe_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_pci_device__bindgen_ty_1 ) , "::" , stringify ! ( tqe_prev
                ) ));
}
impl Clone for rte_pci_device__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_pci_device__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rte_pci_device() {
    assert_eq!(::std::mem::size_of::<rte_pci_device>() , 1936usize , concat !
               ( "Size of: " , stringify ! ( rte_pci_device ) ));
    assert_eq! (::std::mem::align_of::<rte_pci_device>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_pci_device ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . device as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( device ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . addr as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . id as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . mem_resource as *
                const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( mem_resource ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . intr_handle as *
                const _ as usize } , 224usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( intr_handle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . driver as * const _
                as usize } , 1920usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( driver ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . max_vfs as * const _
                as usize } , 1928usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( max_vfs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_device ) ) . kdrv as * const _ as
                usize } , 1932usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_device ) , "::"
                , stringify ! ( kdrv ) ));
}
impl Clone for rte_pci_device {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_pci_device {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * A structure describing a PCI driver.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_pci_driver {
    /**< Next in list. */
    pub next: rte_pci_driver__bindgen_ty_1,
    /**< Inherit core driver. */
    pub driver: rte_driver,
    /**< Device Probe function. */
    pub probe: pci_probe_t,
    /**< Device Remove function. */
    pub remove: pci_remove_t,
    /**< ID table, NULL terminated. */
    pub id_table: *const rte_pci_id,
    /**< Flags contolling handling of device. */
    pub drv_flags: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_pci_driver__bindgen_ty_1 {
    pub tqe_next: *mut rte_pci_driver,
    pub tqe_prev: *mut *mut rte_pci_driver,
}
#[test]
fn bindgen_test_layout_rte_pci_driver__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_pci_driver__bindgen_ty_1>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( rte_pci_driver__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_pci_driver__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( rte_pci_driver__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_driver__bindgen_ty_1 ) ) .
                tqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_pci_driver__bindgen_ty_1 ) , "::" , stringify ! ( tqe_next
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_driver__bindgen_ty_1 ) ) .
                tqe_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_pci_driver__bindgen_ty_1 ) , "::" , stringify ! ( tqe_prev
                ) ));
}
impl Clone for rte_pci_driver__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_pci_driver__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rte_pci_driver() {
    assert_eq!(::std::mem::size_of::<rte_pci_driver>() , 80usize , concat ! (
               "Size of: " , stringify ! ( rte_pci_driver ) ));
    assert_eq! (::std::mem::align_of::<rte_pci_driver>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_pci_driver ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_driver ) ) . next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_driver ) , "::"
                , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_driver ) ) . driver as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_driver ) , "::"
                , stringify ! ( driver ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_driver ) ) . probe as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_driver ) , "::"
                , stringify ! ( probe ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_driver ) ) . remove as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_driver ) , "::"
                , stringify ! ( remove ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_driver ) ) . id_table as * const
                _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_driver ) , "::"
                , stringify ! ( id_table ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_driver ) ) . drv_flags as * const
                _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_driver ) , "::"
                , stringify ! ( drv_flags ) ));
}
impl Clone for rte_pci_driver {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_pci_driver {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * Initialisation function for the driver called during PCI probing.
 */
pub type pci_probe_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut rte_pci_driver,
                                               arg2: *mut rte_pci_device)
                              -> ::std::os::raw::c_int>;
/**
 * Uninitialisation function for the driver called during hotplugging.
 */
pub type pci_remove_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut rte_pci_device)
                              -> ::std::os::raw::c_int>;
/**
 * A structure describing a PCI mapping.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pci_map {
    pub addr: *mut ::std::os::raw::c_void,
    pub path: *mut ::std::os::raw::c_char,
    pub offset: u64,
    pub size: u64,
    pub phaddr: u64,
}
#[test]
fn bindgen_test_layout_pci_map() {
    assert_eq!(::std::mem::size_of::<pci_map>() , 40usize , concat ! (
               "Size of: " , stringify ! ( pci_map ) ));
    assert_eq! (::std::mem::align_of::<pci_map>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pci_map ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_map ) ) . addr as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_map ) , "::" ,
                stringify ! ( addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_map ) ) . path as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_map ) , "::" ,
                stringify ! ( path ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_map ) ) . offset as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_map ) , "::" ,
                stringify ! ( offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_map ) ) . size as * const _ as usize
                } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_map ) , "::" ,
                stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pci_map ) ) . phaddr as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( pci_map ) , "::" ,
                stringify ! ( phaddr ) ));
}
impl Clone for pci_map {
    fn clone(&self) -> Self { *self }
}
impl Default for pci_map {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Scan the content of the PCI bus, and the devices in the devices
 * list
 *
 * @return
 *  0 on success, negative on error
 */
    pub fn rte_eal_pci_scan() -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Probe the PCI bus for registered drivers.
 *
 * Scan the content of the PCI bus, and call the probe() function for
 * all registered drivers that have a matching entry in its id_table
 * for discovered devices.
 *
 * @return
 *   - 0 on success.
 *   - Negative on error.
 */
    pub fn rte_eal_pci_probe() -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Map the PCI device resources in user space virtual memory address
 *
 * Note that driver should not call this function when flag
 * RTE_PCI_DRV_NEED_MAPPING is set, as EAL will do that for
 * you when it's on.
 *
 * @param dev
 *   A pointer to a rte_pci_device structure describing the device
 *   to use
 *
 * @return
 *   0 on success, negative on error and positive if no driver
 *   is found for the device.
 */
    pub fn rte_eal_pci_map_device(dev: *mut rte_pci_device)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Unmap this device
 *
 * @param dev
 *   A pointer to a rte_pci_device structure describing the device
 *   to use
 */
    pub fn rte_eal_pci_unmap_device(dev: *mut rte_pci_device);
}
extern "C" {
    /**
 * Probe the single PCI device.
 *
 * Scan the content of the PCI bus, and find the pci device specified by pci
 * address, then call the probe() function for registered driver that has a
 * matching entry in its id_table for discovered device.
 *
 * @param addr
 *	The PCI Bus-Device-Function address to probe.
 * @return
 *   - 0 on success.
 *   - Negative on error.
 */
    pub fn rte_eal_pci_probe_one(addr: *const rte_pci_addr)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Close the single PCI device.
 *
 * Scan the content of the PCI bus, and find the pci device specified by pci
 * address, then call the remove() function for registered driver that has a
 * matching entry in its id_table for discovered device.
 *
 * @param addr
 *	The PCI Bus-Device-Function address to close.
 * @return
 *   - 0 on success.
 *   - Negative on error.
 */
    pub fn rte_eal_pci_detach(addr: *const rte_pci_addr)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Dump the content of the PCI bus.
 *
 * @param f
 *   A pointer to a file for output
 */
    pub fn rte_eal_pci_dump(f: *mut FILE);
}
extern "C" {
    /**
 * Register a PCI driver.
 *
 * @param driver
 *   A pointer to a rte_pci_driver structure describing the driver
 *   to be registered.
 */
    pub fn rte_eal_pci_register(driver: *mut rte_pci_driver);
}
extern "C" {
    /**
 * Unregister a PCI driver.
 *
 * @param driver
 *   A pointer to a rte_pci_driver structure describing the driver
 *   to be unregistered.
 */
    pub fn rte_eal_pci_unregister(driver: *mut rte_pci_driver);
}
extern "C" {
    /**
 * Read PCI config space.
 *
 * @param device
 *   A pointer to a rte_pci_device structure describing the device
 *   to use
 * @param buf
 *   A data buffer where the bytes should be read into
 * @param len
 *   The length of the data buffer.
 * @param offset
 *   The offset into PCI config space
 */
    pub fn rte_eal_pci_read_config(device: *const rte_pci_device,
                                   buf: *mut ::std::os::raw::c_void,
                                   len: usize, offset: off_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Write PCI config space.
 *
 * @param device
 *   A pointer to a rte_pci_device structure describing the device
 *   to use
 * @param buf
 *   A data buffer containing the bytes should be written
 * @param len
 *   The length of the data buffer.
 * @param offset
 *   The offset into PCI config space
 */
    pub fn rte_eal_pci_write_config(device: *const rte_pci_device,
                                    buf: *const ::std::os::raw::c_void,
                                    len: usize, offset: off_t)
     -> ::std::os::raw::c_int;
}
/**
 * A structure used to access io resources for a pci device.
 * rte_pci_ioport is arch, os, driver specific, and should not be used outside
 * of pci ioport api.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_pci_ioport {
    pub dev: *mut rte_pci_device,
    pub base: u64,
    pub len: u64,
}
#[test]
fn bindgen_test_layout_rte_pci_ioport() {
    assert_eq!(::std::mem::size_of::<rte_pci_ioport>() , 24usize , concat ! (
               "Size of: " , stringify ! ( rte_pci_ioport ) ));
    assert_eq! (::std::mem::align_of::<rte_pci_ioport>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_pci_ioport ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_ioport ) ) . dev as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_ioport ) , "::"
                , stringify ! ( dev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_ioport ) ) . base as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_ioport ) , "::"
                , stringify ! ( base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_pci_ioport ) ) . len as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_pci_ioport ) , "::"
                , stringify ! ( len ) ));
}
impl Clone for rte_pci_ioport {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_pci_ioport {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Initialize a rte_pci_ioport object for a pci device io resource.
 *
 * This object is then used to gain access to those io resources (see below).
 *
 * @param dev
 *   A pointer to a rte_pci_device structure describing the device
 *   to use.
 * @param bar
 *   Index of the io pci resource we want to access.
 * @param p
 *   The rte_pci_ioport object to be initialized.
 * @return
 *  0 on success, negative on error.
 */
    pub fn rte_eal_pci_ioport_map(dev: *mut rte_pci_device,
                                  bar: ::std::os::raw::c_int,
                                  p: *mut rte_pci_ioport)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Release any resources used in a rte_pci_ioport object.
 *
 * @param p
 *   The rte_pci_ioport object to be uninitialized.
 * @return
 *  0 on success, negative on error.
 */
    pub fn rte_eal_pci_ioport_unmap(p: *mut rte_pci_ioport)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Read from a io pci resource.
 *
 * @param p
 *   The rte_pci_ioport object from which we want to read.
 * @param data
 *   A data buffer where the bytes should be read into
 * @param len
 *   The length of the data buffer.
 * @param offset
 *   The offset into the pci io resource.
 */
    pub fn rte_eal_pci_ioport_read(p: *mut rte_pci_ioport,
                                   data: *mut ::std::os::raw::c_void,
                                   len: usize, offset: off_t);
}
extern "C" {
    /**
 * Write to a io pci resource.
 *
 * @param p
 *   The rte_pci_ioport object to which we want to write.
 * @param data
 *   A data buffer where the bytes should be read into
 * @param len
 *   The length of the data buffer.
 * @param offset
 *   The offset into the pci io resource.
 */
    pub fn rte_eal_pci_ioport_write(p: *mut rte_pci_ioport,
                                    data: *const ::std::os::raw::c_void,
                                    len: usize, offset: off_t);
}
#[repr(u32)]
/**
 * Type of generic device
 */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_devtype {
    RTE_DEVTYPE_WHITELISTED_PCI = 0,
    RTE_DEVTYPE_BLACKLISTED_PCI = 1,
    RTE_DEVTYPE_VIRTUAL = 2,
}
/** user device double-linked queue type definition */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_devargs_list {
    pub tqh_first: *mut rte_devargs,
    pub tqh_last: *mut *mut rte_devargs,
}
#[test]
fn bindgen_test_layout_rte_devargs_list() {
    assert_eq!(::std::mem::size_of::<rte_devargs_list>() , 16usize , concat !
               ( "Size of: " , stringify ! ( rte_devargs_list ) ));
    assert_eq! (::std::mem::align_of::<rte_devargs_list>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( rte_devargs_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs_list ) ) . tqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_devargs_list ) ,
                "::" , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_devargs_list ) ) . tqh_last as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_devargs_list ) ,
                "::" , stringify ! ( tqh_last ) ));
}
impl Clone for rte_devargs_list {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_devargs_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Parse a devargs string.
 *
 * For PCI devices, the format of arguments string is "PCI_ADDR" or
 * "PCI_ADDR,key=val,key2=val2,...". Examples: "08:00.1", "0000:5:00.0",
 * "04:00.0,arg=val".
 *
 * For virtual devices, the format of arguments string is "DRIVER_NAME*"
 * or "DRIVER_NAME*,key=val,key2=val2,...". Examples: "net_ring",
 * "net_ring0", "net_pmdAnything,arg=0:arg2=1".
 *
 * The function parses the arguments string to get driver name and driver
 * arguments.
 *
 * @param devargs_str
 *   The arguments as given by the user.
 * @param drvname
 *   The pointer to the string to store parsed driver name.
 * @param drvargs
 *   The pointer to the string to store parsed driver arguments.
 *
 * @return
 *   - 0 on success
 *   - A negative value on error
 */
    pub fn rte_eal_parse_devargs_str(devargs_str:
                                         *const ::std::os::raw::c_char,
                                     drvname:
                                         *mut *mut ::std::os::raw::c_char,
                                     drvargs:
                                         *mut *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Add a device to the user device list
 *
 * For PCI devices, the format of arguments string is "PCI_ADDR" or
 * "PCI_ADDR,key=val,key2=val2,...". Examples: "08:00.1", "0000:5:00.0",
 * "04:00.0,arg=val".
 *
 * For virtual devices, the format of arguments string is "DRIVER_NAME*"
 * or "DRIVER_NAME*,key=val,key2=val2,...". Examples: "net_ring",
 * "net_ring0", "net_pmdAnything,arg=0:arg2=1". The validity of the
 * driver name is not checked by this function, it is done when probing
 * the drivers.
 *
 * @param devtype
 *   The type of the device.
 * @param devargs_str
 *   The arguments as given by the user.
 *
 * @return
 *   - 0 on success
 *   - A negative value on error
 */
    pub fn rte_eal_devargs_add(devtype: rte_devtype,
                               devargs_str: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Count the number of user devices of a specified type
 *
 * @param devtype
 *   The type of the devices to counted.
 *
 * @return
 *   The number of devices.
 */
    pub fn rte_eal_devargs_type_count(devtype: rte_devtype)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    /**
 * This function dumps the list of user device and their arguments.
 *
 * @param f
 *   A pointer to a file for output
 */
    pub fn rte_eal_devargs_dump(f: *mut FILE);
}
/** dummy structure type used by the rte_tailq APIs */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_tailq_entry {
    /**< Pointer entries for a tailq list */
    pub next: rte_tailq_entry__bindgen_ty_1,
    /**< Pointer to the data referenced by this tailq entry */
    pub data: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_tailq_entry__bindgen_ty_1 {
    pub tqe_next: *mut rte_tailq_entry,
    pub tqe_prev: *mut *mut rte_tailq_entry,
}
#[test]
fn bindgen_test_layout_rte_tailq_entry__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_tailq_entry__bindgen_ty_1>() ,
               16usize , concat ! (
               "Size of: " , stringify ! ( rte_tailq_entry__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_tailq_entry__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( rte_tailq_entry__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_entry__bindgen_ty_1 ) ) .
                tqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_tailq_entry__bindgen_ty_1 ) , "::" , stringify ! (
                tqe_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_entry__bindgen_ty_1 ) ) .
                tqe_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_tailq_entry__bindgen_ty_1 ) , "::" , stringify ! (
                tqe_prev ) ));
}
impl Clone for rte_tailq_entry__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_tailq_entry__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rte_tailq_entry() {
    assert_eq!(::std::mem::size_of::<rte_tailq_entry>() , 24usize , concat ! (
               "Size of: " , stringify ! ( rte_tailq_entry ) ));
    assert_eq! (::std::mem::align_of::<rte_tailq_entry>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( rte_tailq_entry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_entry ) ) . next as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_entry ) ,
                "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_entry ) ) . data as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_entry ) ,
                "::" , stringify ! ( data ) ));
}
impl Clone for rte_tailq_entry {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_tailq_entry {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/** dummy */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_tailq_entry_head {
    pub tqh_first: *mut rte_tailq_entry,
    pub tqh_last: *mut *mut rte_tailq_entry,
}
#[test]
fn bindgen_test_layout_rte_tailq_entry_head() {
    assert_eq!(::std::mem::size_of::<rte_tailq_entry_head>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( rte_tailq_entry_head )
               ));
    assert_eq! (::std::mem::align_of::<rte_tailq_entry_head>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_tailq_entry_head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_entry_head ) ) . tqh_first as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_entry_head )
                , "::" , stringify ! ( tqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_entry_head ) ) . tqh_last as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_entry_head )
                , "::" , stringify ! ( tqh_last ) ));
}
impl Clone for rte_tailq_entry_head {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_tailq_entry_head {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * The structure defining a tailq header entry for storing
 * in the rte_config structure in shared memory. Each tailq
 * is identified by name.
 * Any library storing a set of objects e.g. rings, mempools, hash-tables,
 * is recommended to use an entry here, so as to make it easy for
 * a multi-process app to find already-created elements in shared memory.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_tailq_head {
    /**< NOTE: must be first element */
    pub tailq_head: rte_tailq_entry_head,
    pub name: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_rte_tailq_head() {
    assert_eq!(::std::mem::size_of::<rte_tailq_head>() , 48usize , concat ! (
               "Size of: " , stringify ! ( rte_tailq_head ) ));
    assert_eq! (::std::mem::align_of::<rte_tailq_head>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_tailq_head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_head ) ) . tailq_head as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_head ) , "::"
                , stringify ! ( tailq_head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_head ) ) . name as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_head ) , "::"
                , stringify ! ( name ) ));
}
impl Clone for rte_tailq_head {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_tailq_head {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_tailq_elem {
    /**
	 * Reference to head in shared mem, updated at init time by
	 * rte_eal_tailqs_init()
	 */
    pub head: *mut rte_tailq_head,
    pub next: rte_tailq_elem__bindgen_ty_1,
    pub name: [::std::os::raw::c_char; 32usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_tailq_elem__bindgen_ty_1 {
    pub tqe_next: *mut rte_tailq_elem,
    pub tqe_prev: *mut *mut rte_tailq_elem,
}
#[test]
fn bindgen_test_layout_rte_tailq_elem__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_tailq_elem__bindgen_ty_1>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( rte_tailq_elem__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_tailq_elem__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( rte_tailq_elem__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_elem__bindgen_ty_1 ) ) .
                tqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_tailq_elem__bindgen_ty_1 ) , "::" , stringify ! ( tqe_next
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_elem__bindgen_ty_1 ) ) .
                tqe_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_tailq_elem__bindgen_ty_1 ) , "::" , stringify ! ( tqe_prev
                ) ));
}
impl Clone for rte_tailq_elem__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_tailq_elem__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rte_tailq_elem() {
    assert_eq!(::std::mem::size_of::<rte_tailq_elem>() , 56usize , concat ! (
               "Size of: " , stringify ! ( rte_tailq_elem ) ));
    assert_eq! (::std::mem::align_of::<rte_tailq_elem>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_tailq_elem ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_elem ) ) . head as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_elem ) , "::"
                , stringify ! ( head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_elem ) ) . next as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_elem ) , "::"
                , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_tailq_elem ) ) . name as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_tailq_elem ) , "::"
                , stringify ! ( name ) ));
}
impl Clone for rte_tailq_elem {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_tailq_elem {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Dump tail queues to a file.
 *
 * @param f
 *   A pointer to a file for output
 */
    pub fn rte_dump_tailq(f: *mut FILE);
}
extern "C" {
    /**
 * Lookup for a tail queue.
 *
 * Get a pointer to a tail queue header of a tail
 * queue identified by the name given as an argument.
 * Note: this function is not multi-thread safe, and should only be called from
 * a single thread at a time
 *
 * @param name
 *   The name of the queue.
 * @return
 *   A pointer to the tail queue head structure.
 */
    pub fn rte_eal_tailq_lookup(name: *const ::std::os::raw::c_char)
     -> *mut rte_tailq_head;
}
extern "C" {
    /**
 * Register a tail queue.
 *
 * Register a tail queue from shared memory.
 * This function is mainly used by EAL_REGISTER_TAILQ macro which is used to
 * register tailq from the different dpdk libraries. Since this macro is a
 * constructor, the function has no access to dpdk shared memory, so the
 * registered tailq can not be used before call to rte_eal_init() which calls
 * rte_eal_tailqs_init().
 *
 * @param t
 *   The tailq element which contains the name of the tailq you want to
 *   create (/retrieve when in secondary process).
 * @return
 *   0 on success or -1 in case of an error.
 */
    pub fn rte_eal_tailq_register(t: *mut rte_tailq_elem)
     -> ::std::os::raw::c_int;
}
#[repr(u64)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_page_sizes {
    RTE_PGSIZE_4K = 4096,
    RTE_PGSIZE_64K = 65536,
    RTE_PGSIZE_256K = 262144,
    RTE_PGSIZE_2M = 2097152,
    RTE_PGSIZE_16M = 16777216,
    RTE_PGSIZE_256M = 268435456,
    RTE_PGSIZE_512M = 536870912,
    RTE_PGSIZE_1G = 1073741824,
    RTE_PGSIZE_4G = 4294967296,
    RTE_PGSIZE_16G = 17179869184,
}
pub type phys_addr_t = u64;
/**
 * Physical memory segment descriptor.
 */
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct rte_memseg {
    /**< Start physical address. */
    pub phys_addr: phys_addr_t,
    pub __bindgen_anon_1: rte_memseg__bindgen_ty_1,
    /**< Length of the segment. */
    pub len: usize,
    /**< The pagesize of underlying memory */
    pub hugepage_sz: u64,
    /**< NUMA socket ID. */
    pub socket_id: i32,
    /**< Number of channels. */
    pub nchannel: u32,
    /**< Number of ranks. */
    pub nrank: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_memseg__bindgen_ty_1 {
    /**< Start virtual address. */
    pub addr: __BindgenUnionField<*mut ::std::os::raw::c_void>,
    /**< Makes sure addr is always 64 bits */
    pub addr_64: __BindgenUnionField<u64>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_rte_memseg__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_memseg__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_memseg__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_memseg__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_memseg__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg__bindgen_ty_1 ) ) . addr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_memseg__bindgen_ty_1 ) , "::" , stringify ! ( addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg__bindgen_ty_1 ) ) . addr_64 as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_memseg__bindgen_ty_1 ) , "::" , stringify ! ( addr_64 )
                ));
}
impl Clone for rte_memseg__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_memseg() {
    assert_eq!(::std::mem::size_of::<rte_memseg>() , 44usize , concat ! (
               "Size of: " , stringify ! ( rte_memseg ) ));
    assert_eq! (::std::mem::align_of::<rte_memseg>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( rte_memseg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . phys_addr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( phys_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . len as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . hugepage_sz as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( hugepage_sz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . socket_id as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( socket_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . nchannel as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( nchannel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memseg ) ) . nrank as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memseg ) , "::" ,
                stringify ! ( nrank ) ));
}
impl Clone for rte_memseg {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /**
 * Lock page in physical memory and prevent from swapping.
 *
 * @param virt
 *   The virtual address.
 * @return
 *   0 on success, negative on error.
 */
    pub fn rte_mem_lock_page(virt: *const ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Get physical address of any mapped virtual address in the current process.
 * It is found by browsing the /proc/self/pagemap special file.
 * The page must be locked.
 *
 * @param virt
 *   The virtual address.
 * @return
 *   The physical address or RTE_BAD_PHYS_ADDR on error.
 */
    pub fn rte_mem_virt2phy(virt: *const ::std::os::raw::c_void)
     -> phys_addr_t;
}
extern "C" {
    /**
 * Get the layout of the available physical memory.
 *
 * It can be useful for an application to have the full physical
 * memory layout to decide the size of a memory zone to reserve. This
 * table is stored in rte_config (see rte_eal_get_configuration()).
 *
 * @return
 *  - On success, return a pointer to a read-only table of struct
 *    rte_physmem_desc elements, containing the layout of all
 *    addressable physical memory. The last element of the table
 *    contains a NULL address.
 *  - On error, return NULL. This should not happen since it is a fatal
 *    error that will probably cause the entire system to panic.
 */
    pub fn rte_eal_get_physmem_layout() -> *const rte_memseg;
}
extern "C" {
    /**
 * Dump the physical memory layout to a file.
 *
 * @param f
 *   A pointer to a file for output
 */
    pub fn rte_dump_physmem_layout(f: *mut FILE);
}
extern "C" {
    /**
 * Get the total amount of available physical memory.
 *
 * @return
 *    The total amount of available physical memory in bytes.
 */
    pub fn rte_eal_get_physmem_size() -> u64;
}
extern "C" {
    /**
 * Get the number of memory channels.
 *
 * @return
 *   The number of memory channels on the system. The value is 0 if unknown
 *   or not the same on all devices.
 */
    pub fn rte_memory_get_nchannel() -> ::std::os::raw::c_uint;
}
extern "C" {
    /**
 * Get the number of memory ranks.
 *
 * @return
 *   The number of memory ranks on the system. The value is 0 if unknown or
 *   not the same on all devices.
 */
    pub fn rte_memory_get_nrank() -> ::std::os::raw::c_uint;
}
/**
 * A structure describing a memzone, which is a contiguous portion of
 * physical memory identified by a name.
 */
#[repr(C, packed)]
#[derive(Debug, Default, Copy)]
pub struct rte_memzone {
    /**< Name of the memory zone. */
    pub name: [::std::os::raw::c_char; 32usize],
    /**< Start physical address. */
    pub phys_addr: phys_addr_t,
    pub __bindgen_anon_1: rte_memzone__bindgen_ty_1,
    /**< Length of the memzone. */
    pub len: usize,
    /**< The page size of underlying memory */
    pub hugepage_sz: u64,
    /**< NUMA socket ID. */
    pub socket_id: i32,
    /**< Characteristics of this memzone. */
    pub flags: u32,
    /**< Memseg it belongs. */
    pub memseg_id: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_memzone__bindgen_ty_1 {
    /**< Start virtual address. */
    pub addr: __BindgenUnionField<*mut ::std::os::raw::c_void>,
    /**< Makes sure addr is always 64-bits */
    pub addr_64: __BindgenUnionField<u64>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_rte_memzone__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_memzone__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_memzone__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_memzone__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_memzone__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone__bindgen_ty_1 ) ) . addr as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_memzone__bindgen_ty_1 ) , "::" , stringify ! ( addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone__bindgen_ty_1 ) ) . addr_64
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_memzone__bindgen_ty_1 ) , "::" , stringify ! ( addr_64 )
                ));
}
impl Clone for rte_memzone__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_memzone() {
    assert_eq!(::std::mem::size_of::<rte_memzone>() , 76usize , concat ! (
               "Size of: " , stringify ! ( rte_memzone ) ));
    assert_eq! (::std::mem::align_of::<rte_memzone>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( rte_memzone ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . phys_addr as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( phys_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . len as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . hugepage_sz as * const
                _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( hugepage_sz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . socket_id as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( socket_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . flags as * const _ as
                usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_memzone ) ) . memseg_id as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_memzone ) , "::" ,
                stringify ! ( memseg_id ) ));
}
impl Clone for rte_memzone {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /**
 * Reserve a portion of physical memory.
 *
 * This function reserves some memory and returns a pointer to a
 * correctly filled memzone descriptor. If the allocation cannot be
 * done, return NULL.
 *
 * @param name
 *   The name of the memzone. If it already exists, the function will
 *   fail and return NULL.
 * @param len
 *   The size of the memory to be reserved. If it
 *   is 0, the biggest contiguous zone will be reserved.
 * @param socket_id
 *   The socket identifier in the case of
 *   NUMA. The value can be SOCKET_ID_ANY if there is no NUMA
 *   constraint for the reserved zone.
 * @param flags
 *   The flags parameter is used to request memzones to be
 *   taken from specifically sized hugepages.
 *   - RTE_MEMZONE_2MB - Reserved from 2MB pages
 *   - RTE_MEMZONE_1GB - Reserved from 1GB pages
 *   - RTE_MEMZONE_16MB - Reserved from 16MB pages
 *   - RTE_MEMZONE_16GB - Reserved from 16GB pages
 *   - RTE_MEMZONE_256KB - Reserved from 256KB pages
 *   - RTE_MEMZONE_256MB - Reserved from 256MB pages
 *   - RTE_MEMZONE_512MB - Reserved from 512MB pages
 *   - RTE_MEMZONE_4GB - Reserved from 4GB pages
 *   - RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if
 *                                  the requested page size is unavailable.
 *                                  If this flag is not set, the function
 *                                  will return error on an unavailable size
 *                                  request.
 * @return
 *   A pointer to a correctly-filled read-only memzone descriptor, or NULL
 *   on error.
 *   On error case, rte_errno will be set appropriately:
 *    - E_RTE_NO_CONFIG - function could not get pointer to rte_config structure
 *    - E_RTE_SECONDARY - function was called from a secondary process instance
 *    - ENOSPC - the maximum number of memzones has already been allocated
 *    - EEXIST - a memzone with the same name already exists
 *    - ENOMEM - no appropriate memory area found in which to create memzone
 *    - EINVAL - invalid parameters
 */
    pub fn rte_memzone_reserve(name: *const ::std::os::raw::c_char,
                               len: usize, socket_id: ::std::os::raw::c_int,
                               flags: ::std::os::raw::c_uint)
     -> *const rte_memzone;
}
extern "C" {
    /**
 * Reserve a portion of physical memory with alignment on a specified
 * boundary.
 *
 * This function reserves some memory with alignment on a specified
 * boundary, and returns a pointer to a correctly filled memzone
 * descriptor. If the allocation cannot be done or if the alignment
 * is not a power of 2, returns NULL.
 *
 * @param name
 *   The name of the memzone. If it already exists, the function will
 *   fail and return NULL.
 * @param len
 *   The size of the memory to be reserved. If it
 *   is 0, the biggest contiguous zone will be reserved.
 * @param socket_id
 *   The socket identifier in the case of
 *   NUMA. The value can be SOCKET_ID_ANY if there is no NUMA
 *   constraint for the reserved zone.
 * @param flags
 *   The flags parameter is used to request memzones to be
 *   taken from specifically sized hugepages.
 *   - RTE_MEMZONE_2MB - Reserved from 2MB pages
 *   - RTE_MEMZONE_1GB - Reserved from 1GB pages
 *   - RTE_MEMZONE_16MB - Reserved from 16MB pages
 *   - RTE_MEMZONE_16GB - Reserved from 16GB pages
 *   - RTE_MEMZONE_256KB - Reserved from 256KB pages
 *   - RTE_MEMZONE_256MB - Reserved from 256MB pages
 *   - RTE_MEMZONE_512MB - Reserved from 512MB pages
 *   - RTE_MEMZONE_4GB - Reserved from 4GB pages
 *   - RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if
 *                                  the requested page size is unavailable.
 *                                  If this flag is not set, the function
 *                                  will return error on an unavailable size
 *                                  request.
 * @param align
 *   Alignment for resulting memzone. Must be a power of 2.
 * @return
 *   A pointer to a correctly-filled read-only memzone descriptor, or NULL
 *   on error.
 *   On error case, rte_errno will be set appropriately:
 *    - E_RTE_NO_CONFIG - function could not get pointer to rte_config structure
 *    - E_RTE_SECONDARY - function was called from a secondary process instance
 *    - ENOSPC - the maximum number of memzones has already been allocated
 *    - EEXIST - a memzone with the same name already exists
 *    - ENOMEM - no appropriate memory area found in which to create memzone
 *    - EINVAL - invalid parameters
 */
    pub fn rte_memzone_reserve_aligned(name: *const ::std::os::raw::c_char,
                                       len: usize,
                                       socket_id: ::std::os::raw::c_int,
                                       flags: ::std::os::raw::c_uint,
                                       align: ::std::os::raw::c_uint)
     -> *const rte_memzone;
}
extern "C" {
    /**
 * Reserve a portion of physical memory with specified alignment and
 * boundary.
 *
 * This function reserves some memory with specified alignment and
 * boundary, and returns a pointer to a correctly filled memzone
 * descriptor. If the allocation cannot be done or if the alignment
 * or boundary are not a power of 2, returns NULL.
 * Memory buffer is reserved in a way, that it wouldn't cross specified
 * boundary. That implies that requested length should be less or equal
 * then boundary.
 *
 * @param name
 *   The name of the memzone. If it already exists, the function will
 *   fail and return NULL.
 * @param len
 *   The size of the memory to be reserved. If it
 *   is 0, the biggest contiguous zone will be reserved.
 * @param socket_id
 *   The socket identifier in the case of
 *   NUMA. The value can be SOCKET_ID_ANY if there is no NUMA
 *   constraint for the reserved zone.
 * @param flags
 *   The flags parameter is used to request memzones to be
 *   taken from specifically sized hugepages.
 *   - RTE_MEMZONE_2MB - Reserved from 2MB pages
 *   - RTE_MEMZONE_1GB - Reserved from 1GB pages
 *   - RTE_MEMZONE_16MB - Reserved from 16MB pages
 *   - RTE_MEMZONE_16GB - Reserved from 16GB pages
 *   - RTE_MEMZONE_256KB - Reserved from 256KB pages
 *   - RTE_MEMZONE_256MB - Reserved from 256MB pages
 *   - RTE_MEMZONE_512MB - Reserved from 512MB pages
 *   - RTE_MEMZONE_4GB - Reserved from 4GB pages
 *   - RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if
 *                                  the requested page size is unavailable.
 *                                  If this flag is not set, the function
 *                                  will return error on an unavailable size
 *                                  request.
 * @param align
 *   Alignment for resulting memzone. Must be a power of 2.
 * @param bound
 *   Boundary for resulting memzone. Must be a power of 2 or zero.
 *   Zero value implies no boundary condition.
 * @return
 *   A pointer to a correctly-filled read-only memzone descriptor, or NULL
 *   on error.
 *   On error case, rte_errno will be set appropriately:
 *    - E_RTE_NO_CONFIG - function could not get pointer to rte_config structure
 *    - E_RTE_SECONDARY - function was called from a secondary process instance
 *    - ENOSPC - the maximum number of memzones has already been allocated
 *    - EEXIST - a memzone with the same name already exists
 *    - ENOMEM - no appropriate memory area found in which to create memzone
 *    - EINVAL - invalid parameters
 */
    pub fn rte_memzone_reserve_bounded(name: *const ::std::os::raw::c_char,
                                       len: usize,
                                       socket_id: ::std::os::raw::c_int,
                                       flags: ::std::os::raw::c_uint,
                                       align: ::std::os::raw::c_uint,
                                       bound: ::std::os::raw::c_uint)
     -> *const rte_memzone;
}
extern "C" {
    /**
 * Free a memzone.
 *
 * @param mz
 *   A pointer to the memzone
 * @return
 *  -EINVAL - invalid parameter.
 *  0 - success
 */
    pub fn rte_memzone_free(mz: *const rte_memzone) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Lookup for a memzone.
 *
 * Get a pointer to a descriptor of an already reserved memory
 * zone identified by the name given as an argument.
 *
 * @param name
 *   The name of the memzone.
 * @return
 *   A pointer to a read-only memzone descriptor.
 */
    pub fn rte_memzone_lookup(name: *const ::std::os::raw::c_char)
     -> *const rte_memzone;
}
extern "C" {
    /**
 * Dump all reserved memzones to a file.
 *
 * @param f
 *   A pointer to a file for output
 */
    pub fn rte_memzone_dump(f: *mut FILE);
}
extern "C" {
    /**
 * Walk list of all memzones
 *
 * @param func
 *   Iterator function
 * @param arg
 *   Argument passed to iterator
 */
    pub fn rte_memzone_walk(func:
                                ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                               *const rte_memzone,
                                                                           arg:
                                                                               *mut ::std::os::raw::c_void)>,
                            arg: *mut ::std::os::raw::c_void);
}
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[test]
fn bindgen_test_layout_cpu_set_t() {
    assert_eq!(::std::mem::size_of::<cpu_set_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( cpu_set_t ) ));
    assert_eq! (::std::mem::align_of::<cpu_set_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( cpu_set_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const cpu_set_t ) ) . __bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( cpu_set_t ) , "::" ,
                stringify ! ( __bits ) ));
}
impl Clone for cpu_set_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
/**
 * The lcore role (used in RTE or not).
 */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_lcore_role_t { ROLE_RTE = 0, ROLE_OFF = 1, }
#[repr(i32)]
/**
 * The type of process in a linuxapp, multi-process setup
 */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_proc_type_t {
    RTE_PROC_AUTO = -1,
    RTE_PROC_PRIMARY = 0,
    RTE_PROC_SECONDARY = 1,
    RTE_PROC_INVALID = 2,
}
/**
 * The global RTE configuration structure.
 */
#[repr(C, packed)]
pub struct rte_config {
    /**< Id of the master lcore */
    pub master_lcore: u32,
    /**< Number of available logical cores. */
    pub lcore_count: u32,
    /**< State of cores. */
    pub lcore_role: [rte_lcore_role_t; 128usize],
    /** Primary or secondary configuration */
    pub process_type: rte_proc_type_t,
    /**
	 * Pointer to memory configuration, which may be shared across multiple
	 * DPDK instances
	 */
    pub mem_config: *mut rte_mem_config,
}
#[test]
fn bindgen_test_layout_rte_config() {
    assert_eq!(::std::mem::size_of::<rte_config>() , 532usize , concat ! (
               "Size of: " , stringify ! ( rte_config ) ));
    assert_eq! (::std::mem::align_of::<rte_config>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( rte_config ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_config ) ) . master_lcore as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_config ) , "::" ,
                stringify ! ( master_lcore ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_config ) ) . lcore_count as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_config ) , "::" ,
                stringify ! ( lcore_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_config ) ) . lcore_role as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_config ) , "::" ,
                stringify ! ( lcore_role ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_config ) ) . process_type as * const
                _ as usize } , 520usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_config ) , "::" ,
                stringify ! ( process_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_config ) ) . mem_config as * const _
                as usize } , 524usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_config ) , "::" ,
                stringify ! ( mem_config ) ));
}
impl Default for rte_config {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Get the global configuration structure.
 *
 * @return
 *   A pointer to the global configuration structure.
 */
    pub fn rte_eal_get_configuration() -> *mut rte_config;
}
extern "C" {
    /**
 * Get a lcore's role.
 *
 * @param lcore_id
 *   The identifier of the lcore.
 * @return
 *   The role of the lcore.
 */
    pub fn rte_eal_lcore_role(lcore_id: ::std::os::raw::c_uint)
     -> rte_lcore_role_t;
}
extern "C" {
    /**
 * Get the process type in a multi-process setup
 *
 * @return
 *   The process type
 */
    pub fn rte_eal_process_type() -> rte_proc_type_t;
}
extern "C" {
    /**
 * Request iopl privilege for all RPL.
 *
 * This function should be called by pmds which need access to ioports.

 * @return
 *   - On success, returns 0.
 *   - On failure, returns -1.
 */
    pub fn rte_eal_iopl_init() -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Initialize the Environment Abstraction Layer (EAL).
 *
 * This function is to be executed on the MASTER lcore only, as soon
 * as possible in the application's main() function.
 *
 * The function finishes the initialization process before main() is called.
 * It puts the SLAVE lcores in the WAIT state.
 *
 * When the multi-partition feature is supported, depending on the
 * configuration (if CONFIG_RTE_EAL_MAIN_PARTITION is disabled), this
 * function waits to ensure that the magic number is set before
 * returning. See also the rte_eal_get_configuration() function. Note:
 * This behavior may change in the future.
 *
 * @param argc
 *   The argc argument that was given to the main() function.
 * @param argv
 *   The argv argument that was given to the main() function.
 * @return
 *   - On success, the number of parsed arguments, which is greater or
 *     equal to zero. After the call to rte_eal_init(),
 *     all arguments argv[x] with x < ret may be modified and should
 *     not be accessed by the application.
 *   - On failure, a negative error value.
 */
    pub fn rte_eal_init(argc: ::std::os::raw::c_int,
                        argv: *mut *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Check if a primary process is currently alive
 *
 * This function returns true when a primary process is currently
 * active.
 *
 * @param config_file_path
 *   The config_file_path argument provided should point at the location
 *   that the primary process will create its config file. If NULL, the default
 *   config file path is used.
 *
 * @return
 *  - If alive, returns 1.
 *  - If dead, returns 0.
 */
    pub fn rte_eal_primary_proc_alive(config_file_path:
                                          *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
/**
 * Usage function typedef used by the application usage function.
 *
 * Use this function typedef to define and call rte_set_applcation_usage_hook()
 * routine.
 */
pub type rte_usage_hook_t =
    ::std::option::Option<unsafe extern "C" fn(prgname:
                                                   *const ::std::os::raw::c_char)>;
extern "C" {
    /**
 * Add application usage routine callout from the eal_usage() routine.
 *
 * This function allows the application to include its usage message
 * in the EAL system usage message. The routine rte_set_application_usage_hook()
 * needs to be called before the rte_eal_init() routine in the application.
 *
 * This routine is optional for the application and will behave as if the set
 * routine was never called as the default behavior.
 *
 * @param usage_func
 *   The func argument is a function pointer to the application usage routine.
 *   Called function is defined using rte_usage_hook_t typedef, which is of
 *   the form void rte_usage_func(const char * prgname).
 *
 *   Calling this routine with a NULL value will reset the usage hook routine and
 *   return the current value, which could be NULL.
 * @return
 *   - Returns the current value of the rte_application_usage pointer to allow
 *     the caller to daisy chain the usage routines if needing more then one.
 */
    pub fn rte_set_application_usage_hook(usage_func: rte_usage_hook_t)
     -> rte_usage_hook_t;
}
extern "C" {
    /**
 * Whether EAL is using huge pages (disabled by --no-huge option).
 * The no-huge mode cannot be used with UIO poll-mode drivers like igb/ixgbe.
 * It is useful for NIC drivers (e.g. librte_pmd_mlx4, librte_pmd_vmxnet3) or
 * crypto drivers (e.g. librte_crypto_nitrox) provided by third-parties such
 * as 6WIND.
 *
 * @return
 *   Nonzero if hugepages are enabled.
 */
    pub fn rte_eal_has_hugepages() -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * A wrap API for syscall gettid.
 *
 * @return
 *   On success, returns the thread ID of calling process.
 *   It is always successful.
 */
    pub fn rte_sys_gettid() -> ::std::os::raw::c_int;
}
#[repr(u32)]
/**
 * State of an lcore.
 */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_lcore_state_t { WAIT = 0, RUNNING = 1, FINISHED = 2, }
/**
 * Definition of a remote launch function.
 */
pub type lcore_function_t =
    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                   *mut ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    /**
 * Launch a function on another lcore.
 *
 * To be executed on the MASTER lcore only.
 *
 * Sends a message to a slave lcore (identified by the slave_id) that
 * is in the WAIT state (this is true after the first call to
 * rte_eal_init()). This can be checked by first calling
 * rte_eal_wait_lcore(slave_id).
 *
 * When the remote lcore receives the message, it switches to
 * the RUNNING state, then calls the function f with argument arg. Once the
 * execution is done, the remote lcore switches to a FINISHED state and
 * the return value of f is stored in a local variable to be read using
 * rte_eal_wait_lcore().
 *
 * The MASTER lcore returns as soon as the message is sent and knows
 * nothing about the completion of f.
 *
 * Note: This function is not designed to offer optimum
 * performance. It is just a practical way to launch a function on
 * another lcore at initialization time.
 *
 * @param f
 *   The function to be called.
 * @param arg
 *   The argument for the function.
 * @param slave_id
 *   The identifier of the lcore on which the function should be executed.
 * @return
 *   - 0: Success. Execution of function f started on the remote lcore.
 *   - (-EBUSY): The remote lcore is not in a WAIT state.
 */
    pub fn rte_eal_remote_launch(f: lcore_function_t,
                                 arg: *mut ::std::os::raw::c_void,
                                 slave_id: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
#[repr(u32)]
/**
 * This enum indicates whether the master core must execute the handler
 * launched on all logical cores.
 */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_rmt_call_master_t { SKIP_MASTER = 0, CALL_MASTER = 1, }
extern "C" {
    /**
 * Launch a function on all lcores.
 *
 * Check that each SLAVE lcore is in a WAIT state, then call
 * rte_eal_remote_launch() for each lcore.
 *
 * @param f
 *   The function to be called.
 * @param arg
 *   The argument for the function.
 * @param call_master
 *   If call_master set to SKIP_MASTER, the MASTER lcore does not call
 *   the function. If call_master is set to CALL_MASTER, the function
 *   is also called on master before returning. In any case, the master
 *   lcore returns as soon as it finished its job and knows nothing
 *   about the completion of f on the other lcores.
 * @return
 *   - 0: Success. Execution of function f started on all remote lcores.
 *   - (-EBUSY): At least one remote lcore is not in a WAIT state. In this
 *     case, no message is sent to any of the lcores.
 */
    pub fn rte_eal_mp_remote_launch(f: lcore_function_t,
                                    arg: *mut ::std::os::raw::c_void,
                                    call_master: rte_rmt_call_master_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Get the state of the lcore identified by slave_id.
 *
 * To be executed on the MASTER lcore only.
 *
 * @param slave_id
 *   The identifier of the lcore.
 * @return
 *   The state of the lcore.
 */
    pub fn rte_eal_get_lcore_state(slave_id: ::std::os::raw::c_uint)
     -> rte_lcore_state_t;
}
extern "C" {
    /**
 * Wait until an lcore finishes its job.
 *
 * To be executed on the MASTER lcore only.
 *
 * If the slave lcore identified by the slave_id is in a FINISHED state,
 * switch to the WAIT state. If the lcore is in RUNNING state, wait until
 * the lcore finishes its job and moves to the FINISHED state.
 *
 * @param slave_id
 *   The identifier of the lcore.
 * @return
 *   - 0: If the lcore identified by the slave_id is in a WAIT state.
 *   - The value that was returned by the previous remote launch
 *     function call if the lcore identified by the slave_id was in a
 *     FINISHED or RUNNING state. In this case, it changes the state
 *     of the lcore to WAIT.
 */
    pub fn rte_eal_wait_lcore(slave_id: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Wait until all lcores finish their jobs.
 *
 * To be executed on the MASTER lcore only. Issue an
 * rte_eal_wait_lcore() for every lcore. The return values are
 * ignored.
 *
 * After a call to rte_eal_mp_wait_lcore(), the caller can assume
 * that all slave lcores are in a WAIT state.
 */
    pub fn rte_eal_mp_wait_lcore();
}
pub type rte_cpuset_t = cpu_set_t;
/**
 * Structure storing internal configuration (per-lcore)
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lcore_config {
    /**< true if lcore was detected */
    pub detected: ::std::os::raw::c_uint,
    /**< pthread identifier */
    pub thread_id: pthread_t,
    /**< communication pipe with master */
    pub pipe_master2slave: [::std::os::raw::c_int; 2usize],
    /**< communication pipe with master */
    pub pipe_slave2master: [::std::os::raw::c_int; 2usize],
    /**< function to call */
    pub f: lcore_function_t,
    /**< argument of function */
    pub arg: *mut ::std::os::raw::c_void,
    /**< return value of function */
    pub ret: ::std::os::raw::c_int,
    /**< lcore state */
    pub state: rte_lcore_state_t,
    /**< physical socket id for this lcore */
    pub socket_id: ::std::os::raw::c_uint,
    /**< core number on socket for this lcore */
    pub core_id: ::std::os::raw::c_uint,
    /**< relative index, starting from 0 */
    pub core_index: ::std::os::raw::c_int,
    /**< cpu set which the lcore affinity to */
    pub cpuset: rte_cpuset_t,
}
#[test]
fn bindgen_test_layout_lcore_config() {
    assert_eq!(::std::mem::size_of::<lcore_config>() , 200usize , concat ! (
               "Size of: " , stringify ! ( lcore_config ) ));
    assert_eq! (::std::mem::align_of::<lcore_config>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lcore_config ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . detected as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( detected ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . thread_id as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( thread_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . pipe_master2slave as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( pipe_master2slave ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . pipe_slave2master as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( pipe_slave2master ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . f as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( f ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . arg as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( arg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . ret as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( ret ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . state as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . socket_id as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( socket_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . core_id as * const _
                as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( core_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . core_index as * const
                _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( core_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lcore_config ) ) . cpuset as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( lcore_config ) , "::" ,
                stringify ! ( cpuset ) ));
}
impl Clone for lcore_config {
    fn clone(&self) -> Self { *self }
}
impl Default for lcore_config {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    #[link_name = "lcore_config"]
    pub static mut lcore_config: [lcore_config; 128usize];
}
extern "C" {
    /**
 * Return the ID of the physical socket of the logical core we are
 * running on.
 * @return
 *   the ID of current lcoreid's physical socket
 */
    pub fn rte_socket_id() -> ::std::os::raw::c_uint;
}
extern "C" {
    /**
 * Set core affinity of the current thread.
 * Support both EAL and non-EAL thread and update TLS.
 *
 * @param cpusetp
 *   Point to cpu_set_t for setting current thread affinity.
 * @return
 *   On success, return 0; otherwise return -1;
 */
    pub fn rte_thread_set_affinity(cpusetp: *mut rte_cpuset_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Get core affinity of the current thread.
 *
 * @param cpusetp
 *   Point to cpu_set_t for getting current thread cpu affinity.
 *   It presumes input is not NULL, otherwise it causes panic.
 *
 */
    pub fn rte_thread_get_affinity(cpusetp: *mut rte_cpuset_t);
}
extern "C" {
    /**
 * Set thread names.
 *
 * @note It fails with glibc < 2.12.
 *
 * @param id
 *   Thread id.
 * @param name
 *   Thread name to set.
 * @return
 *   On success, return 0; otherwise return a negative value.
 */
    pub fn rte_thread_setname(id: pthread_t,
                              name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
/**
 * The rte_spinlock_t type.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_spinlock_t {
    /**< lock status 0 = unlocked, 1 = locked */
    pub locked: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rte_spinlock_t() {
    assert_eq!(::std::mem::size_of::<rte_spinlock_t>() , 4usize , concat ! (
               "Size of: " , stringify ! ( rte_spinlock_t ) ));
    assert_eq! (::std::mem::align_of::<rte_spinlock_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rte_spinlock_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_spinlock_t ) ) . locked as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_spinlock_t ) , "::"
                , stringify ! ( locked ) ));
}
impl Clone for rte_spinlock_t {
    fn clone(&self) -> Self { *self }
}
/**
 * The rte_spinlock_recursive_t type.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_spinlock_recursive_t {
    /**< the actual spinlock */
    pub sl: rte_spinlock_t,
    /**< core id using lock, -1 for unused */
    pub user: ::std::os::raw::c_int,
    /**< count of time this lock has been called */
    pub count: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rte_spinlock_recursive_t() {
    assert_eq!(::std::mem::size_of::<rte_spinlock_recursive_t>() , 12usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_spinlock_recursive_t ) ));
    assert_eq! (::std::mem::align_of::<rte_spinlock_recursive_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_spinlock_recursive_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_spinlock_recursive_t ) ) . sl as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_spinlock_recursive_t ) , "::" , stringify ! ( sl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_spinlock_recursive_t ) ) . user as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_spinlock_recursive_t ) , "::" , stringify ! ( user ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_spinlock_recursive_t ) ) . count as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_spinlock_recursive_t ) , "::" , stringify ! ( count ) ));
}
impl Clone for rte_spinlock_recursive_t {
    fn clone(&self) -> Self { *self }
}
/**
 * Structure to hold malloc heap
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct malloc_heap {
    pub lock: rte_spinlock_t,
    pub free_head: [malloc_heap__bindgen_ty_1; 13usize],
    pub alloc_count: ::std::os::raw::c_uint,
    pub total_size: usize,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct malloc_heap__bindgen_ty_1 {
    pub lh_first: *mut malloc_elem,
}
#[test]
fn bindgen_test_layout_malloc_heap__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<malloc_heap__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( malloc_heap__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<malloc_heap__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( malloc_heap__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_heap__bindgen_ty_1 ) ) . lh_first
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                malloc_heap__bindgen_ty_1 ) , "::" , stringify ! ( lh_first )
                ));
}
impl Clone for malloc_heap__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for malloc_heap__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_malloc_heap() {
    assert_eq!(::std::mem::size_of::<malloc_heap>() , 128usize , concat ! (
               "Size of: " , stringify ! ( malloc_heap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_heap ) ) . lock as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_heap ) , "::" ,
                stringify ! ( lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_heap ) ) . free_head as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_heap ) , "::" ,
                stringify ! ( free_head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_heap ) ) . alloc_count as * const
                _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_heap ) , "::" ,
                stringify ! ( alloc_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const malloc_heap ) ) . total_size as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( malloc_heap ) , "::" ,
                stringify ! ( total_size ) ));
}
impl Clone for malloc_heap {
    fn clone(&self) -> Self { *self }
}
impl Default for malloc_heap {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * The rte_rwlock_t type.
 *
 * cnt is -1 when write lock is held, and > 0 when read locks are held.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_rwlock_t {
    /**< -1 when W lock held, > 0 when R locks held. */
    pub cnt: i32,
}
#[test]
fn bindgen_test_layout_rte_rwlock_t() {
    assert_eq!(::std::mem::size_of::<rte_rwlock_t>() , 4usize , concat ! (
               "Size of: " , stringify ! ( rte_rwlock_t ) ));
    assert_eq! (::std::mem::align_of::<rte_rwlock_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rte_rwlock_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_rwlock_t ) ) . cnt as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_rwlock_t ) , "::" ,
                stringify ! ( cnt ) ));
}
impl Clone for rte_rwlock_t {
    fn clone(&self) -> Self { *self }
}
/**
 * the structure for the memory configuration for the RTE.
 * Used by the rte_config structure. It is separated out, as for multi-process
 * support, the memory details should be shared across instances
 */
#[repr(C, packed)]
pub struct rte_mem_config {
    /**< Magic number - Sanity check. */
    pub magic: u32,
    /**< Number of channels (0 if unknown). */
    pub nchannel: u32,
    /**< Number of ranks (0 if unknown). */
    pub nrank: u32,
    /**< only used by memzone LIB for thread-safe. */
    pub mlock: rte_rwlock_t,
    /**< used for tailq operation for thread safe. */
    pub qlock: rte_rwlock_t,
    /**< only used by mempool LIB for thread-safe. */
    pub mplock: rte_rwlock_t,
    /**< Number of allocated memzones */
    pub memzone_cnt: u32,
    /**< Physmem descriptors. */
    pub memseg: [rte_memseg; 256usize],
    /**< Memzone descriptors. */
    pub memzone: [rte_memzone; 2560usize],
    /**< Tailqs for objects */
    pub tailq_head: [rte_tailq_head; 32usize],
    pub malloc_heaps: [malloc_heap; 8usize],
    pub mem_cfg_addr: u64,
}
#[test]
fn bindgen_test_layout_rte_mem_config() {
    assert_eq!(::std::mem::size_of::<rte_mem_config>() , 208420usize , concat
               ! ( "Size of: " , stringify ! ( rte_mem_config ) ));
    assert_eq! (::std::mem::align_of::<rte_mem_config>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( rte_mem_config ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . magic as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( magic ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . nchannel as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( nchannel ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . nrank as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( nrank ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . mlock as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( mlock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . qlock as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( qlock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . mplock as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( mplock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . memzone_cnt as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( memzone_cnt ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . memseg as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( memseg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . memzone as * const _
                as usize } , 11292usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( memzone ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . tailq_head as *
                const _ as usize } , 205852usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( tailq_head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . malloc_heaps as *
                const _ as usize } , 207388usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( malloc_heaps ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mem_config ) ) . mem_cfg_addr as *
                const _ as usize } , 208412usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mem_config ) , "::"
                , stringify ! ( mem_cfg_addr ) ));
}
impl Default for rte_mem_config {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Function which returns a printable string describing a particular
 * error code. For non-RTE-specific error codes, this function returns
 * the value from the libc strerror function.
 *
 * @param errnum
 *   The error number to be looked up - generally the value of rte_errno
 * @return
 *   A pointer to a thread-local string containing the text describing
 *   the error.
 */
    pub fn rte_strerror(errnum: ::std::os::raw::c_int)
     -> *const ::std::os::raw::c_char;
}
pub const RTE_MIN_ERRNO: _bindgen_ty_13 = _bindgen_ty_13::RTE_MIN_ERRNO;
pub const E_RTE_SECONDARY: _bindgen_ty_13 = _bindgen_ty_13::E_RTE_SECONDARY;
pub const E_RTE_NO_CONFIG: _bindgen_ty_13 = _bindgen_ty_13::E_RTE_NO_CONFIG;
pub const RTE_MAX_ERRNO: _bindgen_ty_13 = _bindgen_ty_13::RTE_MAX_ERRNO;
#[repr(u32)]
/** Error types */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_13 {
    RTE_MIN_ERRNO = 1000,
    E_RTE_SECONDARY = 1001,
    E_RTE_NO_CONFIG = 1002,
    RTE_MAX_ERRNO = 1003,
}
extern "C" {
    /**
* Dump out memory in a special hex dump format.
*
* @param f
*		A pointer to a file for output
* @param title
*		If not NULL this string is printed as a header to the output.
* @param buf
*		This is the buffer address to print out.
* @param len
*		The number of bytes to dump out
* @return
*		None.
*/
    pub fn rte_hexdump(f: *mut FILE, title: *const ::std::os::raw::c_char,
                       buf: *const ::std::os::raw::c_void,
                       len: ::std::os::raw::c_uint);
}
extern "C" {
    /**
* Dump out memory in a hex format with colons between bytes.
*
* @param f
*		A pointer to a file for output
* @param title
*		If not NULL this string is printed as a header to the output.
* @param buf
*		This is the buffer address to print out.
* @param len
*		The number of bytes to dump out
* @return
*		None.
*/
    pub fn rte_memdump(f: *mut FILE, title: *const ::std::os::raw::c_char,
                       buf: *const ::std::os::raw::c_void,
                       len: ::std::os::raw::c_uint);
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_keepalive_state {
    RTE_KA_STATE_UNUSED = 0,
    RTE_KA_STATE_ALIVE = 1,
    RTE_KA_STATE_MISSING = 4,
    RTE_KA_STATE_DEAD = 2,
    RTE_KA_STATE_GONE = 3,
    RTE_KA_STATE_DOZING = 5,
    RTE_KA_STATE_SLEEP = 6,
}
/**
 * Keepalive failure callback.
 *
 *  Receives a data pointer passed to rte_keepalive_create() and the id of the
 *  failed core.
 *  @param data Data pointer passed to rte_keepalive_create()
 *  @param id_core ID of the core that has failed
 */
pub type rte_keepalive_failure_callback_t =
    ::std::option::Option<unsafe extern "C" fn(data:
                                                   *mut ::std::os::raw::c_void,
                                               id_core:
                                                   ::std::os::raw::c_int)>;
/**
 * Keepalive relay callback.
 *
 *  Receives a data pointer passed to rte_keepalive_register_relay_callback(),
 *  the id of the core for which state is to be forwarded, and details of the
 *  current core state.
 *  @param data Data pointer passed to rte_keepalive_register_relay_callback()
 *  @param id_core ID of the core for which state is being reported
 *  @param core_state The current state of the core
 *  @param Timestamp of when core was last seen alive
 */
pub type rte_keepalive_relay_callback_t =
    ::std::option::Option<unsafe extern "C" fn(data:
                                                   *mut ::std::os::raw::c_void,
                                               id_core: ::std::os::raw::c_int,
                                               core_state:
                                                   rte_keepalive_state,
                                               last_seen: u64)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_keepalive([u8; 0]);
extern "C" {
    /**
 * Initialise keepalive sub-system.
 * @param callback
 *   Function called upon detection of a dead core.
 * @param data
 *   Data pointer to be passed to function callback.
 * @return
 *   Keepalive structure success, NULL on failure.
 */
    #[link_name = "_Z20rte_keepalive_createPFvPviES_"]
    pub fn rte_keepalive_create(callback: rte_keepalive_failure_callback_t,
                                data: *mut ::std::os::raw::c_void)
     -> *mut rte_keepalive;
}
extern "C" {
    /**
 * Checks & handles keepalive state of monitored cores.
 * @param *ptr_timer Triggering timer (unused)
 * @param *ptr_data  Data pointer (keepalive structure)
 */
    #[link_name = "_Z28rte_keepalive_dispatch_pingsPvS_"]
    pub fn rte_keepalive_dispatch_pings(ptr_timer:
                                            *mut ::std::os::raw::c_void,
                                        ptr_data:
                                            *mut ::std::os::raw::c_void);
}
extern "C" {
    /**
 * Registers a core for keepalive checks.
 * @param *keepcfg
 *   Keepalive structure pointer
 * @param id_core
 *   ID number of core to register.
 */
    #[link_name = "_Z27rte_keepalive_register_coreP13rte_keepalivei"]
    pub fn rte_keepalive_register_core(keepcfg: *mut rte_keepalive,
                                       id_core: ::std::os::raw::c_int);
}
extern "C" {
    /**
 * Per-core keepalive check.
 * @param *keepcfg
 *   Keepalive structure pointer
 *
 * This function needs to be called from within the main process loop of
 * the LCore to be checked.
 */
    #[link_name = "_Z24rte_keepalive_mark_aliveP13rte_keepalive"]
    pub fn rte_keepalive_mark_alive(keepcfg: *mut rte_keepalive);
}
extern "C" {
    /**
 * Per-core sleep-time indication.
 * @param *keepcfg
 *   Keepalive structure pointer
 *
 * If CPU idling is enabled, this function needs to be called from within
 * the main process loop of the LCore going to sleep, in order to avoid
 * the LCore being mis-detected as dead.
 */
    #[link_name = "_Z24rte_keepalive_mark_sleepP13rte_keepalive"]
    pub fn rte_keepalive_mark_sleep(keepcfg: *mut rte_keepalive);
}
extern "C" {
    /**
 * Registers a 'live core' callback.
 *
 * The complement of the 'dead core' callback. This is called when a
 * core is known to be alive, and is intended for cases when an app
 * needs to know 'liveness' beyond just knowing when a core has died.
 *
 * @param *keepcfg
 *   Keepalive structure pointer
 * @param callback
 *   Function called upon detection of a dead core.
 * @param data
 *   Data pointer to be passed to function callback.
 */
    #[link_name =
          "_Z37rte_keepalive_register_relay_callbackP13rte_keepalivePFvPvi19rte_keepalive_statemES1_"]
    pub fn rte_keepalive_register_relay_callback(keepcfg: *mut rte_keepalive,
                                                 callback:
                                                     rte_keepalive_relay_callback_t,
                                                 data:
                                                     *mut ::std::os::raw::c_void);
}
/**
 *  Structure to hold heap statistics obtained from rte_malloc_get_socket_stats function.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_malloc_socket_stats {
    /**< Total bytes on heap */
    pub heap_totalsz_bytes: usize,
    /**< Total free bytes on heap */
    pub heap_freesz_bytes: usize,
    /**< Size in bytes of largest free block */
    pub greatest_free_size: usize,
    /**< Number of free elements on heap */
    pub free_count: ::std::os::raw::c_uint,
    /**< Number of allocated elements on heap */
    pub alloc_count: ::std::os::raw::c_uint,
    /**< Total allocated bytes on heap */
    pub heap_allocsz_bytes: usize,
}
#[test]
fn bindgen_test_layout_rte_malloc_socket_stats() {
    assert_eq!(::std::mem::size_of::<rte_malloc_socket_stats>() , 40usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_malloc_socket_stats ) ));
    assert_eq! (::std::mem::align_of::<rte_malloc_socket_stats>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_malloc_socket_stats ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) .
                heap_totalsz_bytes as * const _ as usize } , 0usize , concat !
                (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( heap_totalsz_bytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) .
                heap_freesz_bytes as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( heap_freesz_bytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) .
                greatest_free_size as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( greatest_free_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) . free_count
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( free_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) . alloc_count
                as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( alloc_count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_malloc_socket_stats ) ) .
                heap_allocsz_bytes as * const _ as usize } , 32usize , concat
                ! (
                "Alignment of field: " , stringify ! ( rte_malloc_socket_stats
                ) , "::" , stringify ! ( heap_allocsz_bytes ) ));
}
impl Clone for rte_malloc_socket_stats {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /**
 * This function allocates memory from the huge-page area of memory. The memory
 * is not cleared. In NUMA systems, the memory allocated resides on the same
 * NUMA socket as the core that calls this function.
 *
 * @param type
 *   A string identifying the type of allocated objects (useful for debug
 *   purposes, such as identifying the cause of a memory leak). Can be NULL.
 * @param size
 *   Size (in bytes) to be allocated.
 * @param align
 *   If 0, the return is a pointer that is suitably aligned for any kind of
 *   variable (in the same manner as malloc()).
 *   Otherwise, the return is a pointer that is a multiple of *align*. In
 *   this case, it must be a power of two. (Minimum alignment is the
 *   cacheline size, i.e. 64-bytes)
 * @return
 *   - NULL on error. Not enough memory, or invalid arguments (size is 0,
 *     align is not a power of two).
 *   - Otherwise, the pointer to the allocated object.
 */
    pub fn rte_malloc(type_: *const ::std::os::raw::c_char, size: usize,
                      align: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /**
 * Allocate zero'ed memory from the heap.
 *
 * Equivalent to rte_malloc() except that the memory zone is
 * initialised with zeros. In NUMA systems, the memory allocated resides on the
 * same NUMA socket as the core that calls this function.
 *
 * @param type
 *   A string identifying the type of allocated objects (useful for debug
 *   purposes, such as identifying the cause of a memory leak). Can be NULL.
 * @param size
 *   Size (in bytes) to be allocated.
 * @param align
 *   If 0, the return is a pointer that is suitably aligned for any kind of
 *   variable (in the same manner as malloc()).
 *   Otherwise, the return is a pointer that is a multiple of *align*. In
 *   this case, it must obviously be a power of two. (Minimum alignment is the
 *   cacheline size, i.e. 64-bytes)
 * @return
 *   - NULL on error. Not enough memory, or invalid arguments (size is 0,
 *     align is not a power of two).
 *   - Otherwise, the pointer to the allocated object.
 */
    pub fn rte_zmalloc(type_: *const ::std::os::raw::c_char, size: usize,
                       align: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /**
 * Replacement function for calloc(), using huge-page memory. Memory area is
 * initialised with zeros. In NUMA systems, the memory allocated resides on the
 * same NUMA socket as the core that calls this function.
 *
 * @param type
 *   A string identifying the type of allocated objects (useful for debug
 *   purposes, such as identifying the cause of a memory leak). Can be NULL.
 * @param num
 *   Number of elements to be allocated.
 * @param size
 *   Size (in bytes) of a single element.
 * @param align
 *   If 0, the return is a pointer that is suitably aligned for any kind of
 *   variable (in the same manner as malloc()).
 *   Otherwise, the return is a pointer that is a multiple of *align*. In
 *   this case, it must obviously be a power of two. (Minimum alignment is the
 *   cacheline size, i.e. 64-bytes)
 * @return
 *   - NULL on error. Not enough memory, or invalid arguments (size is 0,
 *     align is not a power of two).
 *   - Otherwise, the pointer to the allocated object.
 */
    pub fn rte_calloc(type_: *const ::std::os::raw::c_char, num: usize,
                      size: usize, align: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /**
 * Replacement function for realloc(), using huge-page memory. Reserved area
 * memory is resized, preserving contents. In NUMA systems, the new area
 * resides on the same NUMA socket as the old area.
 *
 * @param ptr
 *   Pointer to already allocated memory
 * @param size
 *   Size (in bytes) of new area. If this is 0, memory is freed.
 * @param align
 *   If 0, the return is a pointer that is suitably aligned for any kind of
 *   variable (in the same manner as malloc()).
 *   Otherwise, the return is a pointer that is a multiple of *align*. In
 *   this case, it must obviously be a power of two. (Minimum alignment is the
 *   cacheline size, i.e. 64-bytes)
 * @return
 *   - NULL on error. Not enough memory, or invalid arguments (size is 0,
 *     align is not a power of two).
 *   - Otherwise, the pointer to the reallocated memory.
 */
    pub fn rte_realloc(ptr: *mut ::std::os::raw::c_void, size: usize,
                       align: ::std::os::raw::c_uint)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /**
 * This function allocates memory from the huge-page area of memory. The memory
 * is not cleared.
 *
 * @param type
 *   A string identifying the type of allocated objects (useful for debug
 *   purposes, such as identifying the cause of a memory leak). Can be NULL.
 * @param size
 *   Size (in bytes) to be allocated.
 * @param align
 *   If 0, the return is a pointer that is suitably aligned for any kind of
 *   variable (in the same manner as malloc()).
 *   Otherwise, the return is a pointer that is a multiple of *align*. In
 *   this case, it must be a power of two. (Minimum alignment is the
 *   cacheline size, i.e. 64-bytes)
 * @param socket
 *   NUMA socket to allocate memory on. If SOCKET_ID_ANY is used, this function
 *   will behave the same as rte_malloc().
 * @return
 *   - NULL on error. Not enough memory, or invalid arguments (size is 0,
 *     align is not a power of two).
 *   - Otherwise, the pointer to the allocated object.
 */
    pub fn rte_malloc_socket(type_: *const ::std::os::raw::c_char,
                             size: usize, align: ::std::os::raw::c_uint,
                             socket: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /**
 * Allocate zero'ed memory from the heap.
 *
 * Equivalent to rte_malloc() except that the memory zone is
 * initialised with zeros.
 *
 * @param type
 *   A string identifying the type of allocated objects (useful for debug
 *   purposes, such as identifying the cause of a memory leak). Can be NULL.
 * @param size
 *   Size (in bytes) to be allocated.
 * @param align
 *   If 0, the return is a pointer that is suitably aligned for any kind of
 *   variable (in the same manner as malloc()).
 *   Otherwise, the return is a pointer that is a multiple of *align*. In
 *   this case, it must obviously be a power of two. (Minimum alignment is the
 *   cacheline size, i.e. 64-bytes)
 * @param socket
 *   NUMA socket to allocate memory on. If SOCKET_ID_ANY is used, this function
 *   will behave the same as rte_zmalloc().
 * @return
 *   - NULL on error. Not enough memory, or invalid arguments (size is 0,
 *     align is not a power of two).
 *   - Otherwise, the pointer to the allocated object.
 */
    pub fn rte_zmalloc_socket(type_: *const ::std::os::raw::c_char,
                              size: usize, align: ::std::os::raw::c_uint,
                              socket: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /**
 * Replacement function for calloc(), using huge-page memory. Memory area is
 * initialised with zeros.
 *
 * @param type
 *   A string identifying the type of allocated objects (useful for debug
 *   purposes, such as identifying the cause of a memory leak). Can be NULL.
 * @param num
 *   Number of elements to be allocated.
 * @param size
 *   Size (in bytes) of a single element.
 * @param align
 *   If 0, the return is a pointer that is suitably aligned for any kind of
 *   variable (in the same manner as malloc()).
 *   Otherwise, the return is a pointer that is a multiple of *align*. In
 *   this case, it must obviously be a power of two. (Minimum alignment is the
 *   cacheline size, i.e. 64-bytes)
 * @param socket
 *   NUMA socket to allocate memory on. If SOCKET_ID_ANY is used, this function
 *   will behave the same as rte_calloc().
 * @return
 *   - NULL on error. Not enough memory, or invalid arguments (size is 0,
 *     align is not a power of two).
 *   - Otherwise, the pointer to the allocated object.
 */
    pub fn rte_calloc_socket(type_: *const ::std::os::raw::c_char, num: usize,
                             size: usize, align: ::std::os::raw::c_uint,
                             socket: ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    /**
 * Frees the memory space pointed to by the provided pointer.
 *
 * This pointer must have been returned by a previous call to
 * rte_malloc(), rte_zmalloc(), rte_calloc() or rte_realloc(). The behaviour of
 * rte_free() is undefined if the pointer does not match this requirement.
 *
 * If the pointer is NULL, the function does nothing.
 *
 * @param ptr
 *   The pointer to memory to be freed.
 */
    pub fn rte_free(ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    /**
 * If malloc debug is enabled, check a memory block for header
 * and trailer markers to indicate that all is well with the block.
 * If size is non-null, also return the size of the block.
 *
 * @param ptr
 *   pointer to the start of a data block, must have been returned
 *   by a previous call to rte_malloc(), rte_zmalloc(), rte_calloc()
 *   or rte_realloc()
 * @param size
 *   if non-null, and memory block pointer is valid, returns the size
 *   of the memory block
 * @return
 *   -1 on error, invalid pointer passed or header and trailer markers
 *   are missing or corrupted
 *   0 on success
 */
    pub fn rte_malloc_validate(ptr: *const ::std::os::raw::c_void,
                               size: *mut usize) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Get heap statistics for the specified heap.
 *
 * @param socket
 *   An unsigned integer specifying the socket to get heap statistics for
 * @param socket_stats
 *   A structure which provides memory to store statistics
 * @return
 *   Null on error
 *   Pointer to structure storing statistics on success
 */
    pub fn rte_malloc_get_socket_stats(socket: ::std::os::raw::c_int,
                                       socket_stats:
                                           *mut rte_malloc_socket_stats)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Dump statistics.
 *
 * Dump for the specified type to a file. If the type argument is
 * NULL, all memory types will be dumped.
 *
 * @param f
 *   A pointer to a file for output
 * @param type
 *   A string identifying the type of objects to dump, or NULL
 *   to dump all objects.
 */
    pub fn rte_malloc_dump_stats(f: *mut FILE,
                                 type_: *const ::std::os::raw::c_char);
}
extern "C" {
    /**
 * Set the maximum amount of allocated memory for this type.
 *
 * This is not yet implemented
 *
 * @param type
 *   A string identifying the type of allocated objects.
 * @param max
 *   The maximum amount of allocated bytes for this type.
 * @return
 *   - 0: Success.
 *   - (-1): Error.
 */
    pub fn rte_malloc_set_limit(type_: *const ::std::os::raw::c_char,
                                max: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Return the physical address of a virtual address obtained through
 * rte_malloc
 *
 * @param addr
 *   Adress obtained from a previous rte_malloc call
 * @return
 *   NULL on error
 *   otherwise return physical address of the buffer
 */
    pub fn rte_malloc_virt2phy(addr: *const ::std::os::raw::c_void)
     -> phys_addr_t;
}
pub type xmm_t = __m128i;
#[repr(C)]
#[derive(Copy)]
pub struct rte_xmm {
    pub x: __BindgenUnionField<xmm_t>,
    pub u8: __BindgenUnionField<[u8; 16usize]>,
    pub u16: __BindgenUnionField<[u16; 8usize]>,
    pub u32: __BindgenUnionField<[u32; 4usize]>,
    pub u64: __BindgenUnionField<[u64; 2usize]>,
    pub pd: __BindgenUnionField<[f64; 2usize]>,
    pub bindgen_union_field: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_rte_xmm() {
    assert_eq!(::std::mem::size_of::<rte_xmm>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rte_xmm ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . x as * const _ as usize } ,
                0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . u8 as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( u8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . u16 as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( u16 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . u32 as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( u32 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . u64 as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( u64 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_xmm ) ) . pd as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_xmm ) , "::" ,
                stringify ! ( pd ) ));
}
impl Clone for rte_xmm {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_xmm {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
pub type rte_xmm_t = rte_xmm;
extern "C" {
    /**
 * Takes string "string" parameter and splits it at character "delim"
 * up to maxtokens-1 times - to give "maxtokens" resulting tokens. Like
 * strtok or strsep functions, this modifies its input string, by replacing
 * instances of "delim" with '\\0'. All resultant tokens are returned in the
 * "tokens" array which must have enough entries to hold "maxtokens".
 *
 * @param string
 *   The input string to be split into tokens
 *
 * @param stringlen
 *   The max length of the input buffer
 *
 * @param tokens
 *   The array to hold the pointers to the tokens in the string
 *
 * @param maxtokens
 *   The number of elements in the tokens array. At most, maxtokens-1 splits
 *   of the string will be done.
 *
 * @param delim
 *   The character on which the split of the data will be done
 *
 * @return
 *   The number of tokens in the tokens array.
 */
    pub fn rte_strsplit(string: *mut ::std::os::raw::c_char,
                        stringlen: ::std::os::raw::c_int,
                        tokens: *mut *mut ::std::os::raw::c_char,
                        maxtokens: ::std::os::raw::c_int,
                        delim: ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
#[repr(u32)]
/**
 * Timer type: Periodic or single (one-shot).
 */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_timer_type { SINGLE = 0, PERIODICAL = 1, }
/**
 * Timer status: A union of the state (stopped, pending, running,
 * config) and an owner (the id of the lcore that owns the timer).
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_timer_status {
    pub __bindgen_anon_1: __BindgenUnionField<rte_timer_status__bindgen_ty_1>,
    /**< To atomic-set status + owner. */
    pub u32: __BindgenUnionField<u32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_timer_status__bindgen_ty_1 {
    /**< Stop, pending, running, config. */
    pub state: u16,
    /**< The lcore that owns the timer. */
    pub owner: i16,
}
#[test]
fn bindgen_test_layout_rte_timer_status__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_timer_status__bindgen_ty_1>() ,
               4usize , concat ! (
               "Size of: " , stringify ! ( rte_timer_status__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<rte_timer_status__bindgen_ty_1>() ,
                2usize , concat ! (
                "Alignment of " , stringify ! ( rte_timer_status__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer_status__bindgen_ty_1 ) ) .
                state as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_timer_status__bindgen_ty_1 ) , "::" , stringify ! ( state
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer_status__bindgen_ty_1 ) ) .
                owner as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_timer_status__bindgen_ty_1 ) , "::" , stringify ! ( owner
                ) ));
}
impl Clone for rte_timer_status__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_timer_status() {
    assert_eq!(::std::mem::size_of::<rte_timer_status>() , 4usize , concat ! (
               "Size of: " , stringify ! ( rte_timer_status ) ));
    assert_eq! (::std::mem::align_of::<rte_timer_status>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( rte_timer_status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer_status ) ) . u32 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_timer_status ) ,
                "::" , stringify ! ( u32 ) ));
}
impl Clone for rte_timer_status {
    fn clone(&self) -> Self { *self }
}
/**
 * A structure describing a timer in RTE.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_timer {
    /**< Time when timer expire. */
    pub expire: u64,
    pub sl_next: [*mut rte_timer; 10usize],
    /**< Status of timer. */
    pub status: rte_timer_status,
    /**< Period of timer (0 if not periodic). */
    pub period: u64,
    /**< Callback function. */
    pub f: rte_timer_cb_t,
    /**< Argument to callback function. */
    pub arg: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_rte_timer() {
    assert_eq!(::std::mem::size_of::<rte_timer>() , 120usize , concat ! (
               "Size of: " , stringify ! ( rte_timer ) ));
    assert_eq! (::std::mem::align_of::<rte_timer>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_timer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer ) ) . expire as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_timer ) , "::" ,
                stringify ! ( expire ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer ) ) . sl_next as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_timer ) , "::" ,
                stringify ! ( sl_next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer ) ) . status as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_timer ) , "::" ,
                stringify ! ( status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer ) ) . period as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_timer ) , "::" ,
                stringify ! ( period ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer ) ) . f as * const _ as usize }
                , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_timer ) , "::" ,
                stringify ! ( f ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_timer ) ) . arg as * const _ as usize
                } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_timer ) , "::" ,
                stringify ! ( arg ) ));
}
impl Clone for rte_timer {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_timer {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * Callback function type for timer expiry.
 */
pub type rte_timer_cb_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut rte_timer,
                                               arg2:
                                                   *mut ::std::os::raw::c_void)>;
extern "C" {
    /**
 * Initialize the timer library.
 *
 * Initializes internal variables (list, locks and so on) for the RTE
 * timer library.
 */
    pub fn rte_timer_subsystem_init();
}
extern "C" {
    /**
 * Initialize a timer handle.
 *
 * The rte_timer_init() function initializes the timer handle *tim*
 * for use. No operations can be performed on a timer before it is
 * initialized.
 *
 * @param tim
 *   The timer to initialize.
 */
    pub fn rte_timer_init(tim: *mut rte_timer);
}
extern "C" {
    /**
 * Reset and start the timer associated with the timer handle.
 *
 * The rte_timer_reset() function resets and starts the timer
 * associated with the timer handle *tim*. When the timer expires after
 * *ticks* HPET cycles, the function specified by *fct* will be called
 * with the argument *arg* on core *tim_lcore*.
 *
 * If the timer associated with the timer handle is already running
 * (in the RUNNING state), the function will fail. The user has to check
 * the return value of the function to see if there is a chance that the
 * timer is in the RUNNING state.
 *
 * If the timer is being configured on another core (the CONFIG state),
 * it will also fail.
 *
 * If the timer is pending or stopped, it will be rescheduled with the
 * new parameters.
 *
 * @param tim
 *   The timer handle.
 * @param ticks
 *   The number of cycles (see rte_get_hpet_hz()) before the callback
 *   function is called.
 * @param type
 *   The type can be either:
 *   - PERIODICAL: The timer is automatically reloaded after execution
 *     (returns to the PENDING state)
 *   - SINGLE: The timer is one-shot, that is, the timer goes to a
 *     STOPPED state after execution.
 * @param tim_lcore
 *   The ID of the lcore where the timer callback function has to be
 *   executed. If tim_lcore is LCORE_ID_ANY, the timer library will
 *   launch it on a different core for each call (round-robin).
 * @param fct
 *   The callback function of the timer.
 * @param arg
 *   The user argument of the callback function.
 * @return
 *   - 0: Success; the timer is scheduled.
 *   - (-1): Timer is in the RUNNING or CONFIG state.
 */
    pub fn rte_timer_reset(tim: *mut rte_timer, ticks: u64,
                           type_: rte_timer_type,
                           tim_lcore: ::std::os::raw::c_uint,
                           fct: rte_timer_cb_t,
                           arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Loop until rte_timer_reset() succeeds.
 *
 * Reset and start the timer associated with the timer handle. Always
 * succeed. See rte_timer_reset() for details.
 *
 * @param tim
 *   The timer handle.
 * @param ticks
 *   The number of cycles (see rte_get_hpet_hz()) before the callback
 *   function is called.
 * @param type
 *   The type can be either:
 *   - PERIODICAL: The timer is automatically reloaded after execution
 *     (returns to the PENDING state)
 *   - SINGLE: The timer is one-shot, that is, the timer goes to a
 *     STOPPED state after execution.
 * @param tim_lcore
 *   The ID of the lcore where the timer callback function has to be
 *   executed. If tim_lcore is LCORE_ID_ANY, the timer library will
 *   launch it on a different core for each call (round-robin).
 * @param fct
 *   The callback function of the timer.
 * @param arg
 *   The user argument of the callback function.
 */
    pub fn rte_timer_reset_sync(tim: *mut rte_timer, ticks: u64,
                                type_: rte_timer_type,
                                tim_lcore: ::std::os::raw::c_uint,
                                fct: rte_timer_cb_t,
                                arg: *mut ::std::os::raw::c_void);
}
extern "C" {
    /**
 * Stop a timer.
 *
 * The rte_timer_stop() function stops the timer associated with the
 * timer handle *tim*. It may fail if the timer is currently running or
 * being configured.
 *
 * If the timer is pending or stopped (for instance, already expired),
 * the function will succeed. The timer handle tim must have been
 * initialized using rte_timer_init(), otherwise, undefined behavior
 * will occur.
 *
 * This function can be called safely from a timer callback. If it
 * succeeds, the timer is not referenced anymore by the timer library
 * and the timer structure can be freed (even in the callback
 * function).
 *
 * @param tim
 *   The timer handle.
 * @return
 *   - 0: Success; the timer is stopped.
 *   - (-1): The timer is in the RUNNING or CONFIG state.
 */
    pub fn rte_timer_stop(tim: *mut rte_timer) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Loop until rte_timer_stop() succeeds.
 *
 * After a call to this function, the timer identified by *tim* is
 * stopped. See rte_timer_stop() for details.
 *
 * @param tim
 *   The timer handle.
 */
    pub fn rte_timer_stop_sync(tim: *mut rte_timer);
}
extern "C" {
    /**
 * Test if a timer is pending.
 *
 * The rte_timer_pending() function tests the PENDING status
 * of the timer handle *tim*. A PENDING timer is one that has been
 * scheduled and whose function has not yet been called.
 *
 * @param tim
 *   The timer handle.
 * @return
 *   - 0: The timer is not pending.
 *   - 1: The timer is pending.
 */
    pub fn rte_timer_pending(tim: *mut rte_timer) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Manage the timer list and execute callback functions.
 *
 * This function must be called periodically from EAL lcores
 * main_loop(). It browses the list of pending timers and runs all
 * timers that are expired.
 *
 * The precision of the timer depends on the call frequency of this
 * function. However, the more often the function is called, the more
 * CPU resources it will use.
 */
    pub fn rte_timer_manage();
}
extern "C" {
    /**
 * Dump statistics about timers.
 *
 * @param f
 *   A pointer to a file for output
 */
    pub fn rte_timer_dump_stats(f: *mut FILE);
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_acl_field_types {
    pub u8: __BindgenUnionField<u8>,
    pub u16: __BindgenUnionField<u16>,
    pub u32: __BindgenUnionField<u32>,
    pub u64: __BindgenUnionField<u64>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_rte_acl_field_types() {
    assert_eq!(::std::mem::size_of::<rte_acl_field_types>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( rte_acl_field_types ) ));
    assert_eq! (::std::mem::align_of::<rte_acl_field_types>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_acl_field_types ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_types ) ) . u8 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_types ) ,
                "::" , stringify ! ( u8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_types ) ) . u16 as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_types ) ,
                "::" , stringify ! ( u16 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_types ) ) . u32 as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_types ) ,
                "::" , stringify ! ( u32 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_types ) ) . u64 as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_types ) ,
                "::" , stringify ! ( u64 ) ));
}
impl Clone for rte_acl_field_types {
    fn clone(&self) -> Self { *self }
}
pub const RTE_ACL_FIELD_TYPE_MASK: _bindgen_ty_14 =
    _bindgen_ty_14::RTE_ACL_FIELD_TYPE_MASK;
pub const RTE_ACL_FIELD_TYPE_RANGE: _bindgen_ty_14 =
    _bindgen_ty_14::RTE_ACL_FIELD_TYPE_RANGE;
pub const RTE_ACL_FIELD_TYPE_BITMASK: _bindgen_ty_14 =
    _bindgen_ty_14::RTE_ACL_FIELD_TYPE_BITMASK;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_14 {
    RTE_ACL_FIELD_TYPE_MASK = 0,
    RTE_ACL_FIELD_TYPE_RANGE = 1,
    RTE_ACL_FIELD_TYPE_BITMASK = 2,
}
/**
 * ACL Field definition.
 * Each field in the ACL rule has an associate definition.
 * It defines the type of field, its size, its offset in the input buffer,
 * the field index, and the input index.
 * For performance reasons, the inner loop of the search function is unrolled
 * to process four input bytes at a time. This requires the input to be grouped
 * into sets of 4 consecutive bytes. The loop processes the first input byte as
 * part of the setup and then subsequent bytes must be in groups of 4
 * consecutive bytes.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_acl_field_def {
    /**< type - RTE_ACL_FIELD_TYPE_*. */
    pub type_: u8,
    /**< size of field 1,2,4, or 8. */
    pub size: u8,
    /**< index of field inside the rule. */
    pub field_index: u8,
    /**< 0-N input index. */
    pub input_index: u8,
    /**< offset to start of field. */
    pub offset: u32,
}
#[test]
fn bindgen_test_layout_rte_acl_field_def() {
    assert_eq!(::std::mem::size_of::<rte_acl_field_def>() , 8usize , concat !
               ( "Size of: " , stringify ! ( rte_acl_field_def ) ));
    assert_eq! (::std::mem::align_of::<rte_acl_field_def>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( rte_acl_field_def ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_def ) ) . type_ as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_def ) ,
                "::" , stringify ! ( type_ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_def ) ) . size as * const _
                as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_def ) ,
                "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_def ) ) . field_index as *
                const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_def ) ,
                "::" , stringify ! ( field_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_def ) ) . input_index as *
                const _ as usize } , 3usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_def ) ,
                "::" , stringify ! ( input_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field_def ) ) . offset as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field_def ) ,
                "::" , stringify ! ( offset ) ));
}
impl Clone for rte_acl_field_def {
    fn clone(&self) -> Self { *self }
}
/**
 * ACL build configuration.
 * Defines the fields of an ACL trie and number of categories to build with.
 */
#[repr(C)]
pub struct rte_acl_config {
    /**< Number of categories to build with. */
    pub num_categories: u32,
    /**< Number of field definitions. */
    pub num_fields: u32,
    pub defs: [rte_acl_field_def; 64usize],
    pub max_size: usize,
}
#[test]
fn bindgen_test_layout_rte_acl_config() {
    assert_eq!(::std::mem::size_of::<rte_acl_config>() , 528usize , concat ! (
               "Size of: " , stringify ! ( rte_acl_config ) ));
    assert_eq! (::std::mem::align_of::<rte_acl_config>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_acl_config ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_config ) ) . num_categories as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_config ) , "::"
                , stringify ! ( num_categories ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_config ) ) . num_fields as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_config ) , "::"
                , stringify ! ( num_fields ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_config ) ) . defs as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_config ) , "::"
                , stringify ! ( defs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_config ) ) . max_size as * const
                _ as usize } , 520usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_config ) , "::"
                , stringify ! ( max_size ) ));
}
impl Default for rte_acl_config {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * Defines the value of a field for a rule.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_acl_field {
    pub value: rte_acl_field_types,
    pub mask_range: rte_acl_field_types,
}
#[test]
fn bindgen_test_layout_rte_acl_field() {
    assert_eq!(::std::mem::size_of::<rte_acl_field>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rte_acl_field ) ));
    assert_eq! (::std::mem::align_of::<rte_acl_field>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_acl_field ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field ) ) . value as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field ) , "::"
                , stringify ! ( value ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_field ) ) . mask_range as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_field ) , "::"
                , stringify ! ( mask_range ) ));
}
impl Clone for rte_acl_field {
    fn clone(&self) -> Self { *self }
}
pub const RTE_ACL_TYPE_SHIFT: _bindgen_ty_15 =
    _bindgen_ty_15::RTE_ACL_TYPE_SHIFT;
pub const RTE_ACL_MAX_INDEX: _bindgen_ty_15 =
    _bindgen_ty_15::RTE_ACL_MAX_INDEX;
pub const RTE_ACL_MAX_PRIORITY: _bindgen_ty_15 =
    _bindgen_ty_15::RTE_ACL_MAX_INDEX;
pub const RTE_ACL_MIN_PRIORITY: _bindgen_ty_15 =
    _bindgen_ty_15::RTE_ACL_MIN_PRIORITY;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_15 {
    RTE_ACL_TYPE_SHIFT = 29,
    RTE_ACL_MAX_INDEX = 536870911,
    RTE_ACL_MIN_PRIORITY = 0,
}
/**
 * Miscellaneous data for ACL rule.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_acl_rule_data {
    /**< Mask of categories for that rule. */
    pub category_mask: u32,
    /**< Priority for that rule. */
    pub priority: i32,
    /**< Associated with the rule user data. */
    pub userdata: u32,
}
#[test]
fn bindgen_test_layout_rte_acl_rule_data() {
    assert_eq!(::std::mem::size_of::<rte_acl_rule_data>() , 12usize , concat !
               ( "Size of: " , stringify ! ( rte_acl_rule_data ) ));
    assert_eq! (::std::mem::align_of::<rte_acl_rule_data>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( rte_acl_rule_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_rule_data ) ) . category_mask as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_rule_data ) ,
                "::" , stringify ! ( category_mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_rule_data ) ) . priority as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_rule_data ) ,
                "::" , stringify ! ( priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_rule_data ) ) . userdata as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_rule_data ) ,
                "::" , stringify ! ( userdata ) ));
}
impl Clone for rte_acl_rule_data {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_acl_rule {
    pub data: rte_acl_rule_data,
    pub field: __IncompleteArrayField<rte_acl_field>,
    pub __bindgen_align: [u64; 0usize],
}
#[test]
fn bindgen_test_layout_rte_acl_rule() {
    assert_eq!(::std::mem::size_of::<rte_acl_rule>() , 16usize , concat ! (
               "Size of: " , stringify ! ( rte_acl_rule ) ));
    assert_eq! (::std::mem::align_of::<rte_acl_rule>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_acl_rule ) ));
}
impl Clone for rte_acl_rule {
    fn clone(&self) -> Self { *self }
}
/**
 * Parameters used when creating the ACL context.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_acl_param {
    /**< Name of the ACL context. */
    pub name: *const ::std::os::raw::c_char,
    /**< Socket ID to allocate memory for. */
    pub socket_id: ::std::os::raw::c_int,
    /**< Size of each rule. */
    pub rule_size: u32,
    /**< Maximum number of rules. */
    pub max_rule_num: u32,
}
#[test]
fn bindgen_test_layout_rte_acl_param() {
    assert_eq!(::std::mem::size_of::<rte_acl_param>() , 24usize , concat ! (
               "Size of: " , stringify ! ( rte_acl_param ) ));
    assert_eq! (::std::mem::align_of::<rte_acl_param>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( rte_acl_param ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_param ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_param ) , "::"
                , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_param ) ) . socket_id as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_param ) , "::"
                , stringify ! ( socket_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_param ) ) . rule_size as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_param ) , "::"
                , stringify ! ( rule_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_acl_param ) ) . max_rule_num as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_acl_param ) , "::"
                , stringify ! ( max_rule_num ) ));
}
impl Clone for rte_acl_param {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_acl_param {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_acl_ctx([u8; 0]);
extern "C" {
    /**
 * Create a new ACL context.
 *
 * @param param
 *   Parameters used to create and initialise the ACL context.
 * @return
 *   Pointer to ACL context structure that is used in future ACL
 *   operations, or NULL on error, with error code set in rte_errno.
 *   Possible rte_errno errors include:
 *   - EINVAL - invalid parameter passed to function
 */
    pub fn rte_acl_create(param: *const rte_acl_param) -> *mut rte_acl_ctx;
}
extern "C" {
    /**
 * Find an existing ACL context object and return a pointer to it.
 *
 * @param name
 *   Name of the ACL context as passed to rte_acl_create()
 * @return
 *   Pointer to ACL context or NULL if object not found
 *   with rte_errno set appropriately. Possible rte_errno values include:
 *    - ENOENT - value not available for return
 */
    pub fn rte_acl_find_existing(name: *const ::std::os::raw::c_char)
     -> *mut rte_acl_ctx;
}
extern "C" {
    /**
 * De-allocate all memory used by ACL context.
 *
 * @param ctx
 *   ACL context to free
 */
    pub fn rte_acl_free(ctx: *mut rte_acl_ctx);
}
extern "C" {
    /**
 * Add rules to an existing ACL context.
 * This function is not multi-thread safe.
 *
 * @param ctx
 *   ACL context to add patterns to.
 * @param rules
 *   Array of rules to add to the ACL context.
 *   Note that all fields in rte_acl_rule structures are expected
 *   to be in host byte order.
 *   Each rule expected to be in the same format and not exceed size
 *   specified at ACL context creation time.
 * @param num
 *   Number of elements in the input array of rules.
 * @return
 *   - -ENOMEM if there is no space in the ACL context for these rules.
 *   - -EINVAL if the parameters are invalid.
 *   - Zero if operation completed successfully.
 */
    pub fn rte_acl_add_rules(ctx: *mut rte_acl_ctx,
                             rules: *const rte_acl_rule, num: u32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Delete all rules from the ACL context.
 * This function is not multi-thread safe.
 * Note that internal run-time structures are not affected.
 *
 * @param ctx
 *   ACL context to delete rules from.
 */
    pub fn rte_acl_reset_rules(ctx: *mut rte_acl_ctx);
}
extern "C" {
    /**
 * Analyze set of rules and build required internal run-time structures.
 * This function is not multi-thread safe.
 *
 * @param ctx
 *   ACL context to build.
 * @param cfg
 *   Pointer to struct rte_acl_config - defines build parameters.
 * @return
 *   - -ENOMEM if couldn't allocate enough memory.
 *   - -EINVAL if the parameters are invalid.
 *   - Negative error code if operation failed.
 *   - Zero if operation completed successfully.
 */
    pub fn rte_acl_build(ctx: *mut rte_acl_ctx, cfg: *const rte_acl_config)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Delete all rules from the ACL context and
 * destroy all internal run-time structures.
 * This function is not multi-thread safe.
 *
 * @param ctx
 *   ACL context to reset.
 */
    pub fn rte_acl_reset(ctx: *mut rte_acl_ctx);
}
#[repr(u32)]
/**
 *  Available implementations of ACL classify.
 */
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_acl_classify_alg {
    RTE_ACL_CLASSIFY_DEFAULT = 0,
    RTE_ACL_CLASSIFY_SCALAR = 1,
    RTE_ACL_CLASSIFY_SSE = 2,
    RTE_ACL_CLASSIFY_AVX2 = 3,
    RTE_ACL_CLASSIFY_NEON = 4,
    RTE_ACL_CLASSIFY_ALTIVEC = 5,
    RTE_ACL_CLASSIFY_NUM = 6,
}
extern "C" {
    /**
 * Perform search for a matching ACL rule for each input data buffer.
 * Each input data buffer can have up to *categories* matches.
 * That implies that results array should be big enough to hold
 * (categories * num) elements.
 * Also categories parameter should be either one or multiple of
 * RTE_ACL_RESULTS_MULTIPLIER and can't be bigger than RTE_ACL_MAX_CATEGORIES.
 * If more than one rule is applicable for given input buffer and
 * given category, then rule with highest priority will be returned as a match.
 * Note, that it is a caller's responsibility to ensure that input parameters
 * are valid and point to correct memory locations.
 *
 * @param ctx
 *   ACL context to search with.
 * @param data
 *   Array of pointers to input data buffers to perform search.
 *   Note that all fields in input data buffers supposed to be in network
 *   byte order (MSB).
 * @param results
 *   Array of search results, *categories* results per each input data buffer.
 * @param num
 *   Number of elements in the input data buffers array.
 * @param categories
 *   Number of maximum possible matches for each input buffer, one possible
 *   match per category.
 * @return
 *   zero on successful completion.
 *   -EINVAL for incorrect arguments.
 */
    pub fn rte_acl_classify(ctx: *const rte_acl_ctx, data: *mut *const u8,
                            results: *mut u32, num: u32, categories: u32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Perform search using specified algorithm for a matching ACL rule for
 * each input data buffer.
 * Each input data buffer can have up to *categories* matches.
 * That implies that results array should be big enough to hold
 * (categories * num) elements.
 * Also categories parameter should be either one or multiple of
 * RTE_ACL_RESULTS_MULTIPLIER and can't be bigger than RTE_ACL_MAX_CATEGORIES.
 * If more than one rule is applicable for given input buffer and
 * given category, then rule with highest priority will be returned as a match.
 * Note, that it is a caller's responsibility to ensure that input parameters
 * are valid and point to correct memory locations.
 *
 * @param ctx
 *   ACL context to search with.
 * @param data
 *   Array of pointers to input data buffers to perform search.
 *   Note that all fields in input data buffers supposed to be in network
 *   byte order (MSB).
 * @param results
 *   Array of search results, *categories* results per each input data buffer.
 * @param num
 *   Number of elements in the input data buffers array.
 * @param categories
 *   Number of maximum possible matches for each input buffer, one possible
 *   match per category.
 * @param alg
 *   Algorithm to be used for the search.
 *   It is the caller responsibility to ensure that the value refers to the
 *   existing algorithm, and that it could be run on the given CPU.
 * @return
 *   zero on successful completion.
 *   -EINVAL for incorrect arguments.
 */
    pub fn rte_acl_classify_alg(ctx: *const rte_acl_ctx, data: *mut *const u8,
                                results: *mut u32, num: u32, categories: u32,
                                alg: rte_acl_classify_alg)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rte_acl_set_ctx_classify(ctx: *mut rte_acl_ctx,
                                    alg: rte_acl_classify_alg)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Dump an ACL context structure to the console.
 *
 * @param ctx
 *   ACL context to dump.
 */
    pub fn rte_acl_dump(ctx: *const rte_acl_ctx);
}
extern "C" {
    /**
 * Dump all ACL context structures to the console.
 */
    pub fn rte_acl_list_dump();
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum rte_ring_queue_behavior {
    RTE_RING_QUEUE_FIXED = 0,
    RTE_RING_QUEUE_VARIABLE = 1,
}
/**
 * An RTE ring structure.
 *
 * The producer and the consumer have a head and a tail index. The particularity
 * of these index is that they are not between 0 and size(ring). These indexes
 * are between 0 and 2^32, and we mask their value when we access the ring[]
 * field. Thanks to this assumption, we can do subtractions between 2 index
 * values in a modulo-32bit base: that's why the overflow of the indexes is not
 * a problem.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_ring {
    /**< Name of the ring. */
    pub name: [::std::os::raw::c_char; 32usize],
    /**< Flags supplied at creation. */
    pub flags: ::std::os::raw::c_int,
    pub memzone: *const rte_memzone,
    pub prod: rte_ring_prod,
    pub cons: rte_ring_cons,
    /**< Memory space of ring starts here.
	                                     * not volatile so need to be careful
	                                     * about compiler re-ordering */
    pub ring: __IncompleteArrayField<*mut ::std::os::raw::c_void>,
    pub __bindgen_padding_0: [u32; 9usize],
}
/** Ring producer status. */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_ring_prod {
    /**< Maximum items before EDQUOT. */
    pub watermark: u32,
    /**< True, if single producer. */
    pub sp_enqueue: u32,
    /**< Size of ring. */
    pub size: u32,
    /**< Mask (size-1) of ring. */
    pub mask: u32,
    /**< Producer head. */
    pub head: u32,
    /**< Producer tail. */
    pub tail: u32,
}
#[test]
fn bindgen_test_layout_rte_ring_prod() {
    assert_eq!(::std::mem::size_of::<rte_ring_prod>() , 24usize , concat ! (
               "Size of: " , stringify ! ( rte_ring_prod ) ));
    assert_eq! (::std::mem::align_of::<rte_ring_prod>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rte_ring_prod ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_prod ) ) . watermark as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_prod ) , "::"
                , stringify ! ( watermark ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_prod ) ) . sp_enqueue as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_prod ) , "::"
                , stringify ! ( sp_enqueue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_prod ) ) . size as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_prod ) , "::"
                , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_prod ) ) . mask as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_prod ) , "::"
                , stringify ! ( mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_prod ) ) . head as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_prod ) , "::"
                , stringify ! ( head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_prod ) ) . tail as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_prod ) , "::"
                , stringify ! ( tail ) ));
}
impl Clone for rte_ring_prod {
    fn clone(&self) -> Self { *self }
}
/** Ring consumer status. */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_ring_cons {
    /**< True, if single consumer. */
    pub sc_dequeue: u32,
    /**< Size of the ring. */
    pub size: u32,
    /**< Mask (size-1) of ring. */
    pub mask: u32,
    /**< Consumer head. */
    pub head: u32,
    /**< Consumer tail. */
    pub tail: u32,
}
#[test]
fn bindgen_test_layout_rte_ring_cons() {
    assert_eq!(::std::mem::size_of::<rte_ring_cons>() , 20usize , concat ! (
               "Size of: " , stringify ! ( rte_ring_cons ) ));
    assert_eq! (::std::mem::align_of::<rte_ring_cons>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( rte_ring_cons ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_cons ) ) . sc_dequeue as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_cons ) , "::"
                , stringify ! ( sc_dequeue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_cons ) ) . size as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_cons ) , "::"
                , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_cons ) ) . mask as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_cons ) , "::"
                , stringify ! ( mask ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_cons ) ) . head as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_cons ) , "::"
                , stringify ! ( head ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_ring_cons ) ) . tail as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_ring_cons ) , "::"
                , stringify ! ( tail ) ));
}
impl Clone for rte_ring_cons {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_ring() {
    assert_eq!(::std::mem::size_of::<rte_ring>() , 128usize , concat ! (
               "Size of: " , stringify ! ( rte_ring ) ));
}
impl Clone for rte_ring {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_ring {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * Calculate the memory size needed for a ring
 *
 * This function returns the number of bytes needed for a ring, given
 * the number of elements in it. This value is the sum of the size of
 * the structure rte_ring and the size of the memory needed by the
 * objects pointers. The value is aligned to a cache line size.
 *
 * @param count
 *   The number of elements in the ring (must be a power of 2).
 * @return
 *   - The memory size needed for the ring on success.
 *   - -EINVAL if count is not a power of 2.
 */
    pub fn rte_ring_get_memsize(count: ::std::os::raw::c_uint) -> isize;
}
extern "C" {
    /**
 * Initialize a ring structure.
 *
 * Initialize a ring structure in memory pointed by "r". The size of the
 * memory area must be large enough to store the ring structure and the
 * object table. It is advised to use rte_ring_get_memsize() to get the
 * appropriate size.
 *
 * The ring size is set to *count*, which must be a power of two. Water
 * marking is disabled by default. The real usable ring size is
 * *count-1* instead of *count* to differentiate a free ring from an
 * empty ring.
 *
 * The ring is not added in RTE_TAILQ_RING global list. Indeed, the
 * memory given by the caller may not be shareable among dpdk
 * processes.
 *
 * @param r
 *   The pointer to the ring structure followed by the objects table.
 * @param name
 *   The name of the ring.
 * @param count
 *   The number of elements in the ring (must be a power of 2).
 * @param flags
 *   An OR of the following:
 *    - RING_F_SP_ENQ: If this flag is set, the default behavior when
 *      using ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``
 *      is "single-producer". Otherwise, it is "multi-producers".
 *    - RING_F_SC_DEQ: If this flag is set, the default behavior when
 *      using ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``
 *      is "single-consumer". Otherwise, it is "multi-consumers".
 * @return
 *   0 on success, or a negative value on error.
 */
    pub fn rte_ring_init(r: *mut rte_ring,
                         name: *const ::std::os::raw::c_char,
                         count: ::std::os::raw::c_uint,
                         flags: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Create a new ring named *name* in memory.
 *
 * This function uses ``memzone_reserve()`` to allocate memory. Then it
 * calls rte_ring_init() to initialize an empty ring.
 *
 * The new ring size is set to *count*, which must be a power of
 * two. Water marking is disabled by default. The real usable ring size
 * is *count-1* instead of *count* to differentiate a free ring from an
 * empty ring.
 *
 * The ring is added in RTE_TAILQ_RING list.
 *
 * @param name
 *   The name of the ring.
 * @param count
 *   The size of the ring (must be a power of 2).
 * @param socket_id
 *   The *socket_id* argument is the socket identifier in case of
 *   NUMA. The value can be *SOCKET_ID_ANY* if there is no NUMA
 *   constraint for the reserved zone.
 * @param flags
 *   An OR of the following:
 *    - RING_F_SP_ENQ: If this flag is set, the default behavior when
 *      using ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``
 *      is "single-producer". Otherwise, it is "multi-producers".
 *    - RING_F_SC_DEQ: If this flag is set, the default behavior when
 *      using ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``
 *      is "single-consumer". Otherwise, it is "multi-consumers".
 * @return
 *   On success, the pointer to the new allocated ring. NULL on error with
 *    rte_errno set appropriately. Possible errno values include:
 *    - E_RTE_NO_CONFIG - function could not get pointer to rte_config structure
 *    - E_RTE_SECONDARY - function was called from a secondary process instance
 *    - EINVAL - count provided is not a power of 2
 *    - ENOSPC - the maximum number of memzones has already been allocated
 *    - EEXIST - a memzone with the same name already exists
 *    - ENOMEM - no appropriate memory area found in which to create memzone
 */
    pub fn rte_ring_create(name: *const ::std::os::raw::c_char,
                           count: ::std::os::raw::c_uint,
                           socket_id: ::std::os::raw::c_int,
                           flags: ::std::os::raw::c_uint) -> *mut rte_ring;
}
extern "C" {
    /**
 * De-allocate all memory used by the ring.
 *
 * @param r
 *   Ring to free
 */
    pub fn rte_ring_free(r: *mut rte_ring);
}
extern "C" {
    /**
 * Change the high water mark.
 *
 * If *count* is 0, water marking is disabled. Otherwise, it is set to the
 * *count* value. The *count* value must be greater than 0 and less
 * than the ring size.
 *
 * This function can be called at any time (not necessarily at
 * initialization).
 *
 * @param r
 *   A pointer to the ring structure.
 * @param count
 *   The new water mark value.
 * @return
 *   - 0: Success; water mark changed.
 *   - -EINVAL: Invalid water mark value.
 */
    pub fn rte_ring_set_water_mark(r: *mut rte_ring,
                                   count: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Dump the status of the ring to a file.
 *
 * @param f
 *   A pointer to a file for output
 * @param r
 *   A pointer to the ring structure.
 */
    pub fn rte_ring_dump(f: *mut FILE, r: *const rte_ring);
}
extern "C" {
    /**
 * Dump the status of all rings on the console
 *
 * @param f
 *   A pointer to a file for output
 */
    pub fn rte_ring_list_dump(f: *mut FILE);
}
extern "C" {
    /**
 * Search a ring from its name
 *
 * @param name
 *   The name of the ring.
 * @return
 *   The pointer to the ring matching the name, or NULL if not found,
 *   with rte_errno set appropriately. Possible rte_errno values include:
 *    - ENOENT - required entry not available to return.
 */
    pub fn rte_ring_lookup(name: *const ::std::os::raw::c_char)
     -> *mut rte_ring;
}
/**
 * A structure that stores a per-core object cache.
 */
#[repr(C)]
pub struct rte_mempool_cache {
    /**< Size of the cache */
    pub size: u32,
    /**< Threshold before we flush excess elements */
    pub flushthresh: u32,
    /**< Current cache count */
    pub len: u32,
    /**< Cache objects */
    pub objs: [*mut ::std::os::raw::c_void; 1536usize],
    pub __bindgen_padding_0: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_rte_mempool_cache() {
    assert_eq!(::std::mem::size_of::<rte_mempool_cache>() , 12352usize ,
               concat ! ( "Size of: " , stringify ! ( rte_mempool_cache ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_cache ) ) . size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_cache ) ,
                "::" , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_cache ) ) . flushthresh as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_cache ) ,
                "::" , stringify ! ( flushthresh ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_cache ) ) . len as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_cache ) ,
                "::" , stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_cache ) ) . objs as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_cache ) ,
                "::" , stringify ! ( objs ) ));
}
impl Default for rte_mempool_cache {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * A structure that stores the size of mempool elements.
 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mempool_objsz {
    /**< Size of an element. */
    pub elt_size: u32,
    /**< Size of header (before elt). */
    pub header_size: u32,
    /**< Size of trailer (after elt). */
    pub trailer_size: u32,
    pub total_size: u32,
}
#[test]
fn bindgen_test_layout_rte_mempool_objsz() {
    assert_eq!(::std::mem::size_of::<rte_mempool_objsz>() , 16usize , concat !
               ( "Size of: " , stringify ! ( rte_mempool_objsz ) ));
    assert_eq! (::std::mem::align_of::<rte_mempool_objsz>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( rte_mempool_objsz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objsz ) ) . elt_size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objsz ) ,
                "::" , stringify ! ( elt_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objsz ) ) . header_size as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objsz ) ,
                "::" , stringify ! ( header_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objsz ) ) . trailer_size as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objsz ) ,
                "::" , stringify ! ( trailer_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objsz ) ) . total_size as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objsz ) ,
                "::" , stringify ! ( total_size ) ));
}
impl Clone for rte_mempool_objsz {
    fn clone(&self) -> Self { *self }
}
/**
 * Mempool object header structure
 *
 * Each object stored in mempools are prefixed by this header structure,
 * it allows to retrieve the mempool pointer from the object and to
 * iterate on all objects attached to a mempool. When debug is enabled,
 * a cookie is also added in this structure preventing corruptions and
 * double-frees.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool_objhdr {
    /**< Next in list. */
    pub next: rte_mempool_objhdr__bindgen_ty_1,
    /**< The mempool owning the object. */
    pub mp: *mut rte_mempool,
    /**< Physical address of the object. */
    pub physaddr: phys_addr_t,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool_objhdr__bindgen_ty_1 {
    pub stqe_next: *mut rte_mempool_objhdr,
}
#[test]
fn bindgen_test_layout_rte_mempool_objhdr__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_mempool_objhdr__bindgen_ty_1>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( rte_mempool_objhdr__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<rte_mempool_objhdr__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                rte_mempool_objhdr__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objhdr__bindgen_ty_1 ) ) .
                stqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_mempool_objhdr__bindgen_ty_1 ) , "::" , stringify ! (
                stqe_next ) ));
}
impl Clone for rte_mempool_objhdr__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool_objhdr__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rte_mempool_objhdr() {
    assert_eq!(::std::mem::size_of::<rte_mempool_objhdr>() , 24usize , concat
               ! ( "Size of: " , stringify ! ( rte_mempool_objhdr ) ));
    assert_eq! (::std::mem::align_of::<rte_mempool_objhdr>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( rte_mempool_objhdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objhdr ) ) . next as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objhdr ) ,
                "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objhdr ) ) . mp as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objhdr ) ,
                "::" , stringify ! ( mp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objhdr ) ) . physaddr as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objhdr ) ,
                "::" , stringify ! ( physaddr ) ));
}
impl Clone for rte_mempool_objhdr {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool_objhdr {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * A list of object headers type
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool_objhdr_list {
    pub stqh_first: *mut rte_mempool_objhdr,
    pub stqh_last: *mut *mut rte_mempool_objhdr,
}
#[test]
fn bindgen_test_layout_rte_mempool_objhdr_list() {
    assert_eq!(::std::mem::size_of::<rte_mempool_objhdr_list>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_mempool_objhdr_list ) ));
    assert_eq! (::std::mem::align_of::<rte_mempool_objhdr_list>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_mempool_objhdr_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objhdr_list ) ) . stqh_first
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objhdr_list
                ) , "::" , stringify ! ( stqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_objhdr_list ) ) . stqh_last
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_objhdr_list
                ) , "::" , stringify ! ( stqh_last ) ));
}
impl Clone for rte_mempool_objhdr_list {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool_objhdr_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * A list of memory where objects are stored
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool_memhdr_list {
    pub stqh_first: *mut rte_mempool_memhdr,
    pub stqh_last: *mut *mut rte_mempool_memhdr,
}
#[test]
fn bindgen_test_layout_rte_mempool_memhdr_list() {
    assert_eq!(::std::mem::size_of::<rte_mempool_memhdr_list>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_mempool_memhdr_list ) ));
    assert_eq! (::std::mem::align_of::<rte_mempool_memhdr_list>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_mempool_memhdr_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr_list ) ) . stqh_first
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr_list
                ) , "::" , stringify ! ( stqh_first ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr_list ) ) . stqh_last
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr_list
                ) , "::" , stringify ! ( stqh_last ) ));
}
impl Clone for rte_mempool_memhdr_list {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool_memhdr_list {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * Callback used to free a memory chunk
 */
pub type rte_mempool_memchunk_free_cb_t =
    ::std::option::Option<unsafe extern "C" fn(memhdr:
                                                   *mut rte_mempool_memhdr,
                                               opaque:
                                                   *mut ::std::os::raw::c_void)>;
/**
 * Mempool objects memory header structure
 *
 * The memory chunks where objects are stored. Each chunk is virtually
 * and physically contiguous.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool_memhdr {
    /**< Next in list. */
    pub next: rte_mempool_memhdr__bindgen_ty_1,
    /**< The mempool owning the chunk */
    pub mp: *mut rte_mempool,
    /**< Virtual address of the chunk */
    pub addr: *mut ::std::os::raw::c_void,
    /**< Physical address of the chunk */
    pub phys_addr: phys_addr_t,
    /**< length of the chunk */
    pub len: usize,
    /**< Free callback */
    pub free_cb: rte_mempool_memchunk_free_cb_t,
    /**< Argument passed to the free callback */
    pub opaque: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool_memhdr__bindgen_ty_1 {
    pub stqe_next: *mut rte_mempool_memhdr,
}
#[test]
fn bindgen_test_layout_rte_mempool_memhdr__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_mempool_memhdr__bindgen_ty_1>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( rte_mempool_memhdr__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<rte_mempool_memhdr__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                rte_mempool_memhdr__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr__bindgen_ty_1 ) ) .
                stqe_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_mempool_memhdr__bindgen_ty_1 ) , "::" , stringify ! (
                stqe_next ) ));
}
impl Clone for rte_mempool_memhdr__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool_memhdr__bindgen_ty_1 {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[test]
fn bindgen_test_layout_rte_mempool_memhdr() {
    assert_eq!(::std::mem::size_of::<rte_mempool_memhdr>() , 56usize , concat
               ! ( "Size of: " , stringify ! ( rte_mempool_memhdr ) ));
    assert_eq! (::std::mem::align_of::<rte_mempool_memhdr>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( rte_mempool_memhdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr ) ) . next as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr ) ,
                "::" , stringify ! ( next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr ) ) . mp as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr ) ,
                "::" , stringify ! ( mp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr ) ) . addr as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr ) ,
                "::" , stringify ! ( addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr ) ) . phys_addr as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr ) ,
                "::" , stringify ! ( phys_addr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr ) ) . len as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr ) ,
                "::" , stringify ! ( len ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr ) ) . free_cb as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr ) ,
                "::" , stringify ! ( free_cb ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_memhdr ) ) . opaque as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_memhdr ) ,
                "::" , stringify ! ( opaque ) ));
}
impl Clone for rte_mempool_memhdr {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool_memhdr {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * The RTE mempool structure.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool {
    /**< Name of mempool. */
    pub name: [::std::os::raw::c_char; 32usize],
    pub __bindgen_anon_1: rte_mempool__bindgen_ty_1,
    /**< optional args for ops alloc. */
    pub pool_config: *mut ::std::os::raw::c_void,
    /**< Memzone where pool is alloc'd. */
    pub mz: *const rte_memzone,
    /**< Flags of the mempool. */
    pub flags: ::std::os::raw::c_int,
    /**< Socket id passed at create. */
    pub socket_id: ::std::os::raw::c_int,
    /**< Max size of the mempool. */
    pub size: u32,
    pub cache_size: u32,
    /**< Size of an element. */
    pub elt_size: u32,
    /**< Size of header (before elt). */
    pub header_size: u32,
    /**< Size of trailer (after elt). */
    pub trailer_size: u32,
    /**< Size of private data. */
    pub private_data_size: ::std::os::raw::c_uint,
    /**
	 * Index into rte_mempool_ops_table array of mempool ops
	 * structs, which contain callback function pointers.
	 * We're using an index here rather than pointers to the callbacks
	 * to facilitate any secondary processes that may want to use
	 * this mempool.
	 */
    pub ops_index: i32,
    /**< Per-lcore local cache */
    pub local_cache: *mut rte_mempool_cache,
    /**< Number of populated objects. */
    pub populated_size: u32,
    /**< List of objects in pool */
    pub elt_list: rte_mempool_objhdr_list,
    /**< Number of memory chunks */
    pub nb_mem_chunks: u32,
    /**< List of memory chunks */
    pub mem_list: rte_mempool_memhdr_list,
    pub __bindgen_padding_0: [u64; 5usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mempool__bindgen_ty_1 {
    /**< Ring or pool to store objects. */
    pub pool_data: __BindgenUnionField<*mut ::std::os::raw::c_void>,
    /**< External mempool identifier. */
    pub pool_id: __BindgenUnionField<u64>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_rte_mempool__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_mempool__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( rte_mempool__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_mempool__bindgen_ty_1>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_mempool__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool__bindgen_ty_1 ) ) . pool_data
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_mempool__bindgen_ty_1 ) , "::" , stringify ! ( pool_data )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool__bindgen_ty_1 ) ) . pool_id
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_mempool__bindgen_ty_1 ) , "::" , stringify ! ( pool_id )
                ));
}
impl Clone for rte_mempool__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_mempool() {
    assert_eq!(::std::mem::size_of::<rte_mempool>() , 192usize , concat ! (
               "Size of: " , stringify ! ( rte_mempool ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . pool_config as * const
                _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( pool_config ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . mz as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( mz ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . flags as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . socket_id as * const _
                as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( socket_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . size as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . cache_size as * const _
                as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( cache_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . elt_size as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( elt_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . header_size as * const
                _ as usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( header_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . trailer_size as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( trailer_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . private_data_size as *
                const _ as usize } , 84usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( private_data_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . ops_index as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( ops_index ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . local_cache as * const
                _ as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( local_cache ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . populated_size as *
                const _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( populated_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . elt_list as * const _
                as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( elt_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . nb_mem_chunks as *
                const _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( nb_mem_chunks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool ) ) . mem_list as * const _
                as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool ) , "::" ,
                stringify ! ( mem_list ) ));
}
impl Clone for rte_mempool {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_mempool_objtlr([u8; 0]);
extern "C" {
    /**
 * @internal Check and update cookies or panic.
 *
 * @param mp
 *   Pointer to the memory pool.
 * @param obj_table_const
 *   Pointer to a table of void * pointers (objects).
 * @param n
 *   Index of object in object table.
 * @param free
 *   - 0: object is supposed to be allocated, mark it as free
 *   - 1: object is supposed to be free, mark it as allocated
 *   - 2: just check that cookie is valid (free or allocated)
 */
    pub fn rte_mempool_check_cookies(mp: *const rte_mempool,
                                     obj_table_const:
                                         *const *const ::std::os::raw::c_void,
                                     n: ::std::os::raw::c_uint,
                                     free: ::std::os::raw::c_int);
}
/**
 * Prototype for implementation specific data provisioning function.
 *
 * The function should provide the implementation specific memory for
 * for use by the other mempool ops functions in a given mempool ops struct.
 * E.g. the default ops provides an instance of the rte_ring for this purpose.
 * it will most likely point to a different type of data structure, and
 * will be transparent to the application programmer.
 * This function should set mp->pool_data.
 */
pub type rte_mempool_alloc_t =
    ::std::option::Option<unsafe extern "C" fn(mp: *mut rte_mempool)
                              -> ::std::os::raw::c_int>;
/**
 * Free the opaque private data pointed to by mp->pool_data pointer.
 */
pub type rte_mempool_free_t =
    ::std::option::Option<unsafe extern "C" fn(mp: *mut rte_mempool)>;
/**
 * Enqueue an object into the external pool.
 */
pub type rte_mempool_enqueue_t =
    ::std::option::Option<unsafe extern "C" fn(mp: *mut rte_mempool,
                                               obj_table:
                                                   *const *const ::std::os::raw::c_void,
                                               n: ::std::os::raw::c_uint)
                              -> ::std::os::raw::c_int>;
/**
 * Dequeue an object from the external pool.
 */
pub type rte_mempool_dequeue_t =
    ::std::option::Option<unsafe extern "C" fn(mp: *mut rte_mempool,
                                               obj_table:
                                                   *mut *mut ::std::os::raw::c_void,
                                               n: ::std::os::raw::c_uint)
                              -> ::std::os::raw::c_int>;
/**
 * Return the number of available objects in the external pool.
 */
pub type rte_mempool_get_count =
    ::std::option::Option<unsafe extern "C" fn(mp: *const rte_mempool)
                              -> ::std::os::raw::c_uint>;
/** Structure defining mempool operations structure */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool_ops {
    /**< Name of mempool ops struct. */
    pub name: [::std::os::raw::c_char; 32usize],
    /**< Allocate private data. */
    pub alloc: rte_mempool_alloc_t,
    /**< Free the external pool. */
    pub free: rte_mempool_free_t,
    /**< Enqueue an object. */
    pub enqueue: rte_mempool_enqueue_t,
    /**< Dequeue an object. */
    pub dequeue: rte_mempool_dequeue_t,
    /**< Get qty of available objs. */
    pub get_count: rte_mempool_get_count,
    pub __bindgen_padding_0: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_rte_mempool_ops() {
    assert_eq!(::std::mem::size_of::<rte_mempool_ops>() , 128usize , concat !
               ( "Size of: " , stringify ! ( rte_mempool_ops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops ) ) . name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops ) ) . alloc as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops ) ,
                "::" , stringify ! ( alloc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops ) ) . free as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops ) ,
                "::" , stringify ! ( free ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops ) ) . enqueue as * const
                _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops ) ,
                "::" , stringify ! ( enqueue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops ) ) . dequeue as * const
                _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops ) ,
                "::" , stringify ! ( dequeue ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops ) ) . get_count as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops ) ,
                "::" , stringify ! ( get_count ) ));
}
impl Clone for rte_mempool_ops {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool_ops {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
/**
 * Structure storing the table of registered ops structs, each of which contain
 * the function pointers for the mempool ops functions.
 * Each process has its own storage for this ops struct array so that
 * the mempools can be shared across primary and secondary processes.
 * The indices used to access the array are valid across processes, whereas
 * any function pointers stored directly in the mempool struct would not be.
 * This results in us simply having "ops_index" in the mempool struct.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mempool_ops_table {
    /**< Spinlock for add/delete. */
    pub sl: rte_spinlock_t,
    /**< Number of used ops structs in the table. */
    pub num_ops: u32,
    pub __bindgen_padding_0: [u64; 7usize],
    /**
	 * Storage for all possible ops structs.
	 */
    pub ops: [rte_mempool_ops; 16usize],
}
#[test]
fn bindgen_test_layout_rte_mempool_ops_table() {
    assert_eq!(::std::mem::size_of::<rte_mempool_ops_table>() , 2112usize ,
               concat ! ( "Size of: " , stringify ! ( rte_mempool_ops_table )
               ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops_table ) ) . sl as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops_table )
                , "::" , stringify ! ( sl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops_table ) ) . num_ops as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops_table )
                , "::" , stringify ! ( num_ops ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mempool_ops_table ) ) . ops as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mempool_ops_table )
                , "::" , stringify ! ( ops ) ));
}
impl Clone for rte_mempool_ops_table {
    fn clone(&self) -> Self { *self }
}
impl Default for rte_mempool_ops_table {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
extern "C" {
    /**
 * @internal Wrapper for mempool_ops alloc callback.
 *
 * @param mp
 *   Pointer to the memory pool.
 * @return
 *   - 0: Success; successfully allocated mempool pool_data.
 *   - <0: Error; code of alloc function.
 */
    pub fn rte_mempool_ops_alloc(mp: *mut rte_mempool)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * @internal wrapper for mempool_ops get_count callback.
 *
 * @param mp
 *   Pointer to the memory pool.
 * @return
 *   The number of available objects in the external pool.
 */
    pub fn rte_mempool_ops_get_count(mp: *const rte_mempool)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    /**
 * @internal wrapper for mempool_ops free callback.
 *
 * @param mp
 *   Pointer to the memory pool.
 */
    pub fn rte_mempool_ops_free(mp: *mut rte_mempool);
}
extern "C" {
    /**
 * Set the ops of a mempool.
 *
 * This can only be done on a mempool that is not populated, i.e. just after
 * a call to rte_mempool_create_empty().
 *
 * @param mp
 *   Pointer to the memory pool.
 * @param name
 *   Name of the ops structure to use for this mempool.
 * @param pool_config
 *   Opaque data that can be passed by the application to the ops functions.
 * @return
 *   - 0: Success; the mempool is now using the requested ops functions.
 *   - -EINVAL - Invalid ops struct name provided.
 *   - -EEXIST - mempool already has an ops struct assigned.
 */
    pub fn rte_mempool_set_ops_byname(mp: *mut rte_mempool,
                                      name: *const ::std::os::raw::c_char,
                                      pool_config:
                                          *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Register mempool operations.
 *
 * @param ops
 *   Pointer to an ops structure to register.
 * @return
 *   - >=0: Success; return the index of the ops struct in the table.
 *   - -EINVAL - some missing callbacks while registering ops struct.
 *   - -ENOSPC - the maximum number of ops structs has been reached.
 */
    pub fn rte_mempool_register_ops(ops: *const rte_mempool_ops)
     -> ::std::os::raw::c_int;
}
/**
 * An object callback function for mempool.
 *
 * Used by rte_mempool_create() and rte_mempool_obj_iter().
 */
pub type rte_mempool_obj_cb_t =
    ::std::option::Option<unsafe extern "C" fn(mp: *mut rte_mempool,
                                               opaque:
                                                   *mut ::std::os::raw::c_void,
                                               obj:
                                                   *mut ::std::os::raw::c_void,
                                               obj_idx:
                                                   ::std::os::raw::c_uint)>;
pub type rte_mempool_obj_ctor_t = rte_mempool_obj_cb_t;
/**
 * A memory callback function for mempool.
 *
 * Used by rte_mempool_mem_iter().
 */
pub type rte_mempool_mem_cb_t =
    ::std::option::Option<unsafe extern "C" fn(mp: *mut rte_mempool,
                                               opaque:
                                                   *mut ::std::os::raw::c_void,
                                               memhdr:
                                                   *mut rte_mempool_memhdr,
                                               mem_idx:
                                                   ::std::os::raw::c_uint)>;
/**
 * A mempool constructor callback function.
 *
 * Arguments are the mempool and the opaque pointer given by the user in
 * rte_mempool_create().
 */
pub type rte_mempool_ctor_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut rte_mempool,
                                               arg2:
                                                   *mut ::std::os::raw::c_void)>;
extern "C" {
    /**
 * Create a new mempool named *name* in memory.
 *
 * This function uses ``rte_memzone_reserve()`` to allocate memory. The
 * pool contains n elements of elt_size. Its size is set to n.
 *
 * @param name
 *   The name of the mempool.
 * @param n
 *   The number of elements in the mempool. The optimum size (in terms of
 *   memory usage) for a mempool is when n is a power of two minus one:
 *   n = (2^q - 1).
 * @param elt_size
 *   The size of each element.
 * @param cache_size
 *   If cache_size is non-zero, the rte_mempool library will try to
 *   limit the accesses to the common lockless pool, by maintaining a
 *   per-lcore object cache. This argument must be lower or equal to
 *   CONFIG_RTE_MEMPOOL_CACHE_MAX_SIZE and n / 1.5. It is advised to choose
 *   cache_size to have "n modulo cache_size == 0": if this is
 *   not the case, some elements will always stay in the pool and will
 *   never be used. The access to the per-lcore table is of course
 *   faster than the multi-producer/consumer pool. The cache can be
 *   disabled if the cache_size argument is set to 0; it can be useful to
 *   avoid losing objects in cache. Note that even if not used, the
 *   memory space for cache is always reserved in a mempool structure,
 *   except if CONFIG_RTE_MEMPOOL_CACHE_MAX_SIZE is set to 0.
 * @param private_data_size
 *   The size of the private data appended after the mempool
 *   structure. This is useful for storing some private data after the
 *   mempool structure, as is done for rte_mbuf_pool for example.
 * @param mp_init
 *   A function pointer that is called for initialization of the pool,
 *   before object initialization. The user can initialize the private
 *   data in this function if needed. This parameter can be NULL if
 *   not needed.
 * @param mp_init_arg
 *   An opaque pointer to data that can be used in the mempool
 *   constructor function.
 * @param obj_init
 *   A function pointer that is called for each object at
 *   initialization of the pool. The user can set some meta data in
 *   objects if needed. This parameter can be NULL if not needed.
 *   The obj_init() function takes the mempool pointer, the init_arg,
 *   the object pointer and the object number as parameters.
 * @param obj_init_arg
 *   An opaque pointer to data that can be used as an argument for
 *   each call to the object constructor function.
 * @param socket_id
 *   The *socket_id* argument is the socket identifier in the case of
 *   NUMA. The value can be *SOCKET_ID_ANY* if there is no NUMA
 *   constraint for the reserved zone.
 * @param flags
 *   The *flags* arguments is an OR of following flags:
 *   - MEMPOOL_F_NO_SPREAD: By default, objects addresses are spread
 *     between channels in RAM: the pool allocator will add padding
 *     between objects depending on the hardware configuration. See
 *     Memory alignment constraints for details. If this flag is set,
 *     the allocator will just align them to a cache line.
 *   - MEMPOOL_F_NO_CACHE_ALIGN: By default, the returned objects are
 *     cache-aligned. This flag removes this constraint, and no
 *     padding will be present between objects. This flag implies
 *     MEMPOOL_F_NO_SPREAD.
 *   - MEMPOOL_F_SP_PUT: If this flag is set, the default behavior
 *     when using rte_mempool_put() or rte_mempool_put_bulk() is
 *     "single-producer". Otherwise, it is "multi-producers".
 *   - MEMPOOL_F_SC_GET: If this flag is set, the default behavior
 *     when using rte_mempool_get() or rte_mempool_get_bulk() is
 *     "single-consumer". Otherwise, it is "multi-consumers".
 *   - MEMPOOL_F_NO_PHYS_CONTIG: If set, allocated objects won't
 *     necessarilly be contiguous in physical memory.
 * @return
 *   The pointer to the new allocated mempool, on success. NULL on error
 *   with rte_errno set appropriately. Possible rte_errno values include:
 *    - E_RTE_NO_CONFIG - function could not get pointer to rte_config structure
 *    - E_RTE_SECONDARY - function was called from a secondary process instance
 *    - EINVAL - cache size provided is too large
 *    - ENOSPC - the maximum number of memzones has already been allocated
 *    - EEXIST - a memzone with the same name already exists
 *    - ENOMEM - no appropriate memory area found in which to create memzone
 */
    pub fn rte_mempool_create(name: *const ::std::os::raw::c_char,
                              n: ::std::os::raw::c_uint,
                              elt_size: ::std::os::raw::c_uint,
                              cache_size: ::std::os::raw::c_uint,
                              private_data_size: ::std::os::raw::c_uint,
                              mp_init: rte_mempool_ctor_t,
                              mp_init_arg: *mut ::std::os::raw::c_void,
                              obj_init: rte_mempool_obj_cb_t,
                              obj_init_arg: *mut ::std::os::raw::c_void,
                              socket_id: ::std::os::raw::c_int,
                              flags: ::std::os::raw::c_uint)
     -> *mut rte_mempool;
}
extern "C" {
    /**
 * Create a new mempool named *name* in memory.
 *
 * The pool contains n elements of elt_size. Its size is set to n.
 * This function uses ``memzone_reserve()`` to allocate the mempool header
 * (and the objects if vaddr is NULL).
 * Depending on the input parameters, mempool elements can be either allocated
 * together with the mempool header, or an externally provided memory buffer
 * could be used to store mempool objects. In later case, that external
 * memory buffer can consist of set of disjoint physical pages.
 *
 * @param name
 *   The name of the mempool.
 * @param n
 *   The number of elements in the mempool. The optimum size (in terms of
 *   memory usage) for a mempool is when n is a power of two minus one:
 *   n = (2^q - 1).
 * @param elt_size
 *   The size of each element.
 * @param cache_size
 *   Size of the cache. See rte_mempool_create() for details.
 * @param private_data_size
 *   The size of the private data appended after the mempool
 *   structure. This is useful for storing some private data after the
 *   mempool structure, as is done for rte_mbuf_pool for example.
 * @param mp_init
 *   A function pointer that is called for initialization of the pool,
 *   before object initialization. The user can initialize the private
 *   data in this function if needed. This parameter can be NULL if
 *   not needed.
 * @param mp_init_arg
 *   An opaque pointer to data that can be used in the mempool
 *   constructor function.
 * @param obj_init
 *   A function called for each object at initialization of the pool.
 *   See rte_mempool_create() for details.
 * @param obj_init_arg
 *   An opaque pointer passed to the object constructor function.
 * @param socket_id
 *   The *socket_id* argument is the socket identifier in the case of
 *   NUMA. The value can be *SOCKET_ID_ANY* if there is no NUMA
 *   constraint for the reserved zone.
 * @param flags
 *   Flags controlling the behavior of the mempool. See
 *   rte_mempool_create() for details.
 * @param vaddr
 *   Virtual address of the externally allocated memory buffer.
 *   Will be used to store mempool objects.
 * @param paddr
 *   Array of physical addresses of the pages that comprises given memory
 *   buffer.
 * @param pg_num
 *   Number of elements in the paddr array.
 * @param pg_shift
 *   LOG2 of the physical pages size.
 * @return
 *   The pointer to the new allocated mempool, on success. NULL on error
 *   with rte_errno set appropriately. See rte_mempool_create() for details.
 */
    pub fn rte_mempool_xmem_create(name: *const ::std::os::raw::c_char,
                                   n: ::std::os::raw::c_uint,
                                   elt_size: ::std::os::raw::c_uint,
                                   cache_size: ::std::os::raw::c_uint,
                                   private_data_size: ::std::os::raw::c_uint,
                                   mp_init: rte_mempool_ctor_t,
                                   mp_init_arg: *mut ::std::os::raw::c_void,
                                   obj_init: rte_mempool_obj_cb_t,
                                   obj_init_arg: *mut ::std::os::raw::c_void,
                                   socket_id: ::std::os::raw::c_int,
                                   flags: ::std::os::raw::c_uint,
                                   vaddr: *mut ::std::os::raw::c_void,
                                   paddr: *const phys_addr_t, pg_num: u32,
                                   pg_shift: u32) -> *mut rte_mempool;
}
extern "C" {
    /**
 * Create an empty mempool
 *
 * The mempool is allocated and initialized, but it is not populated: no
 * memory is allocated for the mempool elements. The user has to call
 * rte_mempool_populate_*() to add memory chunks to the pool. Once
 * populated, the user may also want to initialize each object with
 * rte_mempool_obj_iter().
 *
 * @param name
 *   The name of the mempool.
 * @param n
 *   The maximum number of elements that can be added in the mempool.
 *   The optimum size (in terms of memory usage) for a mempool is when n
 *   is a power of two minus one: n = (2^q - 1).
 * @param elt_size
 *   The size of each element.
 * @param cache_size
 *   Size of the cache. See rte_mempool_create() for details.
 * @param private_data_size
 *   The size of the private data appended after the mempool
 *   structure. This is useful for storing some private data after the
 *   mempool structure, as is done for rte_mbuf_pool for example.
 * @param socket_id
 *   The *socket_id* argument is the socket identifier in the case of
 *   NUMA. The value can be *SOCKET_ID_ANY* if there is no NUMA
 *   constraint for the reserved zone.
 * @param flags
 *   Flags controlling the behavior of the mempool. See
 *   rte_mempool_create() for details.
 * @return
 *   The pointer to the new allocated mempool, on success. NULL on error
 *   with rte_errno set appropriately. See rte_mempool_create() for details.
 */
    pub fn rte_mempool_create_empty(name: *const ::std::os::raw::c_char,
                                    n: ::std::os::raw::c_uint,
                                    elt_size: ::std::os::raw::c_uint,
                                    cache_size: ::std::os::raw::c_uint,
                                    private_data_size: ::std::os::raw::c_uint,
                                    socket_id: ::std::os::raw::c_int,
                                    flags: ::std::os::raw::c_uint)
     -> *mut rte_mempool;
}
extern "C" {
    /**
 * Free a mempool
 *
 * Unlink the mempool from global list, free the memory chunks, and all
 * memory referenced by the mempool. The objects must not be used by
 * other cores as they will be freed.
 *
 * @param mp
 *   A pointer to the mempool structure.
 */
    pub fn rte_mempool_free(mp: *mut rte_mempool);
}
extern "C" {
    /**
 * Add physically contiguous memory for objects in the pool at init
 *
 * Add a virtually and physically contiguous memory chunk in the pool
 * where objects can be instanciated.
 *
 * If the given physical address is unknown (paddr = RTE_BAD_PHYS_ADDR),
 * the chunk doesn't need to be physically contiguous (only virtually),
 * and allocated objects may span two pages.
 *
 * @param mp
 *   A pointer to the mempool structure.
 * @param vaddr
 *   The virtual address of memory that should be used to store objects.
 * @param paddr
 *   The physical address
 * @param len
 *   The length of memory in bytes.
 * @param free_cb
 *   The callback used to free this chunk when destroying the mempool.
 * @param opaque
 *   An opaque argument passed to free_cb.
 * @return
 *   The number of objects added on success.
 *   On error, the chunk is not added in the memory list of the
 *   mempool and a negative errno is returned.
 */
    pub fn rte_mempool_populate_phys(mp: *mut rte_mempool,
                                     vaddr: *mut ::std::os::raw::c_char,
                                     paddr: phys_addr_t, len: usize,
                                     free_cb: rte_mempool_memchunk_free_cb_t,
                                     opaque: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Add physical memory for objects in the pool at init
 *
 * Add a virtually contiguous memory chunk in the pool where objects can
 * be instanciated. The physical addresses corresponding to the virtual
 * area are described in paddr[], pg_num, pg_shift.
 *
 * @param mp
 *   A pointer to the mempool structure.
 * @param vaddr
 *   The virtual address of memory that should be used to store objects.
 * @param paddr
 *   An array of physical addresses of each page composing the virtual
 *   area.
 * @param pg_num
 *   Number of elements in the paddr array.
 * @param pg_shift
 *   LOG2 of the physical pages size.
 * @param free_cb
 *   The callback used to free this chunk when destroying the mempool.
 * @param opaque
 *   An opaque argument passed to free_cb.
 * @return
 *   The number of objects added on success.
 *   On error, the chunks are not added in the memory list of the
 *   mempool and a negative errno is returned.
 */
    pub fn rte_mempool_populate_phys_tab(mp: *mut rte_mempool,
                                         vaddr: *mut ::std::os::raw::c_char,
                                         paddr: *const phys_addr_t,
                                         pg_num: u32, pg_shift: u32,
                                         free_cb:
                                             rte_mempool_memchunk_free_cb_t,
                                         opaque: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Add virtually contiguous memory for objects in the pool at init
 *
 * Add a virtually contiguous memory chunk in the pool where objects can
 * be instanciated.
 *
 * @param mp
 *   A pointer to the mempool structure.
 * @param addr
 *   The virtual address of memory that should be used to store objects.
 *   Must be page-aligned.
 * @param len
 *   The length of memory in bytes. Must be page-aligned.
 * @param pg_sz
 *   The size of memory pages in this virtual area.
 * @param free_cb
 *   The callback used to free this chunk when destroying the mempool.
 * @param opaque
 *   An opaque argument passed to free_cb.
 * @return
 *   The number of objects added on success.
 *   On error, the chunk is not added in the memory list of the
 *   mempool and a negative errno is returned.
 */
    pub fn rte_mempool_populate_virt(mp: *mut rte_mempool,
                                     addr: *mut ::std::os::raw::c_char,
                                     len: usize, pg_sz: usize,
                                     free_cb: rte_mempool_memchunk_free_cb_t,
                                     opaque: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Add memory for objects in the pool at init
 *
 * This is the default function used by rte_mempool_create() to populate
 * the mempool. It adds memory allocated using rte_memzone_reserve().
 *
 * @param mp
 *   A pointer to the mempool structure.
 * @return
 *   The number of objects added on success.
 *   On error, the chunk is not added in the memory list of the
 *   mempool and a negative errno is returned.
 */
    pub fn rte_mempool_populate_default(mp: *mut rte_mempool)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Add memory from anonymous mapping for objects in the pool at init
 *
 * This function mmap an anonymous memory zone that is locked in
 * memory to store the objects of the mempool.
 *
 * @param mp
 *   A pointer to the mempool structure.
 * @return
 *   The number of objects added on success.
 *   On error, the chunk is not added in the memory list of the
 *   mempool and a negative errno is returned.
 */
    pub fn rte_mempool_populate_anon(mp: *mut rte_mempool)
     -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Call a function for each mempool element
 *
 * Iterate across all objects attached to a rte_mempool and call the
 * callback function on it.
 *
 * @param mp
 *   A pointer to an initialized mempool.
 * @param obj_cb
 *   A function pointer that is called for each object.
 * @param obj_cb_arg
 *   An opaque pointer passed to the callback function.
 * @return
 *   Number of objects iterated.
 */
    pub fn rte_mempool_obj_iter(mp: *mut rte_mempool,
                                obj_cb: rte_mempool_obj_cb_t,
                                obj_cb_arg: *mut ::std::os::raw::c_void)
     -> u32;
}
extern "C" {
    /**
 * Call a function for each mempool memory chunk
 *
 * Iterate across all memory chunks attached to a rte_mempool and call
 * the callback function on it.
 *
 * @param mp
 *   A pointer to an initialized mempool.
 * @param mem_cb
 *   A function pointer that is called for each memory chunk.
 * @param mem_cb_arg
 *   An opaque pointer passed to the callback function.
 * @return
 *   Number of memory chunks iterated.
 */
    pub fn rte_mempool_mem_iter(mp: *mut rte_mempool,
                                mem_cb: rte_mempool_mem_cb_t,
                                mem_cb_arg: *mut ::std::os::raw::c_void)
     -> u32;
}
extern "C" {
    /**
 * Dump the status of the mempool to a file.
 *
 * @param f
 *   A pointer to a file for output
 * @param mp
 *   A pointer to the mempool structure.
 */
    pub fn rte_mempool_dump(f: *mut FILE, mp: *mut rte_mempool);
}
extern "C" {
    /**
 * Create a user-owned mempool cache.
 *
 * This can be used by non-EAL threads to enable caching when they
 * interact with a mempool.
 *
 * @param size
 *   The size of the mempool cache. See rte_mempool_create()'s cache_size
 *   parameter description for more information. The same limits and
 *   considerations apply here too.
 * @param socket_id
 *   The socket identifier in the case of NUMA. The value can be
 *   SOCKET_ID_ANY if there is no NUMA constraint for the reserved zone.
 */
    pub fn rte_mempool_cache_create(size: u32,
                                    socket_id: ::std::os::raw::c_int)
     -> *mut rte_mempool_cache;
}
extern "C" {
    /**
 * Free a user-owned mempool cache.
 *
 * @param cache
 *   A pointer to the mempool cache.
 */
    pub fn rte_mempool_cache_free(cache: *mut rte_mempool_cache);
}
extern "C" {
    /**
 * Return the number of entries in the mempool.
 *
 * When cache is enabled, this function has to browse the length of
 * all lcores, so it should not be used in a data path, but only for
 * debug purposes. User-owned mempool caches are not accounted for.
 *
 * @param mp
 *   A pointer to the mempool structure.
 * @return
 *   The number of entries in the mempool.
 */
    pub fn rte_mempool_avail_count(mp: *const rte_mempool)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    /**
 * @deprecated
 * Return the number of entries in the mempool.
 *
 * When cache is enabled, this function has to browse the length of
 * all lcores, so it should not be used in a data path, but only for
 * debug purposes.
 *
 * @param mp
 *   A pointer to the mempool structure.
 * @return
 *   The number of entries in the mempool.
 */
    pub fn rte_mempool_count(mp: *const rte_mempool)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    /**
 * Return the number of elements which have been allocated from the mempool
 *
 * When cache is enabled, this function has to browse the length of
 * all lcores, so it should not be used in a data path, but only for
 * debug purposes.
 *
 * @param mp
 *   A pointer to the mempool structure.
 * @return
 *   The number of free entries in the mempool.
 */
    pub fn rte_mempool_in_use_count(mp: *const rte_mempool)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    /**
 * Check the consistency of mempool objects.
 *
 * Verify the coherency of fields in the mempool structure. Also check
 * that the cookies of mempool objects (even the ones that are not
 * present in pool) have a correct value. If not, a panic will occur.
 *
 * @param mp
 *   A pointer to the mempool structure.
 */
    pub fn rte_mempool_audit(mp: *mut rte_mempool);
}
extern "C" {
    /**
 * Dump the status of all mempools on the console
 *
 * @param f
 *   A pointer to a file for output
 */
    pub fn rte_mempool_list_dump(f: *mut FILE);
}
extern "C" {
    /**
 * Search a mempool from its name
 *
 * @param name
 *   The name of the mempool.
 * @return
 *   The pointer to the mempool matching the name, or NULL if not found.
 *   NULL on error
 *   with rte_errno set appropriately. Possible rte_errno values include:
 *    - ENOENT - required entry not available to return.
 *
 */
    pub fn rte_mempool_lookup(name: *const ::std::os::raw::c_char)
     -> *mut rte_mempool;
}
extern "C" {
    /**
 * Get the header, trailer and total size of a mempool element.
 *
 * Given a desired size of the mempool element and mempool flags,
 * calculates header, trailer, body and total sizes of the mempool object.
 *
 * @param elt_size
 *   The size of each element, without header and trailer.
 * @param flags
 *   The flags used for the mempool creation.
 *   Consult rte_mempool_create() for more information about possible values.
 *   The size of each element.
 * @param sz
 *   The calculated detailed size the mempool object. May be NULL.
 * @return
 *   Total size of the mempool object.
 */
    pub fn rte_mempool_calc_obj_size(elt_size: u32, flags: u32,
                                     sz: *mut rte_mempool_objsz) -> u32;
}
extern "C" {
    /**
 * Get the size of memory required to store mempool elements.
 *
 * Calculate the maximum amount of memory required to store given number
 * of objects. Assume that the memory buffer will be aligned at page
 * boundary.
 *
 * Note that if object size is bigger then page size, then it assumes
 * that pages are grouped in subsets of physically continuous pages big
 * enough to store at least one object.
 *
 * @param elt_num
 *   Number of elements.
 * @param total_elt_sz
 *   The size of each element, including header and trailer, as returned
 *   by rte_mempool_calc_obj_size().
 * @param pg_shift
 *   LOG2 of the physical pages size. If set to 0, ignore page boundaries.
 * @return
 *   Required memory size aligned at page boundary.
 */
    pub fn rte_mempool_xmem_size(elt_num: u32, total_elt_sz: usize,
                                 pg_shift: u32) -> usize;
}
extern "C" {
    /**
 * Get the size of memory required to store mempool elements.
 *
 * Calculate how much memory would be actually required with the given
 * memory footprint to store required number of objects.
 *
 * @param vaddr
 *   Virtual address of the externally allocated memory buffer.
 *   Will be used to store mempool objects.
 * @param elt_num
 *   Number of elements.
 * @param total_elt_sz
 *   The size of each element, including header and trailer, as returned
 *   by rte_mempool_calc_obj_size().
 * @param paddr
 *   Array of physical addresses of the pages that comprises given memory
 *   buffer.
 * @param pg_num
 *   Number of elements in the paddr array.
 * @param pg_shift
 *   LOG2 of the physical pages size.
 * @return
 *   On success, the number of bytes needed to store given number of
 *   objects, aligned to the given page size. If the provided memory
 *   buffer is too small, return a negative value whose absolute value
 *   is the actual number of elements that can be stored in that buffer.
 */
    pub fn rte_mempool_xmem_usage(vaddr: *mut ::std::os::raw::c_void,
                                  elt_num: u32, total_elt_sz: usize,
                                  paddr: *const phys_addr_t, pg_num: u32,
                                  pg_shift: u32) -> isize;
}
extern "C" {
    /**
 * Walk list of all memory pools
 *
 * @param func
 *   Iterator function
 * @param arg
 *   Argument passed to iterator
 */
    pub fn rte_mempool_walk(func:
                                ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                               *mut rte_mempool,
                                                                           arg:
                                                                               *mut ::std::os::raw::c_void)>,
                            arg: *mut ::std::os::raw::c_void);
}
extern "C" {
    /**
 * Get the name of the l2 packet type
 *
 * @param ptype
 *   The packet type value.
 * @return
 *   A non-null string describing the packet type.
 */
    pub fn rte_get_ptype_l2_name(ptype: u32) -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Get the name of the l3 packet type
 *
 * @param ptype
 *   The packet type value.
 * @return
 *   A non-null string describing the packet type.
 */
    pub fn rte_get_ptype_l3_name(ptype: u32) -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Get the name of the l4 packet type
 *
 * @param ptype
 *   The packet type value.
 * @return
 *   A non-null string describing the packet type.
 */
    pub fn rte_get_ptype_l4_name(ptype: u32) -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Get the name of the tunnel packet type
 *
 * @param ptype
 *   The packet type value.
 * @return
 *   A non-null string describing the packet type.
 */
    pub fn rte_get_ptype_tunnel_name(ptype: u32)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Get the name of the inner_l2 packet type
 *
 * @param ptype
 *   The packet type value.
 * @return
 *   A non-null string describing the packet type.
 */
    pub fn rte_get_ptype_inner_l2_name(ptype: u32)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Get the name of the inner_l3 packet type
 *
 * @param ptype
 *   The packet type value.
 * @return
 *   A non-null string describing the packet type.
 */
    pub fn rte_get_ptype_inner_l3_name(ptype: u32)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Get the name of the inner_l4 packet type
 *
 * @param ptype
 *   The packet type value.
 * @return
 *   A non-null string describing the packet type.
 */
    pub fn rte_get_ptype_inner_l4_name(ptype: u32)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Write the packet type name into the buffer
 *
 * @param ptype
 *   The packet type value.
 * @param buf
 *   The buffer where the string is written.
 * @param buflen
 *   The length of the buffer.
 * @return
 *   - 0 on success
 *   - (-1) if the buffer is too small
 */
    pub fn rte_get_ptype_name(ptype: u32, buf: *mut ::std::os::raw::c_char,
                              buflen: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Get the name of a RX offload flag
 *
 * @param mask
 *   The mask describing the flag.
 * @return
 *   The name of this flag, or NULL if it's not a valid RX flag.
 */
    pub fn rte_get_rx_ol_flag_name(mask: u64)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Dump the list of RX offload flags in a buffer
 *
 * @param mask
 *   The mask describing the RX flags.
 * @param buf
 *   The output buffer.
 * @param buflen
 *   The length of the buffer.
 * @return
 *   0 on success, (-1) on error.
 */
    pub fn rte_get_rx_ol_flag_list(mask: u64,
                                   buf: *mut ::std::os::raw::c_char,
                                   buflen: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    /**
 * Get the name of a TX offload flag
 *
 * @param mask
 *   The mask describing the flag. Usually only one bit must be set.
 *   Several bits can be given if they belong to the same mask.
 *   Ex: PKT_TX_L4_MASK.
 * @return
 *   The name of this flag, or NULL if it's not a valid TX flag.
 */
    pub fn rte_get_tx_ol_flag_name(mask: u64)
     -> *const ::std::os::raw::c_char;
}
extern "C" {
    /**
 * Dump the list of TX offload flags in a buffer
 *
 * @param mask
 *   The mask describing the TX flags.
 * @param buf
 *   The output buffer.
 * @param buflen
 *   The length of the buffer.
 * @return
 *   0 on success, (-1) on error.
 */
    pub fn rte_get_tx_ol_flag_list(mask: u64,
                                   buf: *mut ::std::os::raw::c_char,
                                   buflen: usize) -> ::std::os::raw::c_int;
}
pub type MARKER = [*mut ::std::os::raw::c_void; 0usize];
pub type MARKER8 = [u8; 0usize];
/**
 * The generic rte_mbuf, containing a packet mbuf.
 */
#[repr(C)]
#[derive(Debug, Copy)]
pub struct rte_mbuf {
    pub cacheline0: MARKER,
    /**< Virtual address of segment buffer. */
    pub buf_addr: *mut ::std::os::raw::c_void,
    /**< Physical address of segment buffer. */
    pub buf_physaddr: phys_addr_t,
    /**< Length of segment buffer. */
    pub buf_len: u16,
    pub rearm_data: MARKER8,
    pub data_off: u16,
    pub __bindgen_anon_1: rte_mbuf__bindgen_ty_1,
    /**< Number of segments. */
    pub nb_segs: u8,
    /**< Input port. */
    pub port: u8,
    /**< Offload features. */
    pub ol_flags: u64,
    pub rx_descriptor_fields1: MARKER,
    pub __bindgen_anon_2: rte_mbuf__bindgen_ty_2,
    /**< Total pkt len: sum of all segments. */
    pub pkt_len: u32,
    /**< Amount of data in segment buffer. */
    pub data_len: u16,
    /** VLAN TCI (CPU order), valid if PKT_RX_VLAN_STRIPPED is set. */
    pub vlan_tci: u16,
    /**< hash information */
    pub hash: rte_mbuf__bindgen_ty_3,
    /**< Sequence number. See also rte_reorder_insert() */
    pub seqn: u32,
    /** Outer VLAN TCI (CPU order), valid if PKT_RX_QINQ_STRIPPED is set. */
    pub vlan_tci_outer: u16,
    pub cacheline1: MARKER,
    pub __bindgen_anon_3: rte_mbuf__bindgen_ty_4,
    /**< Pool from which mbuf was allocated. */
    pub pool: *mut rte_mempool,
    /**< Next segment of scattered packet. */
    pub next: *mut rte_mbuf,
    pub __bindgen_anon_4: rte_mbuf__bindgen_ty_5,
    /** Size of the application private data. In case of an indirect
	 * mbuf, it stores the direct mbuf private data size. */
    pub priv_size: u16,
    /** Timesync flags for use with IEEE1588. */
    pub timesync: u16,
    pub __bindgen_padding_0: [u32; 7usize],
}
/**
	 * 16-bit Reference counter.
	 * It should only be accessed using the following functions:
	 * rte_mbuf_refcnt_update(), rte_mbuf_refcnt_read(), and
	 * rte_mbuf_refcnt_set(). The functionality of these functions (atomic,
	 * or non-atomic) is controlled by the CONFIG_RTE_MBUF_REFCNT_ATOMIC
	 * config option.
	 */
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mbuf__bindgen_ty_1 {
    /**< Atomically accessed refcnt */
    pub refcnt_atomic: __BindgenUnionField<rte_atomic16_t>,
    /**< Non-atomically accessed refcnt */
    pub refcnt: __BindgenUnionField<u16>,
    pub bindgen_union_field: u16,
}
#[test]
fn bindgen_test_layout_rte_mbuf__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_mbuf__bindgen_ty_1>() , 2usize ,
               concat ! ( "Size of: " , stringify ! ( rte_mbuf__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<rte_mbuf__bindgen_ty_1>() , 2usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_mbuf__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mbuf__bindgen_ty_1 ) ) .
                refcnt_atomic as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mbuf__bindgen_ty_1
                ) , "::" , stringify ! ( refcnt_atomic ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mbuf__bindgen_ty_1 ) ) . refcnt as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mbuf__bindgen_ty_1
                ) , "::" , stringify ! ( refcnt ) ));
}
impl Clone for rte_mbuf__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mbuf__bindgen_ty_2 {
    /**< L2/L3/L4 and tunnel information. */
    pub packet_type: __BindgenUnionField<u32>,
    pub __bindgen_anon_1: __BindgenUnionField<rte_mbuf__bindgen_ty_2__bindgen_ty_1>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mbuf__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_1: [u8; 4usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_rte_mbuf__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_mbuf__bindgen_ty_2__bindgen_ty_1>() ,
               4usize , concat ! (
               "Size of: " , stringify ! (
               rte_mbuf__bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_mbuf__bindgen_ty_2__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                rte_mbuf__bindgen_ty_2__bindgen_ty_1 ) ));
}
impl Clone for rte_mbuf__bindgen_ty_2__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_mbuf__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<rte_mbuf__bindgen_ty_2>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( rte_mbuf__bindgen_ty_2 )
               ));
    assert_eq! (::std::mem::align_of::<rte_mbuf__bindgen_ty_2>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( rte_mbuf__bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mbuf__bindgen_ty_2 ) ) . packet_type
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( rte_mbuf__bindgen_ty_2
                ) , "::" , stringify ! ( packet_type ) ));
}
impl Clone for rte_mbuf__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mbuf__bindgen_ty_3 {
    /**< RSS hash result if RSS enabled */
    pub rss: __BindgenUnionField<u32>,
    /**< Filter identifier if FDIR enabled */
    pub fdir: __BindgenUnionField<rte_mbuf__bindgen_ty_3__bindgen_ty_1>,
    /**< Hierarchical scheduler */
    pub sched: __BindgenUnionField<rte_mbuf__bindgen_ty_3__bindgen_ty_2>,
    /**< User defined tags. See rte_distributor_process() */
    pub usr: __BindgenUnionField<u32>,
    pub bindgen_union_field: [u32; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mbuf__bindgen_ty_3__bindgen_ty_1 {
    pub __bindgen_anon_1: rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
    pub hi: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    pub __bindgen_anon_1: __BindgenUnionField<rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>,
    pub lo: __BindgenUnionField<u32>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub hash: u16,
    pub id: u16,
}
#[test]
fn bindgen_test_layout_rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>()
               , 4usize , concat ! (
               "Size of: " , stringify ! (
               rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1
               ) ));
    assert_eq! (::std::mem::align_of::<rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>()
                , 2usize , concat ! (
                "Alignment of " , stringify ! (
                rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1
                ) ) . hash as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1
                ) , "::" , stringify ! ( hash ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1
                ) ) . id as * const _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1
                ) , "::" , stringify ! ( id ) ));
}
impl Clone for
 rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1>()
               , 4usize , concat ! (
               "Size of: " , stringify ! (
               rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 ) ) . lo as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 ) , "::" ,
                stringify ! ( lo ) ));
}
impl Clone for rte_mbuf__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_rte_mbuf__bindgen_ty_3__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<rte_mbuf__bindgen_ty_3__bindgen_ty_1>() ,
               8usize , concat ! (
               "Size of: " , stringify ! (
               rte_mbuf__bindgen_ty_3__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<rte_mbuf__bindgen_ty_3__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                rte_mbuf__bindgen_ty_3__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const rte_mbuf__bindgen_ty_3__bindgen_ty_1 ) )
                . hi as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                rte_mbuf__bindgen_ty_3__bindgen_ty_1 ) , "::" , stringify ! (
                hi ) ));
}
impl Clone for rte_mbuf__bindgen_ty_3__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct rte_mbuf__bindgen_ty_3__bindgen_ty_2 {
    pub lo: u32,
    pub hi: u32,
}
#[test]
fn bindgen_test_layout_rte_mbuf__bindgen_ty_3__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<rte_mbuf__bindgen_ty_3__bindgen_ty_2>() ,
               8usize , concat ! (
               "Size of: " , stringify ! (
               rte_mbuf__bindgen_ty_3__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<rte_mbuf__bindgen_ty_3__bindgen_ty_2>()
                , 4usize , concat ! (
